       IDENTIFICATION DIVISION.
       PROGRAM-ID. JSON-WITNESS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 JSON-OUTPUT PIC X(100).
       01 JSON-INPUT.
          05 TEXT-VALUE PIC X(4) VALUE 'TEST'.
       PROCEDURE DIVISION.
           JSON GENERATE JSON-OUTPUT FROM JSON-INPUT END-JSON
           GOBACK.
