       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8).
       01 FLAG PIC X.
       01 I PIC 9(4).
       01 J PIC 9(4).
       01 K PIC 9(4).
       01 N PIC 9(4).
       PROCEDURE DIVISION.
       MAIN.
       PERFORM P
       CALL PGM
       GOBACK.
       P.
       IF FLAG = 'Y'
       MOVE 'LIVE0001' TO PGM
       EXIT PARAGRAPH
       ELSE
       EVALUATE FLAG
       WHEN OTHER
       MOVE 'LIVE0002' TO PGM
       EXIT PARAGRAPH
       END-EVALUATE
       END-IF
       MOVE 'DEAD0001' TO PGM.
