       IDENTIFICATION DIVISION.
       PROGRAM-ID. SECTION-ORDINARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'ROOT0001' TO PGM.
       S SECTION.
       CALL PGM
       MOVE 'LIVE0001' TO PGM.
       T SECTION.
       CALL PGM
       GOBACK.
       OUTSIDE-S SECTION.
       CALL 'DEAD0001'.
