       IDENTIFICATION DIVISION.
       PROGRAM-ID. CFC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BUF PIC X(8).
       01 KEEP-NAME PIC X(8).
       01 FN PIC X(8).
       01 SYS PIC X(4).
       01 WS-KEY PIC X(8).
       01 ST PIC X(4).
       01 ST2 PIC X(4).
       01 WS-LEN PIC X(2).
       01 PTR USAGE POINTER.
       01 FLAG PIC X.
       01 INPUT-NAME PIC X(8).
       PROCEDURE DIVISION.
       EXEC CICS READQ TS QUEUE('QUEUE') INTO(BUF) END-EXEC.
       EXEC CICS WRITEQ TS QUEUE('QUEUE') FROM(BUF) END-EXEC.
       EXEC CICS WRITE JOURNALNAME('JOURNAL') FROM(BUF) END-EXEC.
       EXEC CICS RETURN TRANSID('TRN') END-EXEC.
       EXEC CICS READNEXT DATASET('F') INTO(BUF)
       RIDFLD(WS-KEY) NOHANDLE END-EXEC.
       EXEC CICS WRITE DATASET('F') FROM(BUF)
       RIDFLD(WS-KEY) NOHANDLE END-EXEC.
       EXEC CICS DELETE DATASET('F') RIDFLD(WS-KEY)
       NOHANDLE END-EXEC.
       GOBACK.
