000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. FIXCOL72.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
005100 COPY 'SYNCPY01'. 00004000
000600 PROCEDURE DIVISION.
000700 GOBACK.
