       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-11.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
          05 WS-THIRD REDEFINES WS-ALIAS PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001' TO WS-THIRD
       CALL WS-TARGET
       GOBACK.
