       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-14.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
       01 WS-SOURCE PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001' TO WS-SOURCE
       MOVE WS-SOURCE TO WS-ALIAS
       MOVE 'PROGB001' TO WS-SOURCE
       CALL WS-TARGET
       GOBACK.
