       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-6.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
       01 WS-SNAPSHOT PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001' TO WS-ALIAS
       MOVE WS-TARGET TO WS-SNAPSHOT
       MOVE 'PROGB001' TO WS-ALIAS
       CALL WS-SNAPSHOT
       GOBACK.
