       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-9.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001' TO WS-ALIAS
       GO TO P-LIVE.
       P-DEAD.
       MOVE 'DEAD0001' TO WS-TARGET.
       P-LIVE.
       CALL WS-TARGET
       GOBACK.
