       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-10.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
       01 OTHER-GROUP.
          05 OTHER-TARGET PIC X(8).
          05 OTHER-ALIAS REDEFINES OTHER-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001' TO WS-ALIAS
       MOVE 'DEAD0001' TO OTHER-ALIAS
       CALL WS-TARGET
       GOBACK.
