       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-7.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-PARTS REDEFINES WS-TARGET.
             10 WS-LEFT PIC X(4).
             10 WS-RIGHT PIC X(4).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001' TO WS-TARGET
       MOVE 'B001' TO WS-RIGHT
       CALL WS-TARGET
       GOBACK.
