       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
       01 WS-DUMMY PIC X.
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001' TO WS-ALIAS
       PERFORM P-NOISE
       CALL WS-TARGET
       GOBACK.
       P-NOISE.
       MOVE 'X' TO WS-DUMMY.
