       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-5.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       PERFORM P-OUTER
       CALL WS-TARGET
       GOBACK.
       P-OUTER.
       PERFORM P-INNER.
       P-INNER.
       MOVE 'PROGA001' TO WS-ALIAS.
