       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOMINAL-PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       COPY DFHAID.
       COPY DFHBMSCA.
       PROCEDURE DIVISION.
       IF DFHPF3 = DFHENTER
        MOVE 'PROGA001' TO TARGET-PGM
       ELSE
        MOVE 'PROGB001' TO TARGET-PGM
       END-IF.
       CALL TARGET-PGM.
       EXEC CICS XCTL PROGRAM(TARGET-PGM) END-EXEC.
       GOBACK.
       END PROGRAM NOMINAL-PGM.
