       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOMINAL-PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       COPY DFHAID.
       COPY DFHBMSCA.
       PROCEDURE DIVISION.
       EVALUATE DFHPF3
        WHEN DFHENTER MOVE 'PROGA001' TO TARGET-PGM
        WHEN DFHPA1 MOVE 'PROGB001' TO TARGET-PGM
        WHEN OTHER MOVE 'PROGC001' TO TARGET-PGM
       END-EVALUATE.
       CALL TARGET-PGM.
       GOBACK.
       END PROGRAM NOMINAL-PGM.
