       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOMINAL-PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       COPY DFHAID.
       COPY DFHBMSCA.
       PROCEDURE DIVISION.
       MOVE 'PROGA001' TO DFHOPAQ.
       MOVE DFHENTER TO DFHOPAQ.
       CALL DFHOPAQ.
       GOBACK.
       END PROGRAM NOMINAL-PGM.
