       IDENTIFICATION DIVISION.
       PROGRAM-ID. IBM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       01 MQ-MESSAGE.
       COPY CMQTML.
       PROCEDURE DIVISION.
       MOVE 'PROGA001' TO TARGET-PGM.
       MOVE MQTM-APPLID TO TARGET-PGM.
       MOVE 'PROGB001' TO TARGET-PGM.
       CALL TARGET-PGM.
       GOBACK.
       END PROGRAM IBM-ADVERSARY.
