       IDENTIFICATION DIVISION.
       PROGRAM-ID. IBM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       01 DESCRIPTOR.
       COPY CMQMDV.
       PROCEDURE DIVISION.
       MOVE 'PROGA001' TO MQMD-FORMAT.
       MOVE MQMD-STRUCID TO MQMD-FORMAT.
       CALL MQMD-FORMAT.
       GOBACK.
       END PROGRAM IBM-ADVERSARY.
