       IDENTIFICATION DIVISION.
       PROGRAM-ID. IBM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       01 OPTIONS.
       COPY CMQGMOV.
       PROCEDURE DIVISION.
       MOVE 'WIDETEXT' TO MQGMO-STRUCID.
       IF MQGMO-STRUCID = 'WIDE'
        MOVE 'PROGA001' TO TARGET-PGM
       ELSE
        MOVE 'PROGB001' TO TARGET-PGM
       END-IF.
       CALL TARGET-PGM.
       GOBACK.
       END PROGRAM IBM-ADVERSARY.
