       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRUCTURAL-PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 FLAG PIC X.
       COPY DFHAID.
       COPY DFHBMSCA.
       PROCEDURE DIVISION.
       IF DFHNULL OF DFHAID = DFHENTER OF DFHAID
        MOVE 'PROGA001' TO TARGET-PGM
       ELSE
        MOVE 'PROGB001' TO TARGET-PGM
       END-IF.
       CALL TARGET-PGM.
       GOBACK.
       END PROGRAM STRUCTURAL-PGM.
