       IDENTIFICATION DIVISION.
       PROGRAM-ID. IBM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       EXEC SQL INCLUDE SQLCA END-EXEC.
       PROCEDURE DIVISION.
       MOVE 'PROGA001' TO SQLCAID.
       MOVE SQLERRP TO SQLCAID.
       CALL SQLCAID.
       GOBACK.
       END PROGRAM IBM-ADVERSARY.
