       IDENTIFICATION DIVISION.
       PROGRAM-ID. IBM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       EXEC SQL INCLUDE SQLCA END-EXEC.
       PROCEDURE DIVISION.
       MOVE 'WIDETEXT' TO SQLSTATE OF SQLEXT OF SQLCA.
       IF SQLSTATE OF SQLEXT OF SQLCA = 'WIDET'
        MOVE 'PROGA001' TO TARGET-PGM
       ELSE
        MOVE 'PROGB001' TO TARGET-PGM
       END-IF.
       CALL TARGET-PGM.
       GOBACK.
       END PROGRAM IBM-ADVERSARY.
