       IDENTIFICATION DIVISION.
       PROGRAM-ID. IBM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       EXEC SQL INCLUDE SQLCA END-EXEC.
       PROCEDURE DIVISION.
       EVALUATE SQLCODE
        WHEN 0 MOVE 'PROGA001' TO TARGET-PGM
        WHEN OTHER MOVE 'PROGB001' TO TARGET-PGM
       END-EVALUATE.
       CALL TARGET-PGM.
       GOBACK.
       END PROGRAM IBM-ADVERSARY.
