       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOMINAL-PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-PGM PIC X(8).
       01 TARGET-ALIAS REDEFINES TARGET-PGM PIC X(8).
       01 SENTINEL PIC X.
       COPY DFHAID.
       PROCEDURE DIVISION.
       MOVE 'PROGA001' TO TARGET-PGM.
       MOVE DFHPF3 TO TARGET-ALIAS.
       CALL TARGET-PGM.
       GOBACK.
       END PROGRAM NOMINAL-PGM.
