       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLE-REGRESSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T.
       05 P PIC X(8) OCCURS 1000000.
       01 IDX PIC 9(7).
       PROCEDURE DIVISION.
       MOVE 1000000 TO IDX.
       MOVE 'OLD' TO P(IDX).
       MOVE 'GOOD' TO P(IDX).
       CALL P(IDX).
       GOBACK.
