       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLE-REGRESSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T.
       05 P PIC X(8) OCCURS 1000000 VALUE 'OLD'.
       01 IDX PIC 9(7).
       PROCEDURE DIVISION.
       INITIALIZE T.
       ACCEPT IDX.
       MOVE 'NEW' TO P(IDX).
       CALL P(1).
       GOBACK.
