       IDENTIFICATION DIVISION.
       PROGRAM-ID. INIT-ALIAS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T.
       05 P PIC X(8) OCCURS 1000000.
       01 ALT-T REDEFINES T.
       05 ALT-P PIC X(8) OCCURS 1000000.
       PROCEDURE DIVISION.
       MOVE 'OLD' TO P(1).
       INITIALIZE T.
       CALL ALT-P(1).
       GOBACK.
