       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLE-REGRESSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T.
       05 P PIC X(8) OCCURS 1000000.
       01 IDX PIC 9(7).
       PROCEDURE DIVISION.
       ACCEPT IDX.
       MOVE 'FIRST' TO P(1).
       MOVE 'OTHER' TO P(1000000).
       MOVE 'NEW' TO P(IDX).
       CALL P(1).
       GOBACK.
