       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLE-REGRESSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T.
       05 ROW-X OCCURS 1000.
       10 P PIC X(8) OCCURS 1000.
       01 IDX PIC 9(4).
       PROCEDURE DIVISION.
       MOVE 1000 TO IDX.
       MOVE 'OTHER' TO P(1, 1).
       MOVE 'OLD' TO P(IDX, IDX).
       MOVE 'GOOD' TO P(IDX, IDX).
       CALL P(IDX, IDX).
       GOBACK.
