       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLE-REGRESSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T.
       05 NUM-X PIC 9(4) OCCURS 1000000.
       01 P PIC X(8).
       PROCEDURE DIVISION.
       MOVE 1234 TO NUM-X(1).
       INITIALIZE T.
       MOVE NUM-X(1) TO P.
       CALL P.
       GOBACK.
