       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLE-REGRESSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T.
       05 P PIC X(8) OCCURS 1.
       PROCEDURE DIVISION.
       MOVE 'OLD' TO P(1).
       INITIALIZE T.
       CALL P(1).
       GOBACK.
