       IDENTIFICATION DIVISION.
       PROGRAM-ID. CTXOOM8G.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FLAG PIC X.
       01 WS-TEXT PIC X.
       PROCEDURE DIVISION.
       MAIN.
           PERFORM P-0001 THRU P-0900.
           PERFORM P-0002 THRU P-0900.
           PERFORM P-0003 THRU P-0900.
           PERFORM P-0004 THRU P-0900.
           PERFORM P-0005 THRU P-0900.
           PERFORM P-0006 THRU P-0900.
           PERFORM P-0007 THRU P-0900.
           PERFORM P-0008 THRU P-0900.
           PERFORM P-0009 THRU P-0900.
           PERFORM P-0010 THRU P-0900.
           PERFORM P-0011 THRU P-0900.
           PERFORM P-0012 THRU P-0900.
           PERFORM P-0013 THRU P-0900.
           PERFORM P-0014 THRU P-0900.
           PERFORM P-0015 THRU P-0900.
           PERFORM P-0016 THRU P-0900.
           PERFORM P-0017 THRU P-0900.
           PERFORM P-0018 THRU P-0900.
           PERFORM P-0019 THRU P-0900.
           PERFORM P-0020 THRU P-0900.
           PERFORM P-0021 THRU P-0900.
           PERFORM P-0022 THRU P-0900.
           PERFORM P-0023 THRU P-0900.
           PERFORM P-0024 THRU P-0900.
           PERFORM P-0025 THRU P-0900.
           PERFORM P-0026 THRU P-0900.
           PERFORM P-0027 THRU P-0900.
           PERFORM P-0028 THRU P-0900.
           PERFORM P-0029 THRU P-0900.
           PERFORM P-0030 THRU P-0900.
           PERFORM P-0031 THRU P-0900.
           PERFORM P-0032 THRU P-0900.
           PERFORM P-0033 THRU P-0900.
           PERFORM P-0034 THRU P-0900.
           PERFORM P-0035 THRU P-0900.
           PERFORM P-0036 THRU P-0900.
           PERFORM P-0037 THRU P-0900.
           PERFORM P-0038 THRU P-0900.
           PERFORM P-0039 THRU P-0900.
           PERFORM P-0040 THRU P-0900.
           PERFORM P-0041 THRU P-0900.
           PERFORM P-0042 THRU P-0900.
           PERFORM P-0043 THRU P-0900.
           PERFORM P-0044 THRU P-0900.
           PERFORM P-0045 THRU P-0900.
           PERFORM P-0046 THRU P-0900.
           PERFORM P-0047 THRU P-0900.
           PERFORM P-0048 THRU P-0900.
           PERFORM P-0049 THRU P-0900.
           PERFORM P-0050 THRU P-0900.
           PERFORM P-0051 THRU P-0900.
           PERFORM P-0052 THRU P-0900.
           PERFORM P-0053 THRU P-0900.
           PERFORM P-0054 THRU P-0900.
           PERFORM P-0055 THRU P-0900.
           PERFORM P-0056 THRU P-0900.
           PERFORM P-0057 THRU P-0900.
           PERFORM P-0058 THRU P-0900.
           PERFORM P-0059 THRU P-0900.
           PERFORM P-0060 THRU P-0900.
           PERFORM P-0061 THRU P-0900.
           PERFORM P-0062 THRU P-0900.
           PERFORM P-0063 THRU P-0900.
           PERFORM P-0064 THRU P-0900.
           PERFORM P-0065 THRU P-0900.
           PERFORM P-0066 THRU P-0900.
           PERFORM P-0067 THRU P-0900.
           PERFORM P-0068 THRU P-0900.
           PERFORM P-0069 THRU P-0900.
           PERFORM P-0070 THRU P-0900.
           PERFORM P-0071 THRU P-0900.
           PERFORM P-0072 THRU P-0900.
           PERFORM P-0073 THRU P-0900.
           PERFORM P-0074 THRU P-0900.
           PERFORM P-0075 THRU P-0900.
           PERFORM P-0076 THRU P-0900.
           PERFORM P-0077 THRU P-0900.
           PERFORM P-0078 THRU P-0900.
           PERFORM P-0079 THRU P-0900.
           PERFORM P-0080 THRU P-0900.
           PERFORM P-0081 THRU P-0900.
           PERFORM P-0082 THRU P-0900.
           PERFORM P-0083 THRU P-0900.
           PERFORM P-0084 THRU P-0900.
           PERFORM P-0085 THRU P-0900.
           PERFORM P-0086 THRU P-0900.
           PERFORM P-0087 THRU P-0900.
           PERFORM P-0088 THRU P-0900.
           PERFORM P-0089 THRU P-0900.
           PERFORM P-0090 THRU P-0900.
           PERFORM P-0091 THRU P-0900.
           PERFORM P-0092 THRU P-0900.
           PERFORM P-0093 THRU P-0900.
           PERFORM P-0094 THRU P-0900.
           PERFORM P-0095 THRU P-0900.
           PERFORM P-0096 THRU P-0900.
           PERFORM P-0097 THRU P-0900.
           PERFORM P-0098 THRU P-0900.
           PERFORM P-0099 THRU P-0900.
           PERFORM P-0100 THRU P-0900.
           PERFORM P-0101 THRU P-0900.
           PERFORM P-0102 THRU P-0900.
           PERFORM P-0103 THRU P-0900.
           PERFORM P-0104 THRU P-0900.
           PERFORM P-0105 THRU P-0900.
           PERFORM P-0106 THRU P-0900.
           PERFORM P-0107 THRU P-0900.
           PERFORM P-0108 THRU P-0900.
           PERFORM P-0109 THRU P-0900.
           PERFORM P-0110 THRU P-0900.
           PERFORM P-0111 THRU P-0900.
           PERFORM P-0112 THRU P-0900.
           PERFORM P-0113 THRU P-0900.
           PERFORM P-0114 THRU P-0900.
           PERFORM P-0115 THRU P-0900.
           PERFORM P-0116 THRU P-0900.
           PERFORM P-0117 THRU P-0900.
           PERFORM P-0118 THRU P-0900.
           PERFORM P-0119 THRU P-0900.
           PERFORM P-0120 THRU P-0900.
           PERFORM P-0121 THRU P-0900.
           PERFORM P-0122 THRU P-0900.
           PERFORM P-0123 THRU P-0900.
           PERFORM P-0124 THRU P-0900.
           PERFORM P-0125 THRU P-0900.
           PERFORM P-0126 THRU P-0900.
           PERFORM P-0127 THRU P-0900.
           PERFORM P-0128 THRU P-0900.
           PERFORM P-0129 THRU P-0900.
           PERFORM P-0130 THRU P-0900.
           PERFORM P-0131 THRU P-0900.
           PERFORM P-0132 THRU P-0900.
           PERFORM P-0133 THRU P-0900.
           PERFORM P-0134 THRU P-0900.
           PERFORM P-0135 THRU P-0900.
           PERFORM P-0136 THRU P-0900.
           PERFORM P-0137 THRU P-0900.
           PERFORM P-0138 THRU P-0900.
           PERFORM P-0139 THRU P-0900.
           PERFORM P-0140 THRU P-0900.
           PERFORM P-0141 THRU P-0900.
           PERFORM P-0142 THRU P-0900.
           PERFORM P-0143 THRU P-0900.
           PERFORM P-0144 THRU P-0900.
           PERFORM P-0145 THRU P-0900.
           PERFORM P-0146 THRU P-0900.
           PERFORM P-0147 THRU P-0900.
           PERFORM P-0148 THRU P-0900.
           PERFORM P-0149 THRU P-0900.
           PERFORM P-0150 THRU P-0900.
           PERFORM P-0151 THRU P-0900.
           PERFORM P-0152 THRU P-0900.
           PERFORM P-0153 THRU P-0900.
           PERFORM P-0154 THRU P-0900.
           PERFORM P-0155 THRU P-0900.
           PERFORM P-0156 THRU P-0900.
           PERFORM P-0157 THRU P-0900.
           PERFORM P-0158 THRU P-0900.
           PERFORM P-0159 THRU P-0900.
           PERFORM P-0160 THRU P-0900.
           PERFORM P-0161 THRU P-0900.
           PERFORM P-0162 THRU P-0900.
           PERFORM P-0163 THRU P-0900.
           PERFORM P-0164 THRU P-0900.
           PERFORM P-0165 THRU P-0900.
           PERFORM P-0166 THRU P-0900.
           PERFORM P-0167 THRU P-0900.
           PERFORM P-0168 THRU P-0900.
           PERFORM P-0169 THRU P-0900.
           PERFORM P-0170 THRU P-0900.
           PERFORM P-0171 THRU P-0900.
           PERFORM P-0172 THRU P-0900.
           PERFORM P-0173 THRU P-0900.
           PERFORM P-0174 THRU P-0900.
           PERFORM P-0175 THRU P-0900.
           PERFORM P-0176 THRU P-0900.
           PERFORM P-0177 THRU P-0900.
           PERFORM P-0178 THRU P-0900.
           PERFORM P-0179 THRU P-0900.
           PERFORM P-0180 THRU P-0900.
           PERFORM P-0181 THRU P-0900.
           PERFORM P-0182 THRU P-0900.
           PERFORM P-0183 THRU P-0900.
           PERFORM P-0184 THRU P-0900.
           PERFORM P-0185 THRU P-0900.
           PERFORM P-0186 THRU P-0900.
           PERFORM P-0187 THRU P-0900.
           PERFORM P-0188 THRU P-0900.
           PERFORM P-0189 THRU P-0900.
           PERFORM P-0190 THRU P-0900.
           PERFORM P-0191 THRU P-0900.
           PERFORM P-0192 THRU P-0900.
           PERFORM P-0193 THRU P-0900.
           PERFORM P-0194 THRU P-0900.
           PERFORM P-0195 THRU P-0900.
           PERFORM P-0196 THRU P-0900.
           PERFORM P-0197 THRU P-0900.
           PERFORM P-0198 THRU P-0900.
           PERFORM P-0199 THRU P-0900.
           PERFORM P-0200 THRU P-0900.
           PERFORM P-0201 THRU P-0900.
           PERFORM P-0202 THRU P-0900.
           PERFORM P-0203 THRU P-0900.
           PERFORM P-0204 THRU P-0900.
           PERFORM P-0205 THRU P-0900.
           PERFORM P-0206 THRU P-0900.
           PERFORM P-0207 THRU P-0900.
           PERFORM P-0208 THRU P-0900.
           PERFORM P-0209 THRU P-0900.
           PERFORM P-0210 THRU P-0900.
           PERFORM P-0211 THRU P-0900.
           PERFORM P-0212 THRU P-0900.
           PERFORM P-0213 THRU P-0900.
           PERFORM P-0214 THRU P-0900.
           PERFORM P-0215 THRU P-0900.
           PERFORM P-0216 THRU P-0900.
           PERFORM P-0217 THRU P-0900.
           PERFORM P-0218 THRU P-0900.
           PERFORM P-0219 THRU P-0900.
           PERFORM P-0220 THRU P-0900.
           PERFORM P-0221 THRU P-0900.
           PERFORM P-0222 THRU P-0900.
           PERFORM P-0223 THRU P-0900.
           PERFORM P-0224 THRU P-0900.
           PERFORM P-0225 THRU P-0900.
           PERFORM P-0226 THRU P-0900.
           PERFORM P-0227 THRU P-0900.
           PERFORM P-0228 THRU P-0900.
           PERFORM P-0229 THRU P-0900.
           PERFORM P-0230 THRU P-0900.
           PERFORM P-0231 THRU P-0900.
           PERFORM P-0232 THRU P-0900.
           PERFORM P-0233 THRU P-0900.
           PERFORM P-0234 THRU P-0900.
           PERFORM P-0235 THRU P-0900.
           PERFORM P-0236 THRU P-0900.
           PERFORM P-0237 THRU P-0900.
           PERFORM P-0238 THRU P-0900.
           PERFORM P-0239 THRU P-0900.
           PERFORM P-0240 THRU P-0900.
           PERFORM P-0241 THRU P-0900.
           PERFORM P-0242 THRU P-0900.
           PERFORM P-0243 THRU P-0900.
           PERFORM P-0244 THRU P-0900.
           PERFORM P-0245 THRU P-0900.
           PERFORM P-0246 THRU P-0900.
           PERFORM P-0247 THRU P-0900.
           PERFORM P-0248 THRU P-0900.
           PERFORM P-0249 THRU P-0900.
           PERFORM P-0250 THRU P-0900.
           PERFORM P-0251 THRU P-0900.
           PERFORM P-0252 THRU P-0900.
           PERFORM P-0253 THRU P-0900.
           PERFORM P-0254 THRU P-0900.
           PERFORM P-0255 THRU P-0900.
           PERFORM P-0256 THRU P-0900.
           PERFORM P-0257 THRU P-0900.
           PERFORM P-0258 THRU P-0900.
           PERFORM P-0259 THRU P-0900.
           PERFORM P-0260 THRU P-0900.
           PERFORM P-0261 THRU P-0900.
           PERFORM P-0262 THRU P-0900.
           PERFORM P-0263 THRU P-0900.
           PERFORM P-0264 THRU P-0900.
           PERFORM P-0265 THRU P-0900.
           PERFORM P-0266 THRU P-0900.
           PERFORM P-0267 THRU P-0900.
           PERFORM P-0268 THRU P-0900.
           PERFORM P-0269 THRU P-0900.
           PERFORM P-0270 THRU P-0900.
           PERFORM P-0271 THRU P-0900.
           PERFORM P-0272 THRU P-0900.
           PERFORM P-0273 THRU P-0900.
           PERFORM P-0274 THRU P-0900.
           PERFORM P-0275 THRU P-0900.
           PERFORM P-0276 THRU P-0900.
           PERFORM P-0277 THRU P-0900.
           PERFORM P-0278 THRU P-0900.
           PERFORM P-0279 THRU P-0900.
           PERFORM P-0280 THRU P-0900.
           PERFORM P-0281 THRU P-0900.
           PERFORM P-0282 THRU P-0900.
           PERFORM P-0283 THRU P-0900.
           PERFORM P-0284 THRU P-0900.
           PERFORM P-0285 THRU P-0900.
           PERFORM P-0286 THRU P-0900.
           PERFORM P-0287 THRU P-0900.
           PERFORM P-0288 THRU P-0900.
           PERFORM P-0289 THRU P-0900.
           PERFORM P-0290 THRU P-0900.
           PERFORM P-0291 THRU P-0900.
           PERFORM P-0292 THRU P-0900.
           PERFORM P-0293 THRU P-0900.
           PERFORM P-0294 THRU P-0900.
           PERFORM P-0295 THRU P-0900.
           PERFORM P-0296 THRU P-0900.
           PERFORM P-0297 THRU P-0900.
           PERFORM P-0298 THRU P-0900.
           PERFORM P-0299 THRU P-0900.
           PERFORM P-0300 THRU P-0900.
           PERFORM P-0301 THRU P-0900.
           PERFORM P-0302 THRU P-0900.
           PERFORM P-0303 THRU P-0900.
           PERFORM P-0304 THRU P-0900.
           PERFORM P-0305 THRU P-0900.
           PERFORM P-0306 THRU P-0900.
           PERFORM P-0307 THRU P-0900.
           PERFORM P-0308 THRU P-0900.
           PERFORM P-0309 THRU P-0900.
           PERFORM P-0310 THRU P-0900.
           PERFORM P-0311 THRU P-0900.
           PERFORM P-0312 THRU P-0900.
           PERFORM P-0313 THRU P-0900.
           PERFORM P-0314 THRU P-0900.
           PERFORM P-0315 THRU P-0900.
           PERFORM P-0316 THRU P-0900.
           PERFORM P-0317 THRU P-0900.
           PERFORM P-0318 THRU P-0900.
           PERFORM P-0319 THRU P-0900.
           PERFORM P-0320 THRU P-0900.
           PERFORM P-0321 THRU P-0900.
           PERFORM P-0322 THRU P-0900.
           PERFORM P-0323 THRU P-0900.
           PERFORM P-0324 THRU P-0900.
           PERFORM P-0325 THRU P-0900.
           PERFORM P-0326 THRU P-0900.
           PERFORM P-0327 THRU P-0900.
           PERFORM P-0328 THRU P-0900.
           PERFORM P-0329 THRU P-0900.
           PERFORM P-0330 THRU P-0900.
           PERFORM P-0331 THRU P-0900.
           PERFORM P-0332 THRU P-0900.
           PERFORM P-0333 THRU P-0900.
           PERFORM P-0334 THRU P-0900.
           PERFORM P-0335 THRU P-0900.
           PERFORM P-0336 THRU P-0900.
           PERFORM P-0337 THRU P-0900.
           PERFORM P-0338 THRU P-0900.
           PERFORM P-0339 THRU P-0900.
           PERFORM P-0340 THRU P-0900.
           PERFORM P-0341 THRU P-0900.
           PERFORM P-0342 THRU P-0900.
           PERFORM P-0343 THRU P-0900.
           PERFORM P-0344 THRU P-0900.
           PERFORM P-0345 THRU P-0900.
           PERFORM P-0346 THRU P-0900.
           PERFORM P-0347 THRU P-0900.
           PERFORM P-0348 THRU P-0900.
           PERFORM P-0349 THRU P-0900.
           PERFORM P-0350 THRU P-0900.
           PERFORM P-0351 THRU P-0900.
           PERFORM P-0352 THRU P-0900.
           PERFORM P-0353 THRU P-0900.
           PERFORM P-0354 THRU P-0900.
           PERFORM P-0355 THRU P-0900.
           PERFORM P-0356 THRU P-0900.
           PERFORM P-0357 THRU P-0900.
           PERFORM P-0358 THRU P-0900.
           PERFORM P-0359 THRU P-0900.
           PERFORM P-0360 THRU P-0900.
           PERFORM P-0361 THRU P-0900.
           PERFORM P-0362 THRU P-0900.
           PERFORM P-0363 THRU P-0900.
           PERFORM P-0364 THRU P-0900.
           PERFORM P-0365 THRU P-0900.
           PERFORM P-0366 THRU P-0900.
           PERFORM P-0367 THRU P-0900.
           PERFORM P-0368 THRU P-0900.
           PERFORM P-0369 THRU P-0900.
           PERFORM P-0370 THRU P-0900.
           PERFORM P-0371 THRU P-0900.
           PERFORM P-0372 THRU P-0900.
           PERFORM P-0373 THRU P-0900.
           PERFORM P-0374 THRU P-0900.
           PERFORM P-0375 THRU P-0900.
           PERFORM P-0376 THRU P-0900.
           PERFORM P-0377 THRU P-0900.
           PERFORM P-0378 THRU P-0900.
           PERFORM P-0379 THRU P-0900.
           PERFORM P-0380 THRU P-0900.
           PERFORM P-0381 THRU P-0900.
           PERFORM P-0382 THRU P-0900.
           PERFORM P-0383 THRU P-0900.
           PERFORM P-0384 THRU P-0900.
           PERFORM P-0385 THRU P-0900.
           PERFORM P-0386 THRU P-0900.
           PERFORM P-0387 THRU P-0900.
           PERFORM P-0388 THRU P-0900.
           PERFORM P-0389 THRU P-0900.
           PERFORM P-0390 THRU P-0900.
           PERFORM P-0391 THRU P-0900.
           PERFORM P-0392 THRU P-0900.
           PERFORM P-0393 THRU P-0900.
           PERFORM P-0394 THRU P-0900.
           PERFORM P-0395 THRU P-0900.
           PERFORM P-0396 THRU P-0900.
           PERFORM P-0397 THRU P-0900.
           PERFORM P-0398 THRU P-0900.
           PERFORM P-0399 THRU P-0900.
           PERFORM P-0400 THRU P-0900.
           PERFORM P-0401 THRU P-0900.
           PERFORM P-0402 THRU P-0900.
           PERFORM P-0403 THRU P-0900.
           PERFORM P-0404 THRU P-0900.
           PERFORM P-0405 THRU P-0900.
           PERFORM P-0406 THRU P-0900.
           PERFORM P-0407 THRU P-0900.
           PERFORM P-0408 THRU P-0900.
           PERFORM P-0409 THRU P-0900.
           PERFORM P-0410 THRU P-0900.
           PERFORM P-0411 THRU P-0900.
           PERFORM P-0412 THRU P-0900.
           PERFORM P-0413 THRU P-0900.
           PERFORM P-0414 THRU P-0900.
           PERFORM P-0415 THRU P-0900.
           PERFORM P-0416 THRU P-0900.
           PERFORM P-0417 THRU P-0900.
           PERFORM P-0418 THRU P-0900.
           PERFORM P-0419 THRU P-0900.
           PERFORM P-0420 THRU P-0900.
           PERFORM P-0421 THRU P-0900.
           PERFORM P-0422 THRU P-0900.
           PERFORM P-0423 THRU P-0900.
           PERFORM P-0424 THRU P-0900.
           PERFORM P-0425 THRU P-0900.
           PERFORM P-0426 THRU P-0900.
           PERFORM P-0427 THRU P-0900.
           PERFORM P-0428 THRU P-0900.
           PERFORM P-0429 THRU P-0900.
           PERFORM P-0430 THRU P-0900.
           PERFORM P-0431 THRU P-0900.
           PERFORM P-0432 THRU P-0900.
           PERFORM P-0433 THRU P-0900.
           PERFORM P-0434 THRU P-0900.
           PERFORM P-0435 THRU P-0900.
           PERFORM P-0436 THRU P-0900.
           PERFORM P-0437 THRU P-0900.
           PERFORM P-0438 THRU P-0900.
           PERFORM P-0439 THRU P-0900.
           PERFORM P-0440 THRU P-0900.
           PERFORM P-0441 THRU P-0900.
           PERFORM P-0442 THRU P-0900.
           PERFORM P-0443 THRU P-0900.
           PERFORM P-0444 THRU P-0900.
           PERFORM P-0445 THRU P-0900.
           PERFORM P-0446 THRU P-0900.
           PERFORM P-0447 THRU P-0900.
           PERFORM P-0448 THRU P-0900.
           PERFORM P-0449 THRU P-0900.
           PERFORM P-0450 THRU P-0900.
           PERFORM P-0451 THRU P-0900.
           PERFORM P-0452 THRU P-0900.
           PERFORM P-0453 THRU P-0900.
           PERFORM P-0454 THRU P-0900.
           PERFORM P-0455 THRU P-0900.
           PERFORM P-0456 THRU P-0900.
           PERFORM P-0457 THRU P-0900.
           PERFORM P-0458 THRU P-0900.
           PERFORM P-0459 THRU P-0900.
           PERFORM P-0460 THRU P-0900.
           PERFORM P-0461 THRU P-0900.
           PERFORM P-0462 THRU P-0900.
           PERFORM P-0463 THRU P-0900.
           PERFORM P-0464 THRU P-0900.
           PERFORM P-0465 THRU P-0900.
           PERFORM P-0466 THRU P-0900.
           PERFORM P-0467 THRU P-0900.
           PERFORM P-0468 THRU P-0900.
           PERFORM P-0469 THRU P-0900.
           PERFORM P-0470 THRU P-0900.
           PERFORM P-0471 THRU P-0900.
           PERFORM P-0472 THRU P-0900.
           PERFORM P-0473 THRU P-0900.
           PERFORM P-0474 THRU P-0900.
           PERFORM P-0475 THRU P-0900.
           PERFORM P-0476 THRU P-0900.
           PERFORM P-0477 THRU P-0900.
           PERFORM P-0478 THRU P-0900.
           PERFORM P-0479 THRU P-0900.
           PERFORM P-0480 THRU P-0900.
           PERFORM P-0481 THRU P-0900.
           PERFORM P-0482 THRU P-0900.
           PERFORM P-0483 THRU P-0900.
           PERFORM P-0484 THRU P-0900.
           PERFORM P-0485 THRU P-0900.
           PERFORM P-0486 THRU P-0900.
           PERFORM P-0487 THRU P-0900.
           PERFORM P-0488 THRU P-0900.
           PERFORM P-0489 THRU P-0900.
           PERFORM P-0490 THRU P-0900.
           PERFORM P-0491 THRU P-0900.
           PERFORM P-0492 THRU P-0900.
           PERFORM P-0493 THRU P-0900.
           PERFORM P-0494 THRU P-0900.
           PERFORM P-0495 THRU P-0900.
           PERFORM P-0496 THRU P-0900.
           PERFORM P-0497 THRU P-0900.
           PERFORM P-0498 THRU P-0900.
           PERFORM P-0499 THRU P-0900.
           PERFORM P-0500 THRU P-0900.
           PERFORM P-0501 THRU P-0900.
           PERFORM P-0502 THRU P-0900.
           PERFORM P-0503 THRU P-0900.
           PERFORM P-0504 THRU P-0900.
           PERFORM P-0505 THRU P-0900.
           PERFORM P-0506 THRU P-0900.
           PERFORM P-0507 THRU P-0900.
           PERFORM P-0508 THRU P-0900.
           PERFORM P-0509 THRU P-0900.
           PERFORM P-0510 THRU P-0900.
           PERFORM P-0511 THRU P-0900.
           PERFORM P-0512 THRU P-0900.
           PERFORM P-0513 THRU P-0900.
           PERFORM P-0514 THRU P-0900.
           PERFORM P-0515 THRU P-0900.
           PERFORM P-0516 THRU P-0900.
           PERFORM P-0517 THRU P-0900.
           PERFORM P-0518 THRU P-0900.
           PERFORM P-0519 THRU P-0900.
           PERFORM P-0520 THRU P-0900.
           PERFORM P-0521 THRU P-0900.
           PERFORM P-0522 THRU P-0900.
           PERFORM P-0523 THRU P-0900.
           PERFORM P-0524 THRU P-0900.
           PERFORM P-0525 THRU P-0900.
           PERFORM P-0526 THRU P-0900.
           PERFORM P-0527 THRU P-0900.
           PERFORM P-0528 THRU P-0900.
           PERFORM P-0529 THRU P-0900.
           PERFORM P-0530 THRU P-0900.
           PERFORM P-0531 THRU P-0900.
           PERFORM P-0532 THRU P-0900.
           PERFORM P-0533 THRU P-0900.
           PERFORM P-0534 THRU P-0900.
           PERFORM P-0535 THRU P-0900.
           PERFORM P-0536 THRU P-0900.
           PERFORM P-0537 THRU P-0900.
           PERFORM P-0538 THRU P-0900.
           PERFORM P-0539 THRU P-0900.
           PERFORM P-0540 THRU P-0900.
           PERFORM P-0541 THRU P-0900.
           PERFORM P-0542 THRU P-0900.
           PERFORM P-0543 THRU P-0900.
           PERFORM P-0544 THRU P-0900.
           PERFORM P-0545 THRU P-0900.
           PERFORM P-0546 THRU P-0900.
           PERFORM P-0547 THRU P-0900.
           PERFORM P-0548 THRU P-0900.
           PERFORM P-0549 THRU P-0900.
           PERFORM P-0550 THRU P-0900.
           PERFORM P-0551 THRU P-0900.
           PERFORM P-0552 THRU P-0900.
           PERFORM P-0553 THRU P-0900.
           PERFORM P-0554 THRU P-0900.
           PERFORM P-0555 THRU P-0900.
           PERFORM P-0556 THRU P-0900.
           PERFORM P-0557 THRU P-0900.
           PERFORM P-0558 THRU P-0900.
           PERFORM P-0559 THRU P-0900.
           PERFORM P-0560 THRU P-0900.
           PERFORM P-0561 THRU P-0900.
           PERFORM P-0562 THRU P-0900.
           PERFORM P-0563 THRU P-0900.
           PERFORM P-0564 THRU P-0900.
           PERFORM P-0565 THRU P-0900.
           PERFORM P-0566 THRU P-0900.
           PERFORM P-0567 THRU P-0900.
           PERFORM P-0568 THRU P-0900.
           PERFORM P-0569 THRU P-0900.
           PERFORM P-0570 THRU P-0900.
           PERFORM P-0571 THRU P-0900.
           PERFORM P-0572 THRU P-0900.
           PERFORM P-0573 THRU P-0900.
           PERFORM P-0574 THRU P-0900.
           PERFORM P-0575 THRU P-0900.
           PERFORM P-0576 THRU P-0900.
           PERFORM P-0577 THRU P-0900.
           PERFORM P-0578 THRU P-0900.
           PERFORM P-0579 THRU P-0900.
           PERFORM P-0580 THRU P-0900.
           PERFORM P-0581 THRU P-0900.
           PERFORM P-0582 THRU P-0900.
           PERFORM P-0583 THRU P-0900.
           PERFORM P-0584 THRU P-0900.
           PERFORM P-0585 THRU P-0900.
           PERFORM P-0586 THRU P-0900.
           PERFORM P-0587 THRU P-0900.
           PERFORM P-0588 THRU P-0900.
           PERFORM P-0589 THRU P-0900.
           PERFORM P-0590 THRU P-0900.
           PERFORM P-0591 THRU P-0900.
           PERFORM P-0592 THRU P-0900.
           PERFORM P-0593 THRU P-0900.
           PERFORM P-0594 THRU P-0900.
           PERFORM P-0595 THRU P-0900.
           PERFORM P-0596 THRU P-0900.
           PERFORM P-0597 THRU P-0900.
           PERFORM P-0598 THRU P-0900.
           PERFORM P-0599 THRU P-0900.
           PERFORM P-0600 THRU P-0900.
           PERFORM P-0601 THRU P-0900.
           PERFORM P-0602 THRU P-0900.
           PERFORM P-0603 THRU P-0900.
           PERFORM P-0604 THRU P-0900.
           PERFORM P-0605 THRU P-0900.
           PERFORM P-0606 THRU P-0900.
           PERFORM P-0607 THRU P-0900.
           PERFORM P-0608 THRU P-0900.
           PERFORM P-0609 THRU P-0900.
           PERFORM P-0610 THRU P-0900.
           PERFORM P-0611 THRU P-0900.
           PERFORM P-0612 THRU P-0900.
           PERFORM P-0613 THRU P-0900.
           PERFORM P-0614 THRU P-0900.
           PERFORM P-0615 THRU P-0900.
           PERFORM P-0616 THRU P-0900.
           PERFORM P-0617 THRU P-0900.
           PERFORM P-0618 THRU P-0900.
           PERFORM P-0619 THRU P-0900.
           PERFORM P-0620 THRU P-0900.
           PERFORM P-0621 THRU P-0900.
           PERFORM P-0622 THRU P-0900.
           PERFORM P-0623 THRU P-0900.
           PERFORM P-0624 THRU P-0900.
           PERFORM P-0625 THRU P-0900.
           PERFORM P-0626 THRU P-0900.
           PERFORM P-0627 THRU P-0900.
           PERFORM P-0628 THRU P-0900.
           PERFORM P-0629 THRU P-0900.
           PERFORM P-0630 THRU P-0900.
           PERFORM P-0631 THRU P-0900.
           PERFORM P-0632 THRU P-0900.
           PERFORM P-0633 THRU P-0900.
           PERFORM P-0634 THRU P-0900.
           PERFORM P-0635 THRU P-0900.
           PERFORM P-0636 THRU P-0900.
           PERFORM P-0637 THRU P-0900.
           PERFORM P-0638 THRU P-0900.
           PERFORM P-0639 THRU P-0900.
           PERFORM P-0640 THRU P-0900.
           PERFORM P-0641 THRU P-0900.
           PERFORM P-0642 THRU P-0900.
           PERFORM P-0643 THRU P-0900.
           PERFORM P-0644 THRU P-0900.
           PERFORM P-0645 THRU P-0900.
           PERFORM P-0646 THRU P-0900.
           PERFORM P-0647 THRU P-0900.
           PERFORM P-0648 THRU P-0900.
           PERFORM P-0649 THRU P-0900.
           PERFORM P-0650 THRU P-0900.
           PERFORM P-0651 THRU P-0900.
           PERFORM P-0652 THRU P-0900.
           PERFORM P-0653 THRU P-0900.
           PERFORM P-0654 THRU P-0900.
           PERFORM P-0655 THRU P-0900.
           PERFORM P-0656 THRU P-0900.
           PERFORM P-0657 THRU P-0900.
           PERFORM P-0658 THRU P-0900.
           PERFORM P-0659 THRU P-0900.
           PERFORM P-0660 THRU P-0900.
           PERFORM P-0661 THRU P-0900.
           PERFORM P-0662 THRU P-0900.
           PERFORM P-0663 THRU P-0900.
           PERFORM P-0664 THRU P-0900.
           PERFORM P-0665 THRU P-0900.
           PERFORM P-0666 THRU P-0900.
           PERFORM P-0667 THRU P-0900.
           PERFORM P-0668 THRU P-0900.
           PERFORM P-0669 THRU P-0900.
           PERFORM P-0670 THRU P-0900.
           PERFORM P-0671 THRU P-0900.
           PERFORM P-0672 THRU P-0900.
           PERFORM P-0673 THRU P-0900.
           PERFORM P-0674 THRU P-0900.
           PERFORM P-0675 THRU P-0900.
           PERFORM P-0676 THRU P-0900.
           PERFORM P-0677 THRU P-0900.
           PERFORM P-0678 THRU P-0900.
           PERFORM P-0679 THRU P-0900.
           PERFORM P-0680 THRU P-0900.
           PERFORM P-0681 THRU P-0900.
           PERFORM P-0682 THRU P-0900.
           PERFORM P-0683 THRU P-0900.
           PERFORM P-0684 THRU P-0900.
           PERFORM P-0685 THRU P-0900.
           PERFORM P-0686 THRU P-0900.
           PERFORM P-0687 THRU P-0900.
           PERFORM P-0688 THRU P-0900.
           PERFORM P-0689 THRU P-0900.
           PERFORM P-0690 THRU P-0900.
           PERFORM P-0691 THRU P-0900.
           PERFORM P-0692 THRU P-0900.
           PERFORM P-0693 THRU P-0900.
           PERFORM P-0694 THRU P-0900.
           PERFORM P-0695 THRU P-0900.
           PERFORM P-0696 THRU P-0900.
           PERFORM P-0697 THRU P-0900.
           PERFORM P-0698 THRU P-0900.
           PERFORM P-0699 THRU P-0900.
           PERFORM P-0700 THRU P-0900.
           PERFORM P-0701 THRU P-0900.
           PERFORM P-0702 THRU P-0900.
           PERFORM P-0703 THRU P-0900.
           PERFORM P-0704 THRU P-0900.
           PERFORM P-0705 THRU P-0900.
           PERFORM P-0706 THRU P-0900.
           PERFORM P-0707 THRU P-0900.
           PERFORM P-0708 THRU P-0900.
           PERFORM P-0709 THRU P-0900.
           PERFORM P-0710 THRU P-0900.
           PERFORM P-0711 THRU P-0900.
           PERFORM P-0712 THRU P-0900.
           PERFORM P-0713 THRU P-0900.
           PERFORM P-0714 THRU P-0900.
           PERFORM P-0715 THRU P-0900.
           PERFORM P-0716 THRU P-0900.
           PERFORM P-0717 THRU P-0900.
           PERFORM P-0718 THRU P-0900.
           PERFORM P-0719 THRU P-0900.
           PERFORM P-0720 THRU P-0900.
           PERFORM P-0721 THRU P-0900.
           PERFORM P-0722 THRU P-0900.
           PERFORM P-0723 THRU P-0900.
           PERFORM P-0724 THRU P-0900.
           PERFORM P-0725 THRU P-0900.
           PERFORM P-0726 THRU P-0900.
           PERFORM P-0727 THRU P-0900.
           PERFORM P-0728 THRU P-0900.
           PERFORM P-0729 THRU P-0900.
           PERFORM P-0730 THRU P-0900.
           PERFORM P-0731 THRU P-0900.
           PERFORM P-0732 THRU P-0900.
           PERFORM P-0733 THRU P-0900.
           PERFORM P-0734 THRU P-0900.
           PERFORM P-0735 THRU P-0900.
           PERFORM P-0736 THRU P-0900.
           PERFORM P-0737 THRU P-0900.
           PERFORM P-0738 THRU P-0900.
           PERFORM P-0739 THRU P-0900.
           PERFORM P-0740 THRU P-0900.
           PERFORM P-0741 THRU P-0900.
           PERFORM P-0742 THRU P-0900.
           PERFORM P-0743 THRU P-0900.
           PERFORM P-0744 THRU P-0900.
           PERFORM P-0745 THRU P-0900.
           PERFORM P-0746 THRU P-0900.
           PERFORM P-0747 THRU P-0900.
           PERFORM P-0748 THRU P-0900.
           PERFORM P-0749 THRU P-0900.
           PERFORM P-0750 THRU P-0900.
           PERFORM P-0751 THRU P-0900.
           PERFORM P-0752 THRU P-0900.
           PERFORM P-0753 THRU P-0900.
           PERFORM P-0754 THRU P-0900.
           PERFORM P-0755 THRU P-0900.
           PERFORM P-0756 THRU P-0900.
           PERFORM P-0757 THRU P-0900.
           PERFORM P-0758 THRU P-0900.
           PERFORM P-0759 THRU P-0900.
           PERFORM P-0760 THRU P-0900.
           PERFORM P-0761 THRU P-0900.
           PERFORM P-0762 THRU P-0900.
           PERFORM P-0763 THRU P-0900.
           PERFORM P-0764 THRU P-0900.
           PERFORM P-0765 THRU P-0900.
           PERFORM P-0766 THRU P-0900.
           PERFORM P-0767 THRU P-0900.
           PERFORM P-0768 THRU P-0900.
           PERFORM P-0769 THRU P-0900.
           PERFORM P-0770 THRU P-0900.
           PERFORM P-0771 THRU P-0900.
           PERFORM P-0772 THRU P-0900.
           PERFORM P-0773 THRU P-0900.
           PERFORM P-0774 THRU P-0900.
           PERFORM P-0775 THRU P-0900.
           PERFORM P-0776 THRU P-0900.
           PERFORM P-0777 THRU P-0900.
           PERFORM P-0778 THRU P-0900.
           PERFORM P-0779 THRU P-0900.
           PERFORM P-0780 THRU P-0900.
           PERFORM P-0781 THRU P-0900.
           PERFORM P-0782 THRU P-0900.
           PERFORM P-0783 THRU P-0900.
           PERFORM P-0784 THRU P-0900.
           PERFORM P-0785 THRU P-0900.
           PERFORM P-0786 THRU P-0900.
           PERFORM P-0787 THRU P-0900.
           PERFORM P-0788 THRU P-0900.
           PERFORM P-0789 THRU P-0900.
           PERFORM P-0790 THRU P-0900.
           PERFORM P-0791 THRU P-0900.
           PERFORM P-0792 THRU P-0900.
           PERFORM P-0793 THRU P-0900.
           PERFORM P-0794 THRU P-0900.
           PERFORM P-0795 THRU P-0900.
           PERFORM P-0796 THRU P-0900.
           PERFORM P-0797 THRU P-0900.
           PERFORM P-0798 THRU P-0900.
           PERFORM P-0799 THRU P-0900.
           PERFORM P-0800 THRU P-0900.
           PERFORM P-0801 THRU P-0900.
           PERFORM P-0802 THRU P-0900.
           PERFORM P-0803 THRU P-0900.
           PERFORM P-0804 THRU P-0900.
           PERFORM P-0805 THRU P-0900.
           PERFORM P-0806 THRU P-0900.
           PERFORM P-0807 THRU P-0900.
           PERFORM P-0808 THRU P-0900.
           PERFORM P-0809 THRU P-0900.
           PERFORM P-0810 THRU P-0900.
           PERFORM P-0811 THRU P-0900.
           PERFORM P-0812 THRU P-0900.
           PERFORM P-0813 THRU P-0900.
           PERFORM P-0814 THRU P-0900.
           PERFORM P-0815 THRU P-0900.
           PERFORM P-0816 THRU P-0900.
           PERFORM P-0817 THRU P-0900.
           PERFORM P-0818 THRU P-0900.
           PERFORM P-0819 THRU P-0900.
           PERFORM P-0820 THRU P-0900.
           PERFORM P-0821 THRU P-0900.
           PERFORM P-0822 THRU P-0900.
           PERFORM P-0823 THRU P-0900.
           PERFORM P-0824 THRU P-0900.
           PERFORM P-0825 THRU P-0900.
           PERFORM P-0826 THRU P-0900.
           PERFORM P-0827 THRU P-0900.
           PERFORM P-0828 THRU P-0900.
           PERFORM P-0829 THRU P-0900.
           PERFORM P-0830 THRU P-0900.
           PERFORM P-0831 THRU P-0900.
           PERFORM P-0832 THRU P-0900.
           PERFORM P-0833 THRU P-0900.
           PERFORM P-0834 THRU P-0900.
           PERFORM P-0835 THRU P-0900.
           PERFORM P-0836 THRU P-0900.
           PERFORM P-0837 THRU P-0900.
           PERFORM P-0838 THRU P-0900.
           PERFORM P-0839 THRU P-0900.
           PERFORM P-0840 THRU P-0900.
           PERFORM P-0841 THRU P-0900.
           PERFORM P-0842 THRU P-0900.
           PERFORM P-0843 THRU P-0900.
           PERFORM P-0844 THRU P-0900.
           PERFORM P-0845 THRU P-0900.
           PERFORM P-0846 THRU P-0900.
           PERFORM P-0847 THRU P-0900.
           PERFORM P-0848 THRU P-0900.
           PERFORM P-0849 THRU P-0900.
           PERFORM P-0850 THRU P-0900.
           PERFORM P-0851 THRU P-0900.
           PERFORM P-0852 THRU P-0900.
           PERFORM P-0853 THRU P-0900.
           PERFORM P-0854 THRU P-0900.
           PERFORM P-0855 THRU P-0900.
           PERFORM P-0856 THRU P-0900.
           PERFORM P-0857 THRU P-0900.
           PERFORM P-0858 THRU P-0900.
           PERFORM P-0859 THRU P-0900.
           PERFORM P-0860 THRU P-0900.
           PERFORM P-0861 THRU P-0900.
           PERFORM P-0862 THRU P-0900.
           PERFORM P-0863 THRU P-0900.
           PERFORM P-0864 THRU P-0900.
           PERFORM P-0865 THRU P-0900.
           PERFORM P-0866 THRU P-0900.
           PERFORM P-0867 THRU P-0900.
           PERFORM P-0868 THRU P-0900.
           PERFORM P-0869 THRU P-0900.
           PERFORM P-0870 THRU P-0900.
           PERFORM P-0871 THRU P-0900.
           PERFORM P-0872 THRU P-0900.
           PERFORM P-0873 THRU P-0900.
           PERFORM P-0874 THRU P-0900.
           PERFORM P-0875 THRU P-0900.
           PERFORM P-0876 THRU P-0900.
           PERFORM P-0877 THRU P-0900.
           PERFORM P-0878 THRU P-0900.
           PERFORM P-0879 THRU P-0900.
           PERFORM P-0880 THRU P-0900.
           PERFORM P-0881 THRU P-0900.
           PERFORM P-0882 THRU P-0900.
           PERFORM P-0883 THRU P-0900.
           PERFORM P-0884 THRU P-0900.
           PERFORM P-0885 THRU P-0900.
           PERFORM P-0886 THRU P-0900.
           PERFORM P-0887 THRU P-0900.
           PERFORM P-0888 THRU P-0900.
           PERFORM P-0889 THRU P-0900.
           PERFORM P-0890 THRU P-0900.
           PERFORM P-0891 THRU P-0900.
           PERFORM P-0892 THRU P-0900.
           PERFORM P-0893 THRU P-0900.
           PERFORM P-0894 THRU P-0900.
           PERFORM P-0895 THRU P-0900.
           PERFORM P-0896 THRU P-0900.
           PERFORM P-0897 THRU P-0900.
           PERFORM P-0898 THRU P-0900.
           PERFORM P-0899 THRU P-0900.
           PERFORM P-0900 THRU P-0900.
           GOBACK.

       P-0001.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0002.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0003.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0004.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0005.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0006.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0007.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0008.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0009.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0010.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0011.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0012.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0013.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0014.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0015.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0016.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0017.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0018.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0019.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0020.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0021.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0022.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0023.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0024.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0025.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0026.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0027.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0028.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0029.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0030.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0031.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0032.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0033.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0034.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0035.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0036.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0037.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0038.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0039.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0040.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0041.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0042.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0043.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0044.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0045.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0046.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0047.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0048.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0049.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0050.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0051.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0052.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0053.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0054.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0055.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0056.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0057.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0058.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0059.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0060.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0061.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0062.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0063.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0064.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0065.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0066.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0067.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0068.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0069.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0070.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0071.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0072.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0073.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0074.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0075.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0076.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0077.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0078.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0079.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0080.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0081.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0082.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0083.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0084.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0085.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0086.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0087.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0088.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0089.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0090.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0091.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0092.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0093.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0094.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0095.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0096.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0097.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0098.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0099.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0100.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0101.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0102.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0103.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0104.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0105.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0106.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0107.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0108.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0109.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0110.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0111.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0112.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0113.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0114.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0115.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0116.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0117.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0118.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0119.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0120.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0121.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0122.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0123.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0124.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0125.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0126.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0127.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0128.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0129.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0130.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0131.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0132.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0133.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0134.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0135.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0136.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0137.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0138.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0139.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0140.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0141.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0142.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0143.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0144.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0145.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0146.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0147.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0148.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0149.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0150.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0151.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0152.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0153.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0154.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0155.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0156.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0157.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0158.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0159.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0160.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0161.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0162.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0163.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0164.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0165.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0166.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0167.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0168.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0169.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0170.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0171.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0172.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0173.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0174.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0175.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0176.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0177.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0178.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0179.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0180.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0181.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0182.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0183.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0184.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0185.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0186.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0187.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0188.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0189.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0190.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0191.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0192.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0193.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0194.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0195.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0196.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0197.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0198.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0199.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0200.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0201.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0202.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0203.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0204.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0205.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0206.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0207.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0208.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0209.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0210.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0211.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0212.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0213.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0214.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0215.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0216.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0217.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0218.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0219.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0220.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0221.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0222.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0223.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0224.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0225.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0226.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0227.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0228.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0229.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0230.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0231.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0232.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0233.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0234.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0235.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0236.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0237.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0238.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0239.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0240.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0241.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0242.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0243.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0244.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0245.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0246.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0247.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0248.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0249.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0250.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0251.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0252.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0253.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0254.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0255.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0256.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0257.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0258.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0259.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0260.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0261.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0262.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0263.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0264.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0265.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0266.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0267.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0268.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0269.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0270.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0271.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0272.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0273.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0274.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0275.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0276.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0277.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0278.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0279.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0280.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0281.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0282.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0283.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0284.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0285.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0286.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0287.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0288.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0289.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0290.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0291.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0292.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0293.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0294.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0295.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0296.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0297.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0298.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0299.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0300.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0301.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0302.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0303.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0304.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0305.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0306.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0307.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0308.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0309.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0310.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0311.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0312.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0313.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0314.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0315.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0316.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0317.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0318.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0319.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0320.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0321.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0322.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0323.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0324.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0325.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0326.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0327.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0328.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0329.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0330.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0331.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0332.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0333.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0334.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0335.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0336.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0337.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0338.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0339.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0340.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0341.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0342.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0343.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0344.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0345.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0346.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0347.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0348.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0349.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0350.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0351.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0352.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0353.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0354.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0355.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0356.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0357.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0358.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0359.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0360.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0361.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0362.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0363.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0364.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0365.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0366.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0367.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0368.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0369.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0370.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0371.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0372.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0373.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0374.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0375.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0376.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0377.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0378.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0379.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0380.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0381.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0382.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0383.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0384.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0385.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0386.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0387.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0388.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0389.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0390.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0391.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0392.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0393.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0394.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0395.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0396.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0397.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0398.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0399.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0400.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0401.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0402.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0403.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0404.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0405.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0406.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0407.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0408.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0409.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0410.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0411.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0412.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0413.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0414.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0415.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0416.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0417.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0418.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0419.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0420.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0421.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0422.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0423.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0424.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0425.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0426.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0427.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0428.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0429.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0430.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0431.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0432.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0433.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0434.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0435.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0436.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0437.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0438.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0439.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0440.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0441.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0442.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0443.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0444.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0445.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0446.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0447.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0448.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0449.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0450.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0451.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0452.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0453.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0454.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0455.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0456.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0457.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0458.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0459.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0460.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0461.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0462.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0463.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0464.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0465.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0466.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0467.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0468.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0469.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0470.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0471.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0472.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0473.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0474.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0475.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0476.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0477.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0478.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0479.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0480.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0481.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0482.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0483.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0484.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0485.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0486.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0487.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0488.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0489.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0490.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0491.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0492.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0493.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0494.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0495.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0496.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0497.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0498.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0499.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0500.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0501.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0502.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0503.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0504.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0505.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0506.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0507.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0508.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0509.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0510.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0511.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0512.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0513.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0514.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0515.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0516.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0517.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0518.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0519.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0520.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0521.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0522.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0523.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0524.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0525.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0526.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0527.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0528.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0529.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0530.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0531.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0532.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0533.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0534.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0535.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0536.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0537.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0538.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0539.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0540.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0541.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0542.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0543.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0544.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0545.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0546.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0547.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0548.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0549.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0550.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0551.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0552.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0553.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0554.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0555.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0556.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0557.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0558.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0559.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0560.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0561.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0562.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0563.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0564.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0565.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0566.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0567.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0568.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0569.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0570.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0571.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0572.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0573.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0574.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0575.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0576.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0577.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0578.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0579.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0580.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0581.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0582.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0583.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0584.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0585.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0586.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0587.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0588.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0589.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0590.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0591.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0592.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0593.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0594.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0595.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0596.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0597.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0598.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0599.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0600.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0601.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0602.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0603.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0604.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0605.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0606.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0607.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0608.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0609.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0610.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0611.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0612.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0613.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0614.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0615.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0616.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0617.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0618.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0619.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0620.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0621.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0622.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0623.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0624.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0625.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0626.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0627.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0628.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0629.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0630.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0631.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0632.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0633.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0634.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0635.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0636.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0637.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0638.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0639.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0640.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0641.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0642.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0643.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0644.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0645.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0646.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0647.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0648.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0649.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0650.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0651.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0652.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0653.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0654.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0655.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0656.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0657.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0658.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0659.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0660.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0661.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0662.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0663.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0664.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0665.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0666.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0667.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0668.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0669.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0670.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0671.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0672.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0673.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0674.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0675.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0676.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0677.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0678.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0679.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0680.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0681.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0682.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0683.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0684.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0685.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0686.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0687.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0688.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0689.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0690.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0691.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0692.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0693.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0694.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0695.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0696.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0697.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0698.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0699.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0700.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0701.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0702.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0703.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0704.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0705.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0706.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0707.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0708.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0709.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0710.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0711.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0712.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0713.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0714.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0715.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0716.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0717.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0718.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0719.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0720.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0721.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0722.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0723.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0724.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0725.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0726.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0727.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0728.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0729.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0730.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0731.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0732.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0733.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0734.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0735.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0736.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0737.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0738.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0739.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0740.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0741.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0742.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0743.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0744.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0745.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0746.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0747.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0748.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0749.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0750.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0751.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0752.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0753.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0754.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0755.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0756.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0757.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0758.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0759.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0760.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0761.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0762.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0763.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0764.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0765.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0766.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0767.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0768.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0769.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0770.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0771.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0772.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0773.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0774.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0775.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0776.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0777.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0778.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0779.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0780.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0781.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0782.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0783.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0784.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0785.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0786.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0787.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0788.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0789.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0790.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0791.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0792.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0793.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0794.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0795.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0796.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0797.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0798.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0799.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0800.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0801.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0802.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0803.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0804.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0805.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0806.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0807.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0808.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0809.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0810.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0811.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0812.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0813.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0814.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0815.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0816.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0817.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0818.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0819.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0820.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0821.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0822.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0823.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0824.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0825.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0826.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0827.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0828.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0829.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0830.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0831.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0832.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0833.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0834.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0835.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0836.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0837.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0838.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0839.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0840.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0841.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0842.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0843.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0844.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0845.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0846.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0847.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0848.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0849.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0850.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0851.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0852.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0853.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0854.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0855.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0856.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0857.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0858.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0859.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0860.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.

       P-0861.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0862.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0863.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0864.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0865.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0866.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0867.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0868.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0869.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0870.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0871.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0872.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0873.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0874.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0875.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0876.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0877.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0878.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0879.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0880.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0881.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0882.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0883.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0884.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0885.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0886.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0887.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0888.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0889.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0890.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0891.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0892.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0893.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0894.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0895.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0896.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0897.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0898.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0899.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.

       P-0900.
           MOVE 'A' TO WS-TEXT.
           IF WS-FLAG = 'Y'
               MOVE 'B' TO WS-TEXT
           END-IF.
           MOVE 'C' TO WS-TEXT.
           MOVE 'D' TO WS-TEXT.
           PERFORM HELPER.
           EXIT.

       HELPER.
           MOVE 'H' TO WS-TEXT.
           EXIT.
