       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNQUALIFIED-TRANSFER.
       PROCEDURE DIVISION.
           EXEC CICS HANDLE ABEND LABEL(ERR-P) END-EXEC.
           EXEC CICS XCTL PROGRAM('TARGET01') MYSTERY END-EXEC.
           CALL 'AFTER001'.
           GOBACK.
       ERR-P.
           EXEC CICS ABEND END-EXEC.
           CALL 'HANDLER1'.
