       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISPATCH-PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET PIC X(8) VALUE 'INITIAL1'.
       01 FLAG-VALUE PIC X.
       PROCEDURE DIVISION.
       MAIN.
           EXEC CICS HANDLE ABEND LABEL(ERR-A) END-EXEC.
           EXEC CICS HANDLE ABEND LABEL(ERR-B) END-EXEC.
           EXEC CICS ABEND END-EXEC.
       ERR-A.
           CALL 'HANDLERA'.
           GOBACK.
       ERR-B.
           CALL 'HANDLERB'.
           GOBACK.
