       IDENTIFICATION DIVISION.
       PROGRAM-ID. CICS-CONTROL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY UNKNOWN-MEMBER.
       COPY DFHAID.
       01 BUFFER-AREA.
         05 PART-A PIC X(8) VALUE 'BEFORE01'.
         05 PART-B PIC X(8).
       01 RC PIC S9(8) COMP.
       01 RC2 PIC S9(8) COMP.
       01 MAP-NAME PIC X(8) VALUE 'TESTMAP'.
       01 SENTINEL PIC X.
       PROCEDURE DIVISION.
       MAIN.
           EXEC CICS RECEIVE MAP('M') INTO(BUFFER-AREA)
                RESP(RC) END-EXEC.
           CALL 'AFTER001'.
           GOBACK.
