       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROLLBACK-PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RC PIC S9(8) COMP.
       01 TARGET PIC X(8) VALUE 'BEFORE01'.
       PROCEDURE DIVISION.
           PERFORM WORK-P.
           CALL TARGET.
           GOBACK.
       WORK-P.
           EXEC CICS SYNCPOINT ROLLBACK RESP(RC)
           END-EXEC.
