      * Structural analysis model; runtime contents are unknown.
       10 MQGMO.
       15 MQGMO-STRUCID PIC X(4).
       15 MQGMO-VERSION PIC S9(9) BINARY.
       15 MQGMO-OPTIONS PIC S9(9) BINARY.
       15 MQGMO-WAITINTERVAL PIC S9(9) BINARY.
       15 MQGMO-SIGNAL1 PIC S9(9) BINARY.
       15 MQGMO-SIGNAL2 PIC S9(9) BINARY.
       15 MQGMO-RESOLVEDQNAME PIC X(48).
       15 MQGMO-MATCHOPTIONS PIC S9(9) BINARY.
       15 MQGMO-GROUPSTATUS PIC X.
       15 MQGMO-SEGMENTSTATUS PIC X.
       15 MQGMO-SEGMENTATION PIC X.
       15 MQGMO-RESERVED1 PIC X.
       15 MQGMO-MSGTOKEN PIC X(16).
       15 MQGMO-RETURNEDLENGTH PIC S9(9) BINARY.
       15 MQGMO-RESERVED2 PIC S9(9) BINARY.
       15 MQGMO-MSGHANDLE PIC S9(18) BINARY.
