      * Structural analysis model; runtime contents are unknown.
       10 MQOD.
       15 MQOD-STRUCID PIC X(4).
       15 MQOD-VERSION PIC S9(9) BINARY.
       15 MQOD-OBJECTTYPE PIC S9(9) BINARY.
       15 MQOD-OBJECTNAME PIC X(48).
       15 MQOD-OBJECTQMGRNAME PIC X(48).
       15 MQOD-DYNAMICQNAME PIC X(48).
       15 MQOD-ALTERNATEUSERID PIC X(12).
       15 MQOD-RECSPRESENT PIC S9(9) BINARY.
       15 MQOD-KNOWNDESTCOUNT PIC S9(9) BINARY.
       15 MQOD-UNKNOWNDESTCOUNT PIC S9(9) BINARY.
       15 MQOD-INVALIDDESTCOUNT PIC S9(9) BINARY.
       15 MQOD-OBJECTRECOFFSET PIC S9(9) BINARY.
       15 MQOD-RESPONSERECOFFSET PIC S9(9) BINARY.
       15 MQOD-OBJECTRECPTR POINTER.
       15 MQOD-RESPONSERECPTR POINTER.
       15 MQOD-ALTERNATESECURITYID PIC X(40).
       15 MQOD-RESOLVEDQNAME PIC X(48).
       15 MQOD-RESOLVEDQMGRNAME PIC X(48).
       15 MQOD-OBJECTSTRING.
       20 MQOD-OBJECTSTRING-VSPTR POINTER.
       20 MQOD-OBJECTSTRING-VSOFFSET PIC S9(9) BINARY.
       20 MQOD-OBJECTSTRING-VSBUFSIZE PIC S9(9) BINARY.
       20 MQOD-OBJECTSTRING-VSLENGTH PIC S9(9) BINARY.
       20 MQOD-OBJECTSTRING-VSCCSID PIC S9(9) BINARY.
       15 MQOD-SELECTIONSTRING.
       20 MQOD-SELECTIONSTRING-VSPTR POINTER.
       20 MQOD-SELECTIONSTRING-VSOFFSET PIC S9(9) BINARY.
       20 MQOD-SELECTIONSTRING-VSBUFSIZE PIC S9(9) BINARY.
       20 MQOD-SELECTIONSTRING-VSLENGTH PIC S9(9) BINARY.
       20 MQOD-SELECTIONSTRING-VSCCSID PIC S9(9) BINARY.
       15 MQOD-RESOBJECTSTRING.
       20 MQOD-RESOBJECTSTRING-VSPTR POINTER.
       20 MQOD-RESOBJECTSTRING-VSOFFSET PIC S9(9) BINARY.
       20 MQOD-RESOBJECTSTRING-VSBUFSIZE PIC S9(9) BINARY.
       20 MQOD-RESOBJECTSTRING-VSLENGTH PIC S9(9) BINARY.
       20 MQOD-RESOBJECTSTRING-VSCCSID PIC S9(9) BINARY.
       15 MQOD-RESOLVEDTYPE PIC S9(9) BINARY.
