      * Structural analysis model; runtime contents are unknown.
       10 MQPMO.
       15 MQPMO-STRUCID PIC X(4).
       15 MQPMO-VERSION PIC S9(9) BINARY.
       15 MQPMO-OPTIONS PIC S9(9) BINARY.
       15 MQPMO-TIMEOUT PIC S9(9) BINARY.
       15 MQPMO-CONTEXT PIC S9(9) BINARY.
       15 MQPMO-KNOWNDESTCOUNT PIC S9(9) BINARY.
       15 MQPMO-UNKNOWNDESTCOUNT PIC S9(9) BINARY.
       15 MQPMO-INVALIDDESTCOUNT PIC S9(9) BINARY.
       15 MQPMO-RESOLVEDQNAME PIC X(48).
       15 MQPMO-RESOLVEDQMGRNAME PIC X(48).
       15 MQPMO-RECSPRESENT PIC S9(9) BINARY.
       15 MQPMO-PUTMSGRECFIELDS PIC S9(9) BINARY.
       15 MQPMO-PUTMSGRECOFFSET PIC S9(9) BINARY.
       15 MQPMO-RESPONSERECOFFSET PIC S9(9) BINARY.
       15 MQPMO-PUTMSGRECPTR POINTER.
       15 MQPMO-RESPONSERECPTR POINTER.
       15 MQPMO-ORIGINALMSGHANDLE PIC S9(18) BINARY.
       15 MQPMO-NEWMSGHANDLE PIC S9(18) BINARY.
       15 MQPMO-ACTION PIC S9(9) BINARY.
       15 MQPMO-PUBLEVEL PIC S9(9) BINARY.
