      * Structural analysis model; runtime contents are unknown.
       10 MQAIR-STRUC-ID PIC X(4).
       10 MQAIR-VERSION-1 PIC S9(9) BINARY.
       10 MQAIR-VERSION-2 PIC S9(9) BINARY.
       10 MQAIR-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQAIR-LENGTH-1 PIC S9(9) BINARY.
       10 MQAIR-LENGTH-2 PIC S9(9) BINARY.
       10 MQAIR-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQAIT-ALL PIC S9(9) BINARY.
       10 MQAIT-CRL-LDAP PIC S9(9) BINARY.
       10 MQAIT-OCSP PIC S9(9) BINARY.
       10 MQAIT-IDPW-OS PIC S9(9) BINARY.
       10 MQAIT-IDPW-LDAP PIC S9(9) BINARY.
       10 MQBNO-STRUC-ID PIC X(4).
       10 MQBNO-VERSION-1 PIC S9(9) BINARY.
       10 MQBNO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQBNO-LENGTH-1 PIC S9(9) BINARY.
       10 MQBNO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQBNO-OPTIONS-NONE PIC S9(9) BINARY.
       10 MQBNO-OPTIONS-IGNORE-TRANS PIC S9(9) BINARY.
       10 MQBNO-BALTYPE-SIMPLE PIC S9(9) BINARY.
       10 MQBNO-BALTYPE-REQREP PIC S9(9) BINARY.
       10 MQBNO-BALTYPE-RA-MANAGED PIC S9(9) BINARY.
       10 MQBNO-TIMEOUT-AS-DEFAULT PIC S9(9) BINARY.
       10 MQBNO-TIMEOUT-IMMEDIATE PIC S9(9) BINARY.
       10 MQBNO-TIMEOUT-NEVER PIC S9(9) BINARY.
       10 MQBMHO-STRUC-ID PIC X(4).
       10 MQBMHO-VERSION-1 PIC S9(9) BINARY.
       10 MQBMHO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQBMHO-LENGTH-1 PIC S9(9) BINARY.
       10 MQBMHO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQBMHO-NONE PIC S9(9) BINARY.
       10 MQBMHO-DELETE-PROPERTIES PIC S9(9) BINARY.
       10 MQBO-STRUC-ID PIC X(4).
       10 MQBO-VERSION-1 PIC S9(9) BINARY.
       10 MQBO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQBO-LENGTH-1 PIC S9(9) BINARY.
       10 MQBO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQBO-NONE PIC S9(9) BINARY.
       10 MQCBC-STRUC-ID PIC X(4).
       10 MQCBC-VERSION-1 PIC S9(9) BINARY.
       10 MQCBC-VERSION-2 PIC S9(9) BINARY.
       10 MQCBC-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQCBC-LENGTH-1 PIC S9(9) BINARY.
       10 MQCBC-LENGTH-2 PIC S9(9) BINARY.
       10 MQCBC-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQCBCF-NONE PIC S9(9) BINARY.
       10 MQCBCF-READA-BUFFER-EMPTY PIC S9(9) BINARY.
       10 MQCBCT-START-CALL PIC S9(9) BINARY.
       10 MQCBCT-STOP-CALL PIC S9(9) BINARY.
       10 MQCBCT-REGISTER-CALL PIC S9(9) BINARY.
       10 MQCBCT-DEREGISTER-CALL PIC S9(9) BINARY.
       10 MQCBCT-EVENT-CALL PIC S9(9) BINARY.
       10 MQCBCT-MSG-REMOVED PIC S9(9) BINARY.
       10 MQCBCT-MSG-NOT-REMOVED PIC S9(9) BINARY.
       10 MQCBCT-MC-EVENT-CALL PIC S9(9) BINARY.
       10 MQCS-NONE PIC S9(9) BINARY.
       10 MQCS-SUSPENDED-TEMPORARY PIC S9(9) BINARY.
       10 MQCS-SUSPENDED-USER-ACTION PIC S9(9) BINARY.
       10 MQCS-SUSPENDED PIC S9(9) BINARY.
       10 MQCS-STOPPED PIC S9(9) BINARY.
       10 MQRD-NO-RECONNECT PIC S9(9) BINARY.
       10 MQRD-NO-DELAY PIC S9(9) BINARY.
       10 MQCBD-STRUC-ID PIC X(4).
       10 MQCBD-VERSION-1 PIC S9(9) BINARY.
       10 MQCBD-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQCBD-LENGTH-1 PIC S9(9) BINARY.
       10 MQCBD-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQCBDO-NONE PIC S9(9) BINARY.
       10 MQCBDO-START-CALL PIC S9(9) BINARY.
       10 MQCBDO-STOP-CALL PIC S9(9) BINARY.
       10 MQCBDO-REGISTER-CALL PIC S9(9) BINARY.
       10 MQCBDO-DEREGISTER-CALL PIC S9(9) BINARY.
       10 MQCBDO-FAIL-IF-QUIESCING PIC S9(9) BINARY.
       10 MQCBDO-EVENT-CALL PIC S9(9) BINARY.
       10 MQCBDO-MC-EVENT-CALL PIC S9(9) BINARY.
       10 MQCBT-MESSAGE-CONSUMER PIC S9(9) BINARY.
       10 MQCBT-EVENT-HANDLER PIC S9(9) BINARY.
       10 MQCBD-FULL-MSG-LENGTH PIC S9(9) BINARY.
       10 MQVS-NULL-TERMINATED PIC S9(9) BINARY.
       10 MQCIH-STRUC-ID PIC X(4).
       10 MQCIH-VERSION-1 PIC S9(9) BINARY.
       10 MQCIH-VERSION-2 PIC S9(9) BINARY.
       10 MQCIH-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQCIH-LENGTH-1 PIC S9(9) BINARY.
       10 MQCIH-LENGTH-2 PIC S9(9) BINARY.
       10 MQCIH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQCIH-NONE PIC S9(9) BINARY.
       10 MQCIH-PASS-EXPIRATION PIC S9(9) BINARY.
       10 MQCIH-UNLIMITED-EXPIRATION PIC S9(9) BINARY.
       10 MQCIH-REPLY-WITHOUT-NULLS PIC S9(9) BINARY.
       10 MQCIH-REPLY-WITH-NULLS PIC S9(9) BINARY.
       10 MQCIH-SYNC-ON-RETURN PIC S9(9) BINARY.
       10 MQCIH-NO-SYNC-ON-RETURN PIC S9(9) BINARY.
       10 MQCRC-OK PIC S9(9) BINARY.
       10 MQCRC-CICS-EXEC-ERROR PIC S9(9) BINARY.
       10 MQCRC-MQ-API-ERROR PIC S9(9) BINARY.
       10 MQCRC-BRIDGE-ERROR PIC S9(9) BINARY.
       10 MQCRC-BRIDGE-ABEND PIC S9(9) BINARY.
       10 MQCRC-APPLICATION-ABEND PIC S9(9) BINARY.
       10 MQCRC-SECURITY-ERROR PIC S9(9) BINARY.
       10 MQCRC-PROGRAM-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQCRC-BRIDGE-TIMEOUT PIC S9(9) BINARY.
       10 MQCRC-TRANSID-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQCUOWC-ONLY PIC S9(9) BINARY.
       10 MQCUOWC-CONTINUE PIC S9(9) BINARY.
       10 MQCUOWC-FIRST PIC S9(9) BINARY.
       10 MQCUOWC-MIDDLE PIC S9(9) BINARY.
       10 MQCUOWC-LAST PIC S9(9) BINARY.
       10 MQCUOWC-COMMIT PIC S9(9) BINARY.
       10 MQCUOWC-BACKOUT PIC S9(9) BINARY.
       10 MQCGWI-DEFAULT PIC S9(9) BINARY.
       10 MQCLT-PROGRAM PIC S9(9) BINARY.
       10 MQCLT-TRANSACTION PIC S9(9) BINARY.
       10 MQCODL-AS-INPUT PIC S9(9) BINARY.
       10 MQCADSD-NONE PIC S9(9) BINARY.
       10 MQCADSD-SEND PIC S9(9) BINARY.
       10 MQCADSD-RECV PIC S9(9) BINARY.
       10 MQCADSD-MSGFORMAT PIC S9(9) BINARY.
       10 MQCCT-YES PIC S9(9) BINARY.
       10 MQCCT-NO PIC S9(9) BINARY.
       10 MQCTES-NOSYNC PIC S9(9) BINARY.
       10 MQCTES-COMMIT PIC S9(9) BINARY.
       10 MQCTES-BACKOUT PIC S9(9) BINARY.
       10 MQCTES-ENDTASK PIC S9(9) BINARY.
       10 MQCFAC-NONE PIC X(8).
       10 MQCFUNC-MQCONN PIC X(4).
       10 MQCFUNC-MQGET PIC X(4).
       10 MQCFUNC-MQINQ PIC X(4).
       10 MQCFUNC-MQOPEN PIC X(4).
       10 MQCFUNC-MQPUT PIC X(4).
       10 MQCFUNC-MQPUT1 PIC X(4).
       10 MQCFUNC-NONE PIC X(4).
       10 MQCSC-START PIC X(4).
       10 MQCSC-STARTDATA PIC X(4).
       10 MQCSC-TERMINPUT PIC X(4).
       10 MQCSC-NONE PIC X(4).
       10 MQCMHO-STRUC-ID PIC X(4).
       10 MQCMHO-VERSION-1 PIC S9(9) BINARY.
       10 MQCMHO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQCMHO-LENGTH-1 PIC S9(9) BINARY.
       10 MQCMHO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQCMHO-DEFAULT-VALIDATION PIC S9(9) BINARY.
       10 MQCMHO-NO-VALIDATION PIC S9(9) BINARY.
       10 MQCMHO-VALIDATE PIC S9(9) BINARY.
       10 MQCMHO-NONE PIC S9(9) BINARY.
       10 MQCTLO-STRUC-ID PIC X(4).
       10 MQCTLO-VERSION-1 PIC S9(9) BINARY.
       10 MQCTLO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQCTLO-LENGTH-1 PIC S9(9) BINARY.
       10 MQCTLO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQCTLO-NONE PIC S9(9) BINARY.
       10 MQCTLO-THREAD-AFFINITY PIC S9(9) BINARY.
       10 MQCTLO-FAIL-IF-QUIESCING PIC S9(9) BINARY.
       10 MQSCO-STRUC-ID PIC X(4).
       10 MQSCO-VERSION-1 PIC S9(9) BINARY.
       10 MQSCO-VERSION-2 PIC S9(9) BINARY.
       10 MQSCO-VERSION-3 PIC S9(9) BINARY.
       10 MQSCO-VERSION-4 PIC S9(9) BINARY.
       10 MQSCO-VERSION-5 PIC S9(9) BINARY.
       10 MQSCO-VERSION-6 PIC S9(9) BINARY.
       10 MQSCO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQSCO-LENGTH-1 PIC S9(9) BINARY.
       10 MQSCO-LENGTH-2 PIC S9(9) BINARY.
       10 MQSCO-LENGTH-3 PIC S9(9) BINARY.
       10 MQSCO-LENGTH-4 PIC S9(9) BINARY.
       10 MQSCO-LENGTH-5 PIC S9(9) BINARY.
       10 MQSCO-LENGTH-6 PIC S9(9) BINARY.
       10 MQSCO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQ-SUITE-B-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQ-SUITE-B-NONE PIC S9(9) BINARY.
       10 MQ-SUITE-B-128-BIT PIC S9(9) BINARY.
       10 MQ-SUITE-B-192-BIT PIC S9(9) BINARY.
       10 MQSCO-RESET-COUNT-DEFAULT PIC S9(9) BINARY.
       10 MQ-CERT-VAL-POLICY-DEFAULT PIC S9(9) BINARY.
       10 MQ-CERT-VAL-POLICY-ANY PIC S9(9) BINARY.
       10 MQ-CERT-VAL-POLICY-RFC5280 PIC S9(9) BINARY.
       10 MQ-CERT-VAL-POLICY-NONE PIC S9(9) BINARY.
       10 MQCSP-STRUC-ID PIC X(4).
       10 MQCSP-VERSION-1 PIC S9(9) BINARY.
       10 MQCSP-VERSION-2 PIC S9(9) BINARY.
       10 MQCSP-VERSION-3 PIC S9(9) BINARY.
       10 MQCSP-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQCSP-LENGTH-1 PIC S9(9) BINARY.
       10 MQCSP-LENGTH-2 PIC S9(9) BINARY.
       10 MQCSP-LENGTH-3 PIC S9(9) BINARY.
       10 MQCSP-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQCSP-AUTH-NONE PIC S9(9) BINARY.
       10 MQCSP-AUTH-USER-ID-AND-PWD PIC S9(9) BINARY.
       10 MQCSP-AUTH-ID-TOKEN PIC S9(9) BINARY.
       10 MQCNO-STRUC-ID PIC X(4).
       10 MQCNO-VERSION-1 PIC S9(9) BINARY.
       10 MQCNO-VERSION-2 PIC S9(9) BINARY.
       10 MQCNO-VERSION-3 PIC S9(9) BINARY.
       10 MQCNO-VERSION-4 PIC S9(9) BINARY.
       10 MQCNO-VERSION-5 PIC S9(9) BINARY.
       10 MQCNO-VERSION-6 PIC S9(9) BINARY.
       10 MQCNO-VERSION-7 PIC S9(9) BINARY.
       10 MQCNO-VERSION-8 PIC S9(9) BINARY.
       10 MQCNO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQCNO-LENGTH-1 PIC S9(9) BINARY.
       10 MQCNO-LENGTH-2 PIC S9(9) BINARY.
       10 MQCNO-LENGTH-3 PIC S9(9) BINARY.
       10 MQCNO-LENGTH-4 PIC S9(9) BINARY.
       10 MQCNO-LENGTH-5 PIC S9(9) BINARY.
       10 MQCNO-LENGTH-6 PIC S9(9) BINARY.
       10 MQCNO-LENGTH-7 PIC S9(9) BINARY.
       10 MQCNO-LENGTH-8 PIC S9(9) BINARY.
       10 MQCNO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQCNO-STANDARD-BINDING PIC S9(9) BINARY.
       10 MQCNO-FASTPATH-BINDING PIC S9(9) BINARY.
       10 MQCNO-SERIALIZE-CONN-TAG-Q-MGR PIC S9(9) BINARY.
       10 MQCNO-SERIALIZE-CONN-TAG-QSG PIC S9(9) BINARY.
       10 MQCNO-RESTRICT-CONN-TAG-Q-MGR PIC S9(9) BINARY.
       10 MQCNO-RESTRICT-CONN-TAG-QSG PIC S9(9) BINARY.
       10 MQCNO-HANDLE-SHARE-NONE PIC S9(9) BINARY.
       10 MQCNO-HANDLE-SHARE-BLOCK PIC S9(9) BINARY.
       10 MQCNO-HANDLE-SHARE-NO-BLOCK PIC S9(9) BINARY.
       10 MQCNO-SHARED-BINDING PIC S9(9) BINARY.
       10 MQCNO-ISOLATED-BINDING PIC S9(9) BINARY.
       10 MQCNO-LOCAL-BINDING PIC S9(9) BINARY.
       10 MQCNO-CLIENT-BINDING PIC S9(9) BINARY.
       10 MQCNO-ACCOUNTING-MQI-ENABLED PIC S9(9) BINARY.
       10 MQCNO-ACCOUNTING-MQI-DISABLED PIC S9(9) BINARY.
       10 MQCNO-ACCOUNTING-Q-ENABLED PIC S9(9) BINARY.
       10 MQCNO-ACCOUNTING-Q-DISABLED PIC S9(9) BINARY.
       10 MQCNO-NO-CONV-SHARING PIC S9(9) BINARY.
       10 MQCNO-ALL-CONVS-SHARE PIC S9(9) BINARY.
       10 MQCNO-CD-FOR-OUTPUT-ONLY PIC S9(9) BINARY.
       10 MQCNO-USE-CD-SELECTION PIC S9(9) BINARY.
       10 MQCNO-GENERATE-CONN-TAG PIC S9(9) BINARY.
       10 MQCNO-RECONNECT-AS-DEF PIC S9(9) BINARY.
       10 MQCNO-RECONNECT PIC S9(9) BINARY.
       10 MQCNO-RECONNECT-DISABLED PIC S9(9) BINARY.
       10 MQCNO-RECONNECT-Q-MGR PIC S9(9) BINARY.
       10 MQCNO-ACTIVITY-TRACE-ENABLED PIC S9(9) BINARY.
       10 MQCNO-ACTIVITY-TRACE-DISABLED PIC S9(9) BINARY.
       10 MQCNO-NONE PIC S9(9) BINARY.
       10 MQCT-NONE PIC X(128).
       10 MQCONNID-NONE PIC X(24).
       10 MQAN-NONE PIC X(28).
       10 MQDH-STRUC-ID PIC X(4).
       10 MQDH-VERSION-1 PIC S9(9) BINARY.
       10 MQDH-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQDH-LENGTH-1 PIC S9(9) BINARY.
       10 MQDH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQDHF-NEW-MSG-IDS PIC S9(9) BINARY.
       10 MQDHF-NONE PIC S9(9) BINARY.
       10 MQDLH-STRUC-ID PIC X(4).
       10 MQDLH-VERSION-1 PIC S9(9) BINARY.
       10 MQDLH-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQDLH-LENGTH-1 PIC S9(9) BINARY.
       10 MQDLH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQDMHO-STRUC-ID PIC X(4).
       10 MQDMHO-VERSION-1 PIC S9(9) BINARY.
       10 MQDMHO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQDMHO-LENGTH-1 PIC S9(9) BINARY.
       10 MQDMHO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQDMHO-NONE PIC S9(9) BINARY.
       10 MQDMPO-STRUC-ID PIC X(4).
       10 MQDMPO-VERSION-1 PIC S9(9) BINARY.
       10 MQDMPO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQDMPO-LENGTH-1 PIC S9(9) BINARY.
       10 MQDMPO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQDMPO-DEL-FIRST PIC S9(9) BINARY.
       10 MQDMPO-DEL-PROP-UNDER-CURSOR PIC S9(9) BINARY.
       10 MQDMPO-NONE PIC S9(9) BINARY.
       10 MQGMO-STRUC-ID PIC X(4).
       10 MQGMO-VERSION-1 PIC S9(9) BINARY.
       10 MQGMO-VERSION-2 PIC S9(9) BINARY.
       10 MQGMO-VERSION-3 PIC S9(9) BINARY.
       10 MQGMO-VERSION-4 PIC S9(9) BINARY.
       10 MQGMO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQGMO-LENGTH-1 PIC S9(9) BINARY.
       10 MQGMO-LENGTH-2 PIC S9(9) BINARY.
       10 MQGMO-LENGTH-3 PIC S9(9) BINARY.
       10 MQGMO-LENGTH-4 PIC S9(9) BINARY.
       10 MQGMO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQGMO-WAIT PIC S9(9) BINARY.
       10 MQGMO-NO-WAIT PIC S9(9) BINARY.
       10 MQGMO-SET-SIGNAL PIC S9(9) BINARY.
       10 MQGMO-FAIL-IF-QUIESCING PIC S9(9) BINARY.
       10 MQGMO-SYNCPOINT PIC S9(9) BINARY.
       10 MQGMO-SYNCPOINT-IF-PERSISTENT PIC S9(9) BINARY.
       10 MQGMO-NO-SYNCPOINT PIC S9(9) BINARY.
       10 MQGMO-MARK-SKIP-BACKOUT PIC S9(9) BINARY.
       10 MQGMO-BROWSE-FIRST PIC S9(9) BINARY.
       10 MQGMO-BROWSE-NEXT PIC S9(9) BINARY.
       10 MQGMO-BROWSE-MSG-UNDER-CURSOR PIC S9(9) BINARY.
       10 MQGMO-MSG-UNDER-CURSOR PIC S9(9) BINARY.
       10 MQGMO-LOCK PIC S9(9) BINARY.
       10 MQGMO-UNLOCK PIC S9(9) BINARY.
       10 MQGMO-ACCEPT-TRUNCATED-MSG PIC S9(9) BINARY.
       10 MQGMO-CONVERT PIC S9(9) BINARY.
       10 MQGMO-LOGICAL-ORDER PIC S9(9) BINARY.
       10 MQGMO-COMPLETE-MSG PIC S9(9) BINARY.
       10 MQGMO-ALL-MSGS-AVAILABLE PIC S9(9) BINARY.
       10 MQGMO-ALL-SEGMENTS-AVAILABLE PIC S9(9) BINARY.
       10 MQGMO-MARK-BROWSE-HANDLE PIC S9(9) BINARY.
       10 MQGMO-MARK-BROWSE-CO-OP PIC S9(9) BINARY.
       10 MQGMO-UNMARK-BROWSE-CO-OP PIC S9(9) BINARY.
       10 MQGMO-UNMARK-BROWSE-HANDLE PIC S9(9) BINARY.
       10 MQGMO-UNMARKED-BROWSE-MSG PIC S9(9) BINARY.
       10 MQGMO-PROPERTIES-FORCE-MQRFH2 PIC S9(9) BINARY.
       10 MQGMO-NO-PROPERTIES PIC S9(9) BINARY.
       10 MQGMO-PROPERTIES-IN-HANDLE PIC S9(9) BINARY.
       10 MQGMO-PROPERTIES-COMPATIBILITY PIC S9(9) BINARY.
       10 MQGMO-PROPERTIES-AS-Q-DEF PIC S9(9) BINARY.
       10 MQGMO-NONE PIC S9(9) BINARY.
       10 MQGMO-BROWSE-HANDLE PIC S9(9) BINARY.
       10 MQGMO-BROWSE-CO-OP PIC S9(9) BINARY.
       10 MQWI-UNLIMITED PIC S9(9) BINARY.
       10 MQEC-MSG-ARRIVED PIC S9(9) BINARY.
       10 MQEC-WAIT-INTERVAL-EXPIRED PIC S9(9) BINARY.
       10 MQEC-WAIT-CANCELED PIC S9(9) BINARY.
       10 MQEC-Q-MGR-QUIESCING PIC S9(9) BINARY.
       10 MQEC-CONNECTION-QUIESCING PIC S9(9) BINARY.
       10 MQMO-MATCH-MSG-ID PIC S9(9) BINARY.
       10 MQMO-MATCH-CORREL-ID PIC S9(9) BINARY.
       10 MQMO-MATCH-GROUP-ID PIC S9(9) BINARY.
       10 MQMO-MATCH-MSG-SEQ-NUMBER PIC S9(9) BINARY.
       10 MQMO-MATCH-OFFSET PIC S9(9) BINARY.
       10 MQMO-MATCH-MSG-TOKEN PIC S9(9) BINARY.
       10 MQMO-NONE PIC S9(9) BINARY.
       10 MQGS-NOT-IN-GROUP PIC X.
       10 MQGS-MSG-IN-GROUP PIC X.
       10 MQGS-LAST-MSG-IN-GROUP PIC X.
       10 MQSS-NOT-A-SEGMENT PIC X.
       10 MQSS-SEGMENT PIC X.
       10 MQSS-LAST-SEGMENT PIC X.
       10 MQSEG-INHIBITED PIC X.
       10 MQSEG-ALLOWED PIC X.
       10 MQMTOK-NONE PIC X(16).
       10 MQRL-UNDEFINED PIC S9(9) BINARY.
       10 MQIIH-STRUC-ID PIC X(4).
       10 MQIIH-VERSION-1 PIC S9(9) BINARY.
       10 MQIIH-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQIIH-LENGTH-1 PIC S9(9) BINARY.
       10 MQIIH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQIIH-NONE PIC S9(9) BINARY.
       10 MQIIH-PASS-EXPIRATION PIC S9(9) BINARY.
       10 MQIIH-UNLIMITED-EXPIRATION PIC S9(9) BINARY.
       10 MQIIH-REPLY-FORMAT-NONE PIC S9(9) BINARY.
       10 MQIIH-IGNORE-PURG PIC S9(9) BINARY.
       10 MQIIH-CM0-REQUEST-RESPONSE PIC S9(9) BINARY.
       10 MQIAUT-NONE PIC X(8).
       10 MQITII-NONE PIC X(16).
       10 MQITS-IN-CONVERSATION PIC X.
       10 MQITS-NOT-IN-CONVERSATION PIC X.
       10 MQITS-ARCHITECTED PIC X.
       10 MQICM-COMMIT-THEN-SEND PIC X.
       10 MQICM-SEND-THEN-COMMIT PIC X.
       10 MQISS-CHECK PIC X.
       10 MQISS-FULL PIC X.
       10 MQIMPO-STRUC-ID PIC X(4).
       10 MQIMPO-VERSION-1 PIC S9(9) BINARY.
       10 MQIMPO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQIMPO-LENGTH-1 PIC S9(9) BINARY.
       10 MQIMPO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQIMPO-CONVERT-TYPE PIC S9(9) BINARY.
       10 MQIMPO-QUERY-LENGTH PIC S9(9) BINARY.
       10 MQIMPO-INQ-FIRST PIC S9(9) BINARY.
       10 MQIMPO-INQ-NEXT PIC S9(9) BINARY.
       10 MQIMPO-INQ-PROP-UNDER-CURSOR PIC S9(9) BINARY.
       10 MQIMPO-CONVERT-VALUE PIC S9(9) BINARY.
       10 MQIMPO-NONE PIC S9(9) BINARY.
       10 MQMD-STRUC-ID PIC X(4).
       10 MQMD-VERSION-1 PIC S9(9) BINARY.
       10 MQMD-VERSION-2 PIC S9(9) BINARY.
       10 MQMD-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQMD-LENGTH-1 PIC S9(9) BINARY.
       10 MQMD-LENGTH-2 PIC S9(9) BINARY.
       10 MQMD-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQRO-EXCEPTION PIC S9(9) BINARY.
       10 MQRO-EXCEPTION-WITH-DATA PIC S9(9) BINARY.
       10 MQRO-EXCEPTION-WITH-FULL-DATA PIC S9(9) BINARY.
       10 MQRO-EXPIRATION PIC S9(9) BINARY.
       10 MQRO-EXPIRATION-WITH-DATA PIC S9(9) BINARY.
       10 MQRO-EXPIRATION-WITH-FULL-DATA PIC S9(9) BINARY.
       10 MQRO-COA PIC S9(9) BINARY.
       10 MQRO-COA-WITH-DATA PIC S9(9) BINARY.
       10 MQRO-COA-WITH-FULL-DATA PIC S9(9) BINARY.
       10 MQRO-COD PIC S9(9) BINARY.
       10 MQRO-COD-WITH-DATA PIC S9(9) BINARY.
       10 MQRO-COD-WITH-FULL-DATA PIC S9(9) BINARY.
       10 MQRO-PAN PIC S9(9) BINARY.
       10 MQRO-NAN PIC S9(9) BINARY.
       10 MQRO-ACTIVITY PIC S9(9) BINARY.
       10 MQRO-NEW-MSG-ID PIC S9(9) BINARY.
       10 MQRO-PASS-MSG-ID PIC S9(9) BINARY.
       10 MQRO-COPY-MSG-ID-TO-CORREL-ID PIC S9(9) BINARY.
       10 MQRO-PASS-CORREL-ID PIC S9(9) BINARY.
       10 MQRO-DEAD-LETTER-Q PIC S9(9) BINARY.
       10 MQRO-DISCARD-MSG PIC S9(9) BINARY.
       10 MQRO-PASS-DISCARD-AND-EXPIRY PIC S9(9) BINARY.
       10 MQRO-NONE PIC S9(9) BINARY.
       10 MQRO-REJECT-UNSUP-MASK PIC S9(9) BINARY.
       10 MQRO-ACCEPT-UNSUP-MASK PIC S9(9) BINARY.
       10 MQRO-ACCEPT-UNSUP-IF-XMIT-MASK PIC S9(9) BINARY.
       10 MQMT-SYSTEM-FIRST PIC S9(9) BINARY.
       10 MQMT-REQUEST PIC S9(9) BINARY.
       10 MQMT-REPLY PIC S9(9) BINARY.
       10 MQMT-DATAGRAM PIC S9(9) BINARY.
       10 MQMT-REPORT PIC S9(9) BINARY.
       10 MQMT-MQE-FIELDS-FROM-MQE PIC S9(9) BINARY.
       10 MQMT-MQE-FIELDS PIC S9(9) BINARY.
       10 MQMT-SYSTEM-LAST PIC S9(9) BINARY.
       10 MQMT-APPL-FIRST PIC S9(9) BINARY.
       10 MQMT-APPL-LAST PIC S9(9) BINARY.
       10 MQEI-UNLIMITED PIC S9(9) BINARY.
       10 MQFB-NONE PIC S9(9) BINARY.
       10 MQFB-SYSTEM-FIRST PIC S9(9) BINARY.
       10 MQFB-QUIT PIC S9(9) BINARY.
       10 MQFB-EXPIRATION PIC S9(9) BINARY.
       10 MQFB-COA PIC S9(9) BINARY.
       10 MQFB-COD PIC S9(9) BINARY.
       10 MQFB-CHANNEL-COMPLETED PIC S9(9) BINARY.
       10 MQFB-CHANNEL-FAIL-RETRY PIC S9(9) BINARY.
       10 MQFB-CHANNEL-FAIL PIC S9(9) BINARY.
       10 MQFB-APPL-CANNOT-BE-STARTED PIC S9(9) BINARY.
       10 MQFB-TM-ERROR PIC S9(9) BINARY.
       10 MQFB-APPL-TYPE-ERROR PIC S9(9) BINARY.
       10 MQFB-STOPPED-BY-MSG-EXIT PIC S9(9) BINARY.
       10 MQFB-ACTIVITY PIC S9(9) BINARY.
       10 MQFB-XMIT-Q-MSG-ERROR PIC S9(9) BINARY.
       10 MQFB-PAN PIC S9(9) BINARY.
       10 MQFB-NAN PIC S9(9) BINARY.
       10 MQFB-STOPPED-BY-CHAD-EXIT PIC S9(9) BINARY.
       10 MQFB-STOPPED-BY-PUBSUB-EXIT PIC S9(9) BINARY.
       10 MQFB-NOT-A-REPOSITORY-MSG PIC S9(9) BINARY.
       10 MQFB-BIND-OPEN-CLUSRCVR-DEL PIC S9(9) BINARY.
       10 MQFB-MAX-ACTIVITIES PIC S9(9) BINARY.
       10 MQFB-NOT-FORWARDED PIC S9(9) BINARY.
       10 MQFB-NOT-DELIVERED PIC S9(9) BINARY.
       10 MQFB-UNSUPPORTED-FORWARDING PIC S9(9) BINARY.
       10 MQFB-UNSUPPORTED-DELIVERY PIC S9(9) BINARY.
       10 MQFB-DATA-LENGTH-ZERO PIC S9(9) BINARY.
       10 MQFB-DATA-LENGTH-NEGATIVE PIC S9(9) BINARY.
       10 MQFB-DATA-LENGTH-TOO-BIG PIC S9(9) BINARY.
       10 MQFB-BUFFER-OVERFLOW PIC S9(9) BINARY.
       10 MQFB-LENGTH-OFF-BY-ONE PIC S9(9) BINARY.
       10 MQFB-IIH-ERROR PIC S9(9) BINARY.
       10 MQFB-NOT-AUTHORIZED-FOR-IMS PIC S9(9) BINARY.
       10 MQFB-DATA-LENGTH-TOO-SHORT PIC S9(9) BINARY.
       10 MQFB-IMS-ERROR PIC S9(9) BINARY.
       10 MQFB-IMS-FIRST PIC S9(9) BINARY.
       10 MQFB-IMS-LAST PIC S9(9) BINARY.
       10 MQFB-CICS-INTERNAL-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-NOT-AUTHORIZED PIC S9(9) BINARY.
       10 MQFB-CICS-BRIDGE-FAILURE PIC S9(9) BINARY.
       10 MQFB-CICS-CORREL-ID-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-CCSID-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-ENCODING-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-CIH-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-UOW-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-COMMAREA-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-APPL-NOT-STARTED PIC S9(9) BINARY.
       10 MQFB-CICS-APPL-ABENDED PIC S9(9) BINARY.
       10 MQFB-CICS-DLQ-ERROR PIC S9(9) BINARY.
       10 MQFB-CICS-UOW-BACKED-OUT PIC S9(9) BINARY.
       10 MQFB-PUBLICATIONS-ON-REQUEST PIC S9(9) BINARY.
       10 MQFB-SUBSCRIBER-IS-PUBLISHER PIC S9(9) BINARY.
       10 MQFB-MSG-SCOPE-MISMATCH PIC S9(9) BINARY.
       10 MQFB-SELECTOR-MISMATCH PIC S9(9) BINARY.
       10 MQFB-NOT-A-GROUPUR-MSG PIC S9(9) BINARY.
       10 MQFB-IMS-NACK-1A-REASON-FIRST PIC S9(9) BINARY.
       10 MQFB-IMS-NACK-1A-REASON-LAST PIC S9(9) BINARY.
       10 MQFB-SYSTEM-LAST PIC S9(9) BINARY.
       10 MQFB-APPL-FIRST PIC S9(9) BINARY.
       10 MQFB-APPL-LAST PIC S9(9) BINARY.
       10 MQENC-NATIVE PIC S9(9) BINARY.
       10 MQENC-INTEGER-MASK PIC S9(9) BINARY.
       10 MQENC-DECIMAL-MASK PIC S9(9) BINARY.
       10 MQENC-FLOAT-MASK PIC S9(9) BINARY.
       10 MQENC-RESERVED-MASK PIC S9(9) BINARY.
       10 MQENC-INTEGER-UNDEFINED PIC S9(9) BINARY.
       10 MQENC-INTEGER-NORMAL PIC S9(9) BINARY.
       10 MQENC-INTEGER-REVERSED PIC S9(9) BINARY.
       10 MQENC-DECIMAL-UNDEFINED PIC S9(9) BINARY.
       10 MQENC-DECIMAL-NORMAL PIC S9(9) BINARY.
       10 MQENC-DECIMAL-REVERSED PIC S9(9) BINARY.
       10 MQENC-FLOAT-UNDEFINED PIC S9(9) BINARY.
       10 MQENC-FLOAT-IEEE-NORMAL PIC S9(9) BINARY.
       10 MQENC-FLOAT-IEEE-REVERSED PIC S9(9) BINARY.
       10 MQENC-FLOAT-S390 PIC S9(9) BINARY.
       10 MQENC-FLOAT-TNS PIC S9(9) BINARY.
       10 MQENC-NORMAL PIC S9(9) BINARY.
       10 MQENC-REVERSED PIC S9(9) BINARY.
       10 MQENC-S390 PIC S9(9) BINARY.
       10 MQENC-TNS PIC S9(9) BINARY.
       10 MQENC-AS-PUBLISHED PIC S9(9) BINARY.
       10 MQCCSI-UNDEFINED PIC S9(9) BINARY.
       10 MQCCSI-DEFAULT PIC S9(9) BINARY.
       10 MQCCSI-Q-MGR PIC S9(9) BINARY.
       10 MQCCSI-INHERIT PIC S9(9) BINARY.
       10 MQCCSI-EMBEDDED PIC S9(9) BINARY.
       10 MQCCSI-APPL PIC S9(9) BINARY.
       10 MQCCSI-AS-PUBLISHED PIC S9(9) BINARY.
       10 MQFMT-NONE PIC X(8).
       10 MQFMT-ADMIN PIC X(8).
       10 MQFMT-AMQP PIC X(8).
       10 MQFMT-CHANNEL-COMPLETED PIC X(8).
       10 MQFMT-CICS PIC X(8).
       10 MQFMT-COMMAND-1 PIC X(8).
       10 MQFMT-COMMAND-2 PIC X(8).
       10 MQFMT-DEAD-LETTER-HEADER PIC X(8).
       10 MQFMT-DIST-HEADER PIC X(8).
       10 MQFMT-EMBEDDED-PCF PIC X(8).
       10 MQFMT-EVENT PIC X(8).
       10 MQFMT-IMS PIC X(8).
       10 MQFMT-IMS-VAR-STRING PIC X(8).
       10 MQFMT-MD-EXTENSION PIC X(8).
       10 MQFMT-PCF PIC X(8).
       10 MQFMT-REF-MSG-HEADER PIC X(8).
       10 MQFMT-RF-HEADER PIC X(8).
       10 MQFMT-RF-HEADER-1 PIC X(8).
       10 MQFMT-RF-HEADER-2 PIC X(8).
       10 MQFMT-STRING PIC X(8).
       10 MQFMT-TRIGGER PIC X(8).
       10 MQFMT-WORK-INFO-HEADER PIC X(8).
       10 MQFMT-XMIT-Q-HEADER PIC X(8).
       10 MQPRI-PRIORITY-AS-Q-DEF PIC S9(9) BINARY.
       10 MQPRI-PRIORITY-AS-PARENT PIC S9(9) BINARY.
       10 MQPRI-PRIORITY-AS-PUBLISHED PIC S9(9) BINARY.
       10 MQPRI-PRIORITY-AS-TOPIC-DEF PIC S9(9) BINARY.
       10 MQPER-PERSISTENCE-AS-PARENT PIC S9(9) BINARY.
       10 MQPER-NOT-PERSISTENT PIC S9(9) BINARY.
       10 MQPER-PERSISTENT PIC S9(9) BINARY.
       10 MQPER-PERSISTENCE-AS-Q-DEF PIC S9(9) BINARY.
       10 MQPER-PERSISTENCE-AS-TOPIC-DEF PIC S9(9) BINARY.
       10 MQPRT-RESPONSE-AS-PARENT PIC S9(9) BINARY.
       10 MQPRT-SYNC-RESPONSE PIC S9(9) BINARY.
       10 MQPRT-ASYNC-RESPONSE PIC S9(9) BINARY.
       10 MQMI-NONE PIC X(24).
       10 MQCI-NONE PIC X(24).
       10 MQCI-NEW-SESSION PIC X(24).
       10 MQACT-NONE PIC X(32).
       10 MQACTT-UNKNOWN PIC X.
       10 MQACTT-CICS-LUOW-ID PIC X.
       10 MQACTT-OS2-DEFAULT PIC X.
       10 MQACTT-DOS-DEFAULT PIC X.
       10 MQACTT-UNIX-NUMERIC-ID PIC X.
       10 MQACTT-OS400-ACCOUNT-TOKEN PIC X.
       10 MQACTT-WINDOWS-DEFAULT PIC X.
       10 MQACTT-NT-SECURITY-ID PIC X.
       10 MQACTT-AZUREAD-SECURITY-ID PIC X.
       10 MQACTT-MS-ACC-AUTH-SECURITY-ID PIC X.
       10 MQACTT-USER PIC X.
       10 MQAT-UNKNOWN PIC S9(9) BINARY.
       10 MQAT-NO-CONTEXT PIC S9(9) BINARY.
       10 MQAT-CICS PIC S9(9) BINARY.
       10 MQAT-MVS PIC S9(9) BINARY.
       10 MQAT-OS390 PIC S9(9) BINARY.
       10 MQAT-ZOS PIC S9(9) BINARY.
       10 MQAT-IMS PIC S9(9) BINARY.
       10 MQAT-OS2 PIC S9(9) BINARY.
       10 MQAT-DOS PIC S9(9) BINARY.
       10 MQAT-AIX PIC S9(9) BINARY.
       10 MQAT-UNIX PIC S9(9) BINARY.
       10 MQAT-QMGR PIC S9(9) BINARY.
       10 MQAT-OS400 PIC S9(9) BINARY.
       10 MQAT-WINDOWS PIC S9(9) BINARY.
       10 MQAT-CICS-VSE PIC S9(9) BINARY.
       10 MQAT-WINDOWS-NT PIC S9(9) BINARY.
       10 MQAT-VMS PIC S9(9) BINARY.
       10 MQAT-GUARDIAN PIC S9(9) BINARY.
       10 MQAT-NSK PIC S9(9) BINARY.
       10 MQAT-VOS PIC S9(9) BINARY.
       10 MQAT-OPEN-TP1 PIC S9(9) BINARY.
       10 MQAT-VM PIC S9(9) BINARY.
       10 MQAT-IMS-BRIDGE PIC S9(9) BINARY.
       10 MQAT-XCF PIC S9(9) BINARY.
       10 MQAT-CICS-BRIDGE PIC S9(9) BINARY.
       10 MQAT-NOTES-AGENT PIC S9(9) BINARY.
       10 MQAT-TPF PIC S9(9) BINARY.
       10 MQAT-USER PIC S9(9) BINARY.
       10 MQAT-BROKER PIC S9(9) BINARY.
       10 MQAT-QMGR-PUBLISH PIC S9(9) BINARY.
       10 MQAT-JAVA PIC S9(9) BINARY.
       10 MQAT-DQM PIC S9(9) BINARY.
       10 MQAT-CHANNEL-INITIATOR PIC S9(9) BINARY.
       10 MQAT-WLM PIC S9(9) BINARY.
       10 MQAT-BATCH PIC S9(9) BINARY.
       10 MQAT-RRS-BATCH PIC S9(9) BINARY.
       10 MQAT-SIB PIC S9(9) BINARY.
       10 MQAT-SYSTEM-EXTENSION PIC S9(9) BINARY.
       10 MQAT-MCAST-PUBLISH PIC S9(9) BINARY.
       10 MQAT-AMQP PIC S9(9) BINARY.
       10 MQAT-DEFAULT PIC S9(9) BINARY.
       10 MQAT-USER-FIRST PIC S9(9) BINARY.
       10 MQAT-USER-LAST PIC S9(9) BINARY.
       10 MQGI-NONE PIC X(24).
       10 MQMF-SEGMENTATION-INHIBITED PIC S9(9) BINARY.
       10 MQMF-SEGMENTATION-ALLOWED PIC S9(9) BINARY.
       10 MQMF-MSG-IN-GROUP PIC S9(9) BINARY.
       10 MQMF-LAST-MSG-IN-GROUP PIC S9(9) BINARY.
       10 MQMF-SEGMENT PIC S9(9) BINARY.
       10 MQMF-LAST-SEGMENT PIC S9(9) BINARY.
       10 MQMF-NONE PIC S9(9) BINARY.
       10 MQMF-REJECT-UNSUP-MASK PIC S9(9) BINARY.
       10 MQMF-ACCEPT-UNSUP-MASK PIC S9(9) BINARY.
       10 MQMF-ACCEPT-UNSUP-IF-XMIT-MASK PIC S9(9) BINARY.
       10 MQOL-UNDEFINED PIC S9(9) BINARY.
       10 MQMDE-STRUC-ID PIC X(4).
       10 MQMDE-VERSION-2 PIC S9(9) BINARY.
       10 MQMDE-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQMDE-LENGTH-2 PIC S9(9) BINARY.
       10 MQMDE-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQMDEF-NONE PIC S9(9) BINARY.
       10 MQMD1-LENGTH-1 PIC S9(9) BINARY.
       10 MQMD1-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQMD2-LENGTH-1 PIC S9(9) BINARY.
       10 MQMD2-LENGTH-2 PIC S9(9) BINARY.
       10 MQMD2-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQMHBO-STRUC-ID PIC X(4).
       10 MQMHBO-VERSION-1 PIC S9(9) BINARY.
       10 MQMHBO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQMHBO-LENGTH-1 PIC S9(9) BINARY.
       10 MQMHBO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQMHBO-PROPERTIES-IN-MQRFH2 PIC S9(9) BINARY.
       10 MQMHBO-DELETE-PROPERTIES PIC S9(9) BINARY.
       10 MQMHBO-NONE PIC S9(9) BINARY.
       10 MQOD-STRUC-ID PIC X(4).
       10 MQOD-VERSION-1 PIC S9(9) BINARY.
       10 MQOD-VERSION-2 PIC S9(9) BINARY.
       10 MQOD-VERSION-3 PIC S9(9) BINARY.
       10 MQOD-VERSION-4 PIC S9(9) BINARY.
       10 MQOD-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQOD-LENGTH-1 PIC S9(9) BINARY.
       10 MQOD-LENGTH-2 PIC S9(9) BINARY.
       10 MQOD-LENGTH-3 PIC S9(9) BINARY.
       10 MQOD-LENGTH-4 PIC S9(9) BINARY.
       10 MQOD-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQOM-NO PIC S9(9) BINARY.
       10 MQOM-YES PIC S9(9) BINARY.
       10 MQOT-NONE PIC S9(9) BINARY.
       10 MQOT-Q PIC S9(9) BINARY.
       10 MQOT-NAMELIST PIC S9(9) BINARY.
       10 MQOT-PROCESS PIC S9(9) BINARY.
       10 MQOT-STORAGE-CLASS PIC S9(9) BINARY.
       10 MQOT-Q-MGR PIC S9(9) BINARY.
       10 MQOT-CHANNEL PIC S9(9) BINARY.
       10 MQOT-AUTH-INFO PIC S9(9) BINARY.
       10 MQOT-TOPIC PIC S9(9) BINARY.
       10 MQOT-COMM-INFO PIC S9(9) BINARY.
       10 MQOT-CF-STRUC PIC S9(9) BINARY.
       10 MQOT-LISTENER PIC S9(9) BINARY.
       10 MQOT-SERVICE PIC S9(9) BINARY.
       10 MQOT-RESERVED-1 PIC S9(9) BINARY.
       10 MQOT-ALL PIC S9(9) BINARY.
       10 MQOT-ALIAS-Q PIC S9(9) BINARY.
       10 MQOT-MODEL-Q PIC S9(9) BINARY.
       10 MQOT-LOCAL-Q PIC S9(9) BINARY.
       10 MQOT-REMOTE-Q PIC S9(9) BINARY.
       10 MQOT-SENDER-CHANNEL PIC S9(9) BINARY.
       10 MQOT-SERVER-CHANNEL PIC S9(9) BINARY.
       10 MQOT-REQUESTER-CHANNEL PIC S9(9) BINARY.
       10 MQOT-RECEIVER-CHANNEL PIC S9(9) BINARY.
       10 MQOT-CURRENT-CHANNEL PIC S9(9) BINARY.
       10 MQOT-SAVED-CHANNEL PIC S9(9) BINARY.
       10 MQOT-SVRCONN-CHANNEL PIC S9(9) BINARY.
       10 MQOT-CLNTCONN-CHANNEL PIC S9(9) BINARY.
       10 MQOT-SHORT-CHANNEL PIC S9(9) BINARY.
       10 MQOT-CHLAUTH PIC S9(9) BINARY.
       10 MQOT-REMOTE-Q-MGR-NAME PIC S9(9) BINARY.
       10 MQOT-PROT-POLICY PIC S9(9) BINARY.
       10 MQOT-TT-CHANNEL PIC S9(9) BINARY.
       10 MQOT-AMQP-CHANNEL PIC S9(9) BINARY.
       10 MQOT-AUTH-REC PIC S9(9) BINARY.
       10 MQPD-STRUC-ID PIC X(4).
       10 MQPD-VERSION-1 PIC S9(9) BINARY.
       10 MQPD-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQPD-LENGTH-1 PIC S9(9) BINARY.
       10 MQPD-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQPD-NONE PIC S9(9) BINARY.
       10 MQPD-SUPPORT-OPTIONAL PIC S9(9) BINARY.
       10 MQPD-SUPPORT-REQUIRED PIC S9(9) BINARY.
       10 MQPD-SUPPORT-REQUIRED-IF-LOCAL PIC S9(9) BINARY.
       10 MQPD-REJECT-UNSUP-MASK PIC S9(9) BINARY.
       10 MQPD-ACCEPT-UNSUP-IF-XMIT-MASK PIC S9(9) BINARY.
       10 MQPD-ACCEPT-UNSUP-MASK PIC S9(9) BINARY.
       10 MQPD-NO-CONTEXT PIC S9(9) BINARY.
       10 MQPD-USER-CONTEXT PIC S9(9) BINARY.
       10 MQCOPY-NONE PIC S9(9) BINARY.
       10 MQCOPY-ALL PIC S9(9) BINARY.
       10 MQCOPY-FORWARD PIC S9(9) BINARY.
       10 MQCOPY-PUBLISH PIC S9(9) BINARY.
       10 MQCOPY-REPLY PIC S9(9) BINARY.
       10 MQCOPY-REPORT PIC S9(9) BINARY.
       10 MQCOPY-DEFAULT PIC S9(9) BINARY.
       10 MQPMO-STRUC-ID PIC X(4).
       10 MQPMO-VERSION-1 PIC S9(9) BINARY.
       10 MQPMO-VERSION-2 PIC S9(9) BINARY.
       10 MQPMO-VERSION-3 PIC S9(9) BINARY.
       10 MQPMO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQPMO-LENGTH-1 PIC S9(9) BINARY.
       10 MQPMO-LENGTH-2 PIC S9(9) BINARY.
       10 MQPMO-LENGTH-3 PIC S9(9) BINARY.
       10 MQPMO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQPMO-SYNCPOINT PIC S9(9) BINARY.
       10 MQPMO-NO-SYNCPOINT PIC S9(9) BINARY.
       10 MQPMO-DEFAULT-CONTEXT PIC S9(9) BINARY.
       10 MQPMO-NEW-MSG-ID PIC S9(9) BINARY.
       10 MQPMO-NEW-CORREL-ID PIC S9(9) BINARY.
       10 MQPMO-PASS-IDENTITY-CONTEXT PIC S9(9) BINARY.
       10 MQPMO-PASS-ALL-CONTEXT PIC S9(9) BINARY.
       10 MQPMO-SET-IDENTITY-CONTEXT PIC S9(9) BINARY.
       10 MQPMO-SET-ALL-CONTEXT PIC S9(9) BINARY.
       10 MQPMO-ALTERNATE-USER-AUTHORITY PIC S9(9) BINARY.
       10 MQPMO-FAIL-IF-QUIESCING PIC S9(9) BINARY.
       10 MQPMO-NO-CONTEXT PIC S9(9) BINARY.
       10 MQPMO-LOGICAL-ORDER PIC S9(9) BINARY.
       10 MQPMO-ASYNC-RESPONSE PIC S9(9) BINARY.
       10 MQPMO-SYNC-RESPONSE PIC S9(9) BINARY.
       10 MQPMO-RESOLVE-LOCAL-Q PIC S9(9) BINARY.
       10 MQPMO-WARN-IF-NO-SUBS-MATCHED PIC S9(9) BINARY.
       10 MQPMO-RETAIN PIC S9(9) BINARY.
       10 MQPMO-MD-FOR-OUTPUT-ONLY PIC S9(9) BINARY.
       10 MQPMO-SCOPE-QMGR PIC S9(9) BINARY.
       10 MQPMO-SUPPRESS-REPLYTO PIC S9(9) BINARY.
       10 MQPMO-NOT-OWN-SUBS PIC S9(9) BINARY.
       10 MQPMO-RESPONSE-AS-Q-DEF PIC S9(9) BINARY.
       10 MQPMO-RESPONSE-AS-TOPIC-DEF PIC S9(9) BINARY.
       10 MQPMO-NONE PIC S9(9) BINARY.
       10 MQPMO-PUB-OPTIONS-MASK PIC S9(9) BINARY.
       10 MQPMRF-MSG-ID PIC S9(9) BINARY.
       10 MQPMRF-CORREL-ID PIC S9(9) BINARY.
       10 MQPMRF-GROUP-ID PIC S9(9) BINARY.
       10 MQPMRF-FEEDBACK PIC S9(9) BINARY.
       10 MQPMRF-ACCOUNTING-TOKEN PIC S9(9) BINARY.
       10 MQPMRF-NONE PIC S9(9) BINARY.
       10 MQACTP-NEW PIC S9(9) BINARY.
       10 MQACTP-FORWARD PIC S9(9) BINARY.
       10 MQACTP-REPLY PIC S9(9) BINARY.
       10 MQACTP-REPORT PIC S9(9) BINARY.
       10 MQRFH-STRUC-ID PIC X(4).
       10 MQRFH-VERSION-1 PIC S9(9) BINARY.
       10 MQRFH-VERSION-2 PIC S9(9) BINARY.
       10 MQRFH-STRUC-LENGTH-FIXED PIC S9(9) BINARY.
       10 MQRFH-STRUC-LENGTH-FIXED-2 PIC S9(9) BINARY.
       10 MQRFH-LENGTH-1 PIC S9(9) BINARY.
       10 MQRFH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQRFH-NONE PIC S9(9) BINARY.
       10 MQRFH-NO-FLAGS PIC S9(9) BINARY.
       10 MQRFH-FLAGS-RESTRICTED-MASK PIC S9(9) BINARY.
       10 MQNVS-APPL-TYPE PIC X(12).
       10 MQNVS-MSG-TYPE PIC X(13).
       10 MQRFH2-LENGTH-2 PIC S9(9) BINARY.
       10 MQRFH2-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQRMH-STRUC-ID PIC X(4).
       10 MQRMH-VERSION-1 PIC S9(9) BINARY.
       10 MQRMH-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQRMH-LENGTH-1 PIC S9(9) BINARY.
       10 MQRMH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQRMHF-LAST PIC S9(9) BINARY.
       10 MQRMHF-NOT-LAST PIC S9(9) BINARY.
       10 MQOII-NONE PIC X(24).
       10 MQSD-STRUC-ID PIC X(4).
       10 MQSD-VERSION-1 PIC S9(9) BINARY.
       10 MQSD-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQSD-LENGTH-1 PIC S9(9) BINARY.
       10 MQSD-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQSID-NONE PIC X(40).
       10 MQSIDT-NONE PIC X.
       10 MQSIDT-NT-SECURITY-ID PIC X.
       10 MQSIDT-WAS-SECURITY-ID PIC X.
       10 MQSMPO-STRUC-ID PIC X(4).
       10 MQSMPO-VERSION-1 PIC S9(9) BINARY.
       10 MQSMPO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQSMPO-LENGTH-1 PIC S9(9) BINARY.
       10 MQSMPO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQSMPO-SET-FIRST PIC S9(9) BINARY.
       10 MQSMPO-SET-PROP-UNDER-CURSOR PIC S9(9) BINARY.
       10 MQSMPO-SET-PROP-AFTER-CURSOR PIC S9(9) BINARY.
       10 MQSMPO-APPEND-PROPERTY PIC S9(9) BINARY.
       10 MQSMPO-SET-PROP-BEFORE-CURSOR PIC S9(9) BINARY.
       10 MQSMPO-NONE PIC S9(9) BINARY.
       10 MQSRO-STRUC-ID PIC X(4).
       10 MQSRO-VERSION-1 PIC S9(9) BINARY.
       10 MQSRO-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQSRO-LENGTH-1 PIC S9(9) BINARY.
       10 MQSRO-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQSRO-NONE PIC S9(9) BINARY.
       10 MQSRO-FAIL-IF-QUIESCING PIC S9(9) BINARY.
       10 MQSTS-STRUC-ID PIC X(4).
       10 MQSTS-VERSION-1 PIC S9(9) BINARY.
       10 MQSTS-VERSION-2 PIC S9(9) BINARY.
       10 MQSTS-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQSTS-LENGTH-1 PIC S9(9) BINARY.
       10 MQSTS-LENGTH-2 PIC S9(9) BINARY.
       10 MQSTS-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQTM-STRUC-ID PIC X(4).
       10 MQTM-VERSION-1 PIC S9(9) BINARY.
       10 MQTM-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQTM-LENGTH-1 PIC S9(9) BINARY.
       10 MQTM-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQTMC-STRUC-ID PIC X(4).
       10 MQTMC2-LENGTH-1 PIC S9(9) BINARY.
       10 MQTMC2-LENGTH-2 PIC S9(9) BINARY.
       10 MQTMC2-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQTMC-VERSION-1 PIC X(4).
       10 MQTMC-VERSION-2 PIC X(4).
       10 MQTMC-CURRENT-VERSION PIC X(4).
       10 MQWIH-STRUC-ID PIC X(4).
       10 MQWIH-VERSION-1 PIC S9(9) BINARY.
       10 MQWIH-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQWIH-LENGTH-1 PIC S9(9) BINARY.
       10 MQWIH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQWIH-NONE PIC S9(9) BINARY.
       10 MQXQH-STRUC-ID PIC X(4).
       10 MQXQH-VERSION-1 PIC S9(9) BINARY.
       10 MQXQH-CURRENT-VERSION PIC S9(9) BINARY.
       10 MQXQH-LENGTH-1 PIC S9(9) BINARY.
       10 MQXQH-CURRENT-LENGTH PIC S9(9) BINARY.
       10 MQHC-DEF-HCONN PIC S9(9) BINARY.
       10 MQHC-UNUSABLE-HCONN PIC S9(9) BINARY.
       10 MQHC-UNASSOCIATED-HCONN PIC S9(9) BINARY.
       10 MQ-OPERATOR-MESSAGE-LENGTH PIC S9(9) BINARY.
       10 MQ-ABEND-CODE-LENGTH PIC S9(9) BINARY.
       10 MQ-ACCOUNTING-TOKEN-LENGTH PIC S9(9) BINARY.
       10 MQ-APPL-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-APPL-IDENTITY-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-APPL-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-APPL-ORIGIN-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-APPL-TAG-LENGTH PIC S9(9) BINARY.
       10 MQ-ARM-SUFFIX-LENGTH PIC S9(9) BINARY.
       10 MQ-ATTENTION-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-AUTH-INFO-CONN-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-AUTH-INFO-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-AUTH-INFO-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-AUTH-INFO-OCSP-URL-LENGTH PIC S9(9) BINARY.
       10 MQ-AUTHENTICATOR-LENGTH PIC S9(9) BINARY.
       10 MQ-AUTO-REORG-CATALOG-LENGTH PIC S9(9) BINARY.
       10 MQ-AUTO-REORG-TIME-LENGTH PIC S9(9) BINARY.
       10 MQ-BATCH-INTERFACE-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-BRIDGE-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-CANCEL-CODE-LENGTH PIC S9(9) BINARY.
       10 MQ-CF-STRUC-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-CF-STRUC-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-CHANNEL-DATE-LENGTH PIC S9(9) BINARY.
       10 MQ-CHANNEL-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-CHANNEL-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-CHANNEL-TIME-LENGTH PIC S9(9) BINARY.
       10 MQ-CHINIT-SERVICE-PARM-LENGTH PIC S9(9) BINARY.
       10 MQ-CICS-FILE-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-AMQP-CLIENT-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-CLIENT-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-CLIENT-USER-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-CLUSTER-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-COMM-INFO-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-COMM-INFO-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-CONN-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-CONN-TAG-LENGTH PIC S9(9) BINARY.
       10 MQ-CONNECTION-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-CORREL-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-CREATION-DATE-LENGTH PIC S9(9) BINARY.
       10 MQ-CREATION-TIME-LENGTH PIC S9(9) BINARY.
       10 MQ-CSP-PASSWORD-LENGTH PIC S9(9) BINARY.
       10 MQ-CSP-TOKEN-LENGTH PIC S9(9) BINARY.
       10 MQ-DATE-LENGTH PIC S9(9) BINARY.
       10 MQ-DISTINGUISHED-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-DNS-GROUP-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-EXIT-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-EXIT-INFO-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-EXIT-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-EXIT-PD-AREA-LENGTH PIC S9(9) BINARY.
       10 MQ-EXIT-USER-AREA-LENGTH PIC S9(9) BINARY.
       10 MQ-FACILITY-LENGTH PIC S9(9) BINARY.
       10 MQ-FACILITY-LIKE-LENGTH PIC S9(9) BINARY.
       10 MQ-FORMAT-LENGTH PIC S9(9) BINARY.
       10 MQ-FUNCTION-LENGTH PIC S9(9) BINARY.
       10 MQ-GROUP-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-APPL-FUNCTION-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-INITIAL-KEY-LENGTH PIC S9(9) BINARY.
       10 MQ-INSTALLATION-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-INSTALLATION-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-INSTALLATION-PATH-LENGTH PIC S9(9) BINARY.
       10 MQ-JAAS-CONFIG-LENGTH PIC S9(9) BINARY.
       10 MQ-LDAP-PASSWORD-LENGTH PIC S9(9) BINARY.
       10 MQ-LDAP-BASE-DN-LENGTH PIC S9(9) BINARY.
       10 MQ-LDAP-FIELD-LENGTH PIC S9(9) BINARY.
       10 MQ-LDAP-CLASS-LENGTH PIC S9(9) BINARY.
       10 MQ-LISTENER-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-LISTENER-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-LOCAL-ADDRESS-LENGTH PIC S9(9) BINARY.
       10 MQ-LTERM-OVERRIDE-LENGTH PIC S9(9) BINARY.
       10 MQ-LU-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-LUWID-LENGTH PIC S9(9) BINARY.
       10 MQ-MAX-EXIT-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-MAX-MCA-USER-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-MAX-LDAP-MCA-USER-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-MAX-PROPERTY-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-MAX-USER-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-MCA-JOB-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-MCA-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-MCA-USER-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-MCA-USER-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-LDAP-MCA-USER-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-MFS-MAP-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-MODE-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-MSG-HEADER-LENGTH PIC S9(9) BINARY.
       10 MQ-MSG-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-MSG-TOKEN-LENGTH PIC S9(9) BINARY.
       10 MQ-NAMELIST-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-NAMELIST-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-NHA-INSTANCE-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-OBJECT-INSTANCE-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-OBJECT-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-PASS-TICKET-APPL-LENGTH PIC S9(9) BINARY.
       10 MQ-PASSWORD-LENGTH PIC S9(9) BINARY.
       10 MQ-PROCESS-APPL-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-PROCESS-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-PROCESS-ENV-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-PROCESS-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-PROCESS-USER-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-PROGRAM-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-PUT-APPL-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-PUT-DATE-LENGTH PIC S9(9) BINARY.
       10 MQ-PUT-TIME-LENGTH PIC S9(9) BINARY.
       10 MQ-Q-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-Q-MGR-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-Q-MGR-IDENTIFIER-LENGTH PIC S9(9) BINARY.
       10 MQ-Q-MGR-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-Q-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-QSG-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-REMOTE-SYS-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-SECURITY-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-SELECTOR-LENGTH PIC S9(9) BINARY.
       10 MQ-SERVICE-ARGS-LENGTH PIC S9(9) BINARY.
       10 MQ-SERVICE-COMMAND-LENGTH PIC S9(9) BINARY.
       10 MQ-SERVICE-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-SERVICE-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-SERVICE-PATH-LENGTH PIC S9(9) BINARY.
       10 MQ-SERVICE-STEP-LENGTH PIC S9(9) BINARY.
       10 MQ-SHORT-CONN-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-SHORT-DNAME-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-CIPHER-SPEC-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-CIPHER-SUITE-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-CRYPTO-HARDWARE-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-ENCRYP-KEY-REPO-PWD-LEN PIC S9(9) BINARY.
       10 MQ-SSL-HANDSHAKE-STAGE-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-KEY-LIBRARY-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-KEY-MEMBER-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-KEY-REPOSITORY-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-KEY-REPO-PWD-LEN PIC S9(9) BINARY.
       10 MQ-SSL-PEER-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-SSL-SHORT-PEER-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-START-CODE-LENGTH PIC S9(9) BINARY.
       10 MQ-STORAGE-CLASS-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-STORAGE-CLASS-LENGTH PIC S9(9) BINARY.
       10 MQ-SUB-IDENTITY-LENGTH PIC S9(9) BINARY.
       10 MQ-SUB-POINT-LENGTH PIC S9(9) BINARY.
       10 MQ-TCP-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-TEMPORARY-Q-PREFIX-LENGTH PIC S9(9) BINARY.
       10 MQ-TIME-LENGTH PIC S9(9) BINARY.
       10 MQ-TOPIC-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-TOPIC-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-TOPIC-STR-LENGTH PIC S9(9) BINARY.
       10 MQ-TOTAL-EXIT-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-TOTAL-EXIT-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-TP-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-TPIPE-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-TRAN-INSTANCE-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-TRANSACTION-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-TRIGGER-DATA-LENGTH PIC S9(9) BINARY.
       10 MQ-TRIGGER-PROGRAM-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-TRIGGER-TERM-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-TRIGGER-TRANS-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-USER-ID-LENGTH PIC S9(9) BINARY.
       10 MQ-VERSION-LENGTH PIC S9(9) BINARY.
       10 MQ-XCF-GROUP-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-XCF-MEMBER-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-SMDS-NAME-LENGTH PIC S9(9) BINARY.
       10 MQ-CHLAUTH-DESC-LENGTH PIC S9(9) BINARY.
       10 MQ-CUSTOM-LENGTH PIC S9(9) BINARY.
       10 MQ-SUITE-B-SIZE PIC S9(9) BINARY.
       10 MQ-CERT-LABEL-LENGTH PIC S9(9) BINARY.
       10 MQCC-OK PIC S9(9) BINARY.
       10 MQCC-WARNING PIC S9(9) BINARY.
       10 MQCC-FAILED PIC S9(9) BINARY.
       10 MQCC-UNKNOWN PIC S9(9) BINARY.
       10 MQRC-NONE PIC S9(9) BINARY.
       10 MQRC-APPL-FIRST PIC S9(9) BINARY.
       10 MQRC-APPL-LAST PIC S9(9) BINARY.
       10 MQRC-ALIAS-BASE-Q-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-ALREADY-CONNECTED PIC S9(9) BINARY.
       10 MQRC-BACKED-OUT PIC S9(9) BINARY.
       10 MQRC-BUFFER-ERROR PIC S9(9) BINARY.
       10 MQRC-BUFFER-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-CHAR-ATTR-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-CHAR-ATTRS-ERROR PIC S9(9) BINARY.
       10 MQRC-CHAR-ATTRS-TOO-SHORT PIC S9(9) BINARY.
       10 MQRC-CONNECTION-BROKEN PIC S9(9) BINARY.
       10 MQRC-DATA-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-DYNAMIC-Q-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-ENVIRONMENT-ERROR PIC S9(9) BINARY.
       10 MQRC-EXPIRY-ERROR PIC S9(9) BINARY.
       10 MQRC-FEEDBACK-ERROR PIC S9(9) BINARY.
       10 MQRC-GET-INHIBITED PIC S9(9) BINARY.
       10 MQRC-HANDLE-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-HCONN-ERROR PIC S9(9) BINARY.
       10 MQRC-HOBJ-ERROR PIC S9(9) BINARY.
       10 MQRC-INHIBIT-VALUE-ERROR PIC S9(9) BINARY.
       10 MQRC-INT-ATTR-COUNT-ERROR PIC S9(9) BINARY.
       10 MQRC-INT-ATTR-COUNT-TOO-SMALL PIC S9(9) BINARY.
       10 MQRC-INT-ATTRS-ARRAY-ERROR PIC S9(9) BINARY.
       10 MQRC-SYNCPOINT-LIMIT-REACHED PIC S9(9) BINARY.
       10 MQRC-MAX-CONNS-LIMIT-REACHED PIC S9(9) BINARY.
       10 MQRC-MD-ERROR PIC S9(9) BINARY.
       10 MQRC-MISSING-REPLY-TO-Q PIC S9(9) BINARY.
       10 MQRC-MSG-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-MSG-TOO-BIG-FOR-Q PIC S9(9) BINARY.
       10 MQRC-MSG-TOO-BIG-FOR-Q-MGR PIC S9(9) BINARY.
       10 MQRC-NO-MSG-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-NO-MSG-UNDER-CURSOR PIC S9(9) BINARY.
       10 MQRC-NOT-AUTHORIZED PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-BROWSE PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-INPUT PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-INQUIRE PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-OUTPUT PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-SET PIC S9(9) BINARY.
       10 MQRC-OBJECT-CHANGED PIC S9(9) BINARY.
       10 MQRC-OBJECT-IN-USE PIC S9(9) BINARY.
       10 MQRC-OBJECT-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-OD-ERROR PIC S9(9) BINARY.
       10 MQRC-OPTION-NOT-VALID-FOR-TYPE PIC S9(9) BINARY.
       10 MQRC-OPTIONS-ERROR PIC S9(9) BINARY.
       10 MQRC-PERSISTENCE-ERROR PIC S9(9) BINARY.
       10 MQRC-PERSISTENT-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-PRIORITY-EXCEEDS-MAXIMUM PIC S9(9) BINARY.
       10 MQRC-PRIORITY-ERROR PIC S9(9) BINARY.
       10 MQRC-PUT-INHIBITED PIC S9(9) BINARY.
       10 MQRC-Q-DELETED PIC S9(9) BINARY.
       10 MQRC-Q-FULL PIC S9(9) BINARY.
       10 MQRC-Q-NOT-EMPTY PIC S9(9) BINARY.
       10 MQRC-Q-SPACE-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-Q-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-Q-MGR-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-Q-MGR-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-REPORT-OPTIONS-ERROR PIC S9(9) BINARY.
       10 MQRC-SECOND-MARK-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-SECURITY-ERROR PIC S9(9) BINARY.
       10 MQRC-TOKEN-TIMESTAMP-NOT-VALID PIC S9(9) BINARY.
       10 MQRC-SELECTOR-COUNT-ERROR PIC S9(9) BINARY.
       10 MQRC-SELECTOR-LIMIT-EXCEEDED PIC S9(9) BINARY.
       10 MQRC-SELECTOR-ERROR PIC S9(9) BINARY.
       10 MQRC-SELECTOR-NOT-FOR-TYPE PIC S9(9) BINARY.
       10 MQRC-SIGNAL-OUTSTANDING PIC S9(9) BINARY.
       10 MQRC-SIGNAL-REQUEST-ACCEPTED PIC S9(9) BINARY.
       10 MQRC-STORAGE-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-SYNCPOINT-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-TRIGGER-CONTROL-ERROR PIC S9(9) BINARY.
       10 MQRC-TRIGGER-DEPTH-ERROR PIC S9(9) BINARY.
       10 MQRC-TRIGGER-MSG-PRIORITY-ERR PIC S9(9) BINARY.
       10 MQRC-TRIGGER-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-TRUNCATED-MSG-ACCEPTED PIC S9(9) BINARY.
       10 MQRC-TRUNCATED-MSG-FAILED PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-ALIAS-BASE-Q PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-OBJECT-NAME PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-OBJECT-Q-MGR PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-REMOTE-Q-MGR PIC S9(9) BINARY.
       10 MQRC-WAIT-INTERVAL-ERROR PIC S9(9) BINARY.
       10 MQRC-XMIT-Q-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-XMIT-Q-USAGE-ERROR PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-PASS-ALL PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-PASS-IDENT PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-SET-ALL PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN-FOR-SET-IDENT PIC S9(9) BINARY.
       10 MQRC-CONTEXT-HANDLE-ERROR PIC S9(9) BINARY.
       10 MQRC-CONTEXT-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-SIGNAL1-ERROR PIC S9(9) BINARY.
       10 MQRC-OBJECT-ALREADY-EXISTS PIC S9(9) BINARY.
       10 MQRC-OBJECT-DAMAGED PIC S9(9) BINARY.
       10 MQRC-RESOURCE-PROBLEM PIC S9(9) BINARY.
       10 MQRC-ANOTHER-Q-MGR-CONNECTED PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-REPORT-OPTION PIC S9(9) BINARY.
       10 MQRC-STORAGE-CLASS-ERROR PIC S9(9) BINARY.
       10 MQRC-COD-NOT-VALID-FOR-XCF-Q PIC S9(9) BINARY.
       10 MQRC-XWAIT-CANCELED PIC S9(9) BINARY.
       10 MQRC-XWAIT-ERROR PIC S9(9) BINARY.
       10 MQRC-SUPPRESSED-BY-EXIT PIC S9(9) BINARY.
       10 MQRC-FORMAT-ERROR PIC S9(9) BINARY.
       10 MQRC-SOURCE-CCSID-ERROR PIC S9(9) BINARY.
       10 MQRC-SOURCE-INTEGER-ENC-ERROR PIC S9(9) BINARY.
       10 MQRC-SOURCE-DECIMAL-ENC-ERROR PIC S9(9) BINARY.
       10 MQRC-SOURCE-FLOAT-ENC-ERROR PIC S9(9) BINARY.
       10 MQRC-TARGET-CCSID-ERROR PIC S9(9) BINARY.
       10 MQRC-TARGET-INTEGER-ENC-ERROR PIC S9(9) BINARY.
       10 MQRC-TARGET-DECIMAL-ENC-ERROR PIC S9(9) BINARY.
       10 MQRC-TARGET-FLOAT-ENC-ERROR PIC S9(9) BINARY.
       10 MQRC-NOT-CONVERTED PIC S9(9) BINARY.
       10 MQRC-CONVERTED-MSG-TOO-BIG PIC S9(9) BINARY.
       10 MQRC-TRUNCATED PIC S9(9) BINARY.
       10 MQRC-NO-EXTERNAL-PARTICIPANTS PIC S9(9) BINARY.
       10 MQRC-PARTICIPANT-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-OUTCOME-MIXED PIC S9(9) BINARY.
       10 MQRC-OUTCOME-PENDING PIC S9(9) BINARY.
       10 MQRC-BRIDGE-STARTED PIC S9(9) BINARY.
       10 MQRC-BRIDGE-STOPPED PIC S9(9) BINARY.
       10 MQRC-ADAPTER-STORAGE-SHORTAGE PIC S9(9) BINARY.
       10 MQRC-UOW-IN-PROGRESS PIC S9(9) BINARY.
       10 MQRC-ADAPTER-CONN-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-ADAPTER-SERV-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-ADAPTER-DEFS-ERROR PIC S9(9) BINARY.
       10 MQRC-ADAPTER-DEFS-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-ADAPTER-CONV-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-BO-ERROR PIC S9(9) BINARY.
       10 MQRC-DH-ERROR PIC S9(9) BINARY.
       10 MQRC-MULTIPLE-REASONS PIC S9(9) BINARY.
       10 MQRC-OPEN-FAILED PIC S9(9) BINARY.
       10 MQRC-ADAPTER-DISC-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-CNO-ERROR PIC S9(9) BINARY.
       10 MQRC-CICS-WAIT-FAILED PIC S9(9) BINARY.
       10 MQRC-DLH-ERROR PIC S9(9) BINARY.
       10 MQRC-HEADER-ERROR PIC S9(9) BINARY.
       10 MQRC-SOURCE-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-TARGET-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-SOURCE-BUFFER-ERROR PIC S9(9) BINARY.
       10 MQRC-TARGET-BUFFER-ERROR PIC S9(9) BINARY.
       10 MQRC-INCOMPLETE-TRANSACTION PIC S9(9) BINARY.
       10 MQRC-IIH-ERROR PIC S9(9) BINARY.
       10 MQRC-PCF-ERROR PIC S9(9) BINARY.
       10 MQRC-DBCS-ERROR PIC S9(9) BINARY.
       10 MQRC-OBJECT-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-OBJECT-Q-MGR-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-RECS-PRESENT-ERROR PIC S9(9) BINARY.
       10 MQRC-OBJECT-RECORDS-ERROR PIC S9(9) BINARY.
       10 MQRC-RESPONSE-RECORDS-ERROR PIC S9(9) BINARY.
       10 MQRC-ASID-MISMATCH PIC S9(9) BINARY.
       10 MQRC-PMO-RECORD-FLAGS-ERROR PIC S9(9) BINARY.
       10 MQRC-PUT-MSG-RECORDS-ERROR PIC S9(9) BINARY.
       10 MQRC-CONN-ID-IN-USE PIC S9(9) BINARY.
       10 MQRC-Q-MGR-QUIESCING PIC S9(9) BINARY.
       10 MQRC-Q-MGR-STOPPING PIC S9(9) BINARY.
       10 MQRC-DUPLICATE-RECOV-COORD PIC S9(9) BINARY.
       10 MQRC-PMO-ERROR PIC S9(9) BINARY.
       10 MQRC-API-EXIT-NOT-FOUND PIC S9(9) BINARY.
       10 MQRC-API-EXIT-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-REMOTE-Q-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-PERSISTENCE PIC S9(9) BINARY.
       10 MQRC-GMO-ERROR PIC S9(9) BINARY.
       10 MQRC-CICS-BRIDGE-RESTRICTION PIC S9(9) BINARY.
       10 MQRC-STOPPED-BY-CLUSTER-EXIT PIC S9(9) BINARY.
       10 MQRC-CLUSTER-RESOLUTION-ERROR PIC S9(9) BINARY.
       10 MQRC-CONVERTED-STRING-TOO-BIG PIC S9(9) BINARY.
       10 MQRC-TMC-ERROR PIC S9(9) BINARY.
       10 MQRC-STORAGE-MEDIUM-FULL PIC S9(9) BINARY.
       10 MQRC-PAGESET-FULL PIC S9(9) BINARY.
       10 MQRC-PAGESET-ERROR PIC S9(9) BINARY.
       10 MQRC-NAME-NOT-VALID-FOR-TYPE PIC S9(9) BINARY.
       10 MQRC-UNEXPECTED-ERROR PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-XMIT-Q PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-DEF-XMIT-Q PIC S9(9) BINARY.
       10 MQRC-DEF-XMIT-Q-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-DEF-XMIT-Q-USAGE-ERROR PIC S9(9) BINARY.
       10 MQRC-MSG-MARKED-BROWSE-CO-OP PIC S9(9) BINARY.
       10 MQRC-NAME-IN-USE PIC S9(9) BINARY.
       10 MQRC-CONNECTION-QUIESCING PIC S9(9) BINARY.
       10 MQRC-CONNECTION-STOPPING PIC S9(9) BINARY.
       10 MQRC-ADAPTER-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-MSG-ID-ERROR PIC S9(9) BINARY.
       10 MQRC-CORREL-ID-ERROR PIC S9(9) BINARY.
       10 MQRC-FILE-SYSTEM-ERROR PIC S9(9) BINARY.
       10 MQRC-NO-MSG-LOCKED PIC S9(9) BINARY.
       10 MQRC-SOAP-DOTNET-ERROR PIC S9(9) BINARY.
       10 MQRC-SOAP-AXIS-ERROR PIC S9(9) BINARY.
       10 MQRC-SOAP-URL-ERROR PIC S9(9) BINARY.
       10 MQRC-FILE-NOT-AUDITED PIC S9(9) BINARY.
       10 MQRC-CONNECTION-NOT-AUTHORIZED PIC S9(9) BINARY.
       10 MQRC-MSG-TOO-BIG-FOR-CHANNEL PIC S9(9) BINARY.
       10 MQRC-CALL-IN-PROGRESS PIC S9(9) BINARY.
       10 MQRC-RMH-ERROR PIC S9(9) BINARY.
       10 MQRC-Q-MGR-ACTIVE PIC S9(9) BINARY.
       10 MQRC-Q-MGR-NOT-ACTIVE PIC S9(9) BINARY.
       10 MQRC-Q-DEPTH-HIGH PIC S9(9) BINARY.
       10 MQRC-Q-DEPTH-LOW PIC S9(9) BINARY.
       10 MQRC-Q-SERVICE-INTERVAL-HIGH PIC S9(9) BINARY.
       10 MQRC-Q-SERVICE-INTERVAL-OK PIC S9(9) BINARY.
       10 MQRC-RFH-HEADER-FIELD-ERROR PIC S9(9) BINARY.
       10 MQRC-RAS-PROPERTY-ERROR PIC S9(9) BINARY.
       10 MQRC-UNIT-OF-WORK-NOT-STARTED PIC S9(9) BINARY.
       10 MQRC-CHANNEL-AUTO-DEF-OK PIC S9(9) BINARY.
       10 MQRC-CHANNEL-AUTO-DEF-ERROR PIC S9(9) BINARY.
       10 MQRC-CFH-ERROR PIC S9(9) BINARY.
       10 MQRC-CFIL-ERROR PIC S9(9) BINARY.
       10 MQRC-CFIN-ERROR PIC S9(9) BINARY.
       10 MQRC-CFSL-ERROR PIC S9(9) BINARY.
       10 MQRC-CFST-ERROR PIC S9(9) BINARY.
       10 MQRC-INCOMPLETE-GROUP PIC S9(9) BINARY.
       10 MQRC-INCOMPLETE-MSG PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-CCSIDS PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-ENCODINGS PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-UOW PIC S9(9) BINARY.
       10 MQRC-INVALID-MSG-UNDER-CURSOR PIC S9(9) BINARY.
       10 MQRC-MATCH-OPTIONS-ERROR PIC S9(9) BINARY.
       10 MQRC-MDE-ERROR PIC S9(9) BINARY.
       10 MQRC-MSG-FLAGS-ERROR PIC S9(9) BINARY.
       10 MQRC-MSG-SEQ-NUMBER-ERROR PIC S9(9) BINARY.
       10 MQRC-OFFSET-ERROR PIC S9(9) BINARY.
       10 MQRC-ORIGINAL-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-SEGMENT-LENGTH-ZERO PIC S9(9) BINARY.
       10 MQRC-UOW-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-WRONG-GMO-VERSION PIC S9(9) BINARY.
       10 MQRC-WRONG-MD-VERSION PIC S9(9) BINARY.
       10 MQRC-GROUP-ID-ERROR PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-BROWSE PIC S9(9) BINARY.
       10 MQRC-XQH-ERROR PIC S9(9) BINARY.
       10 MQRC-SRC-ENV-ERROR PIC S9(9) BINARY.
       10 MQRC-SRC-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-DEST-ENV-ERROR PIC S9(9) BINARY.
       10 MQRC-DEST-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-TM-ERROR PIC S9(9) BINARY.
       10 MQRC-CLUSTER-EXIT-ERROR PIC S9(9) BINARY.
       10 MQRC-CLUSTER-EXIT-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-CLUSTER-PUT-INHIBITED PIC S9(9) BINARY.
       10 MQRC-CLUSTER-RESOURCE-ERROR PIC S9(9) BINARY.
       10 MQRC-NO-DESTINATIONS-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-CONN-TAG-IN-USE PIC S9(9) BINARY.
       10 MQRC-PARTIALLY-CONVERTED PIC S9(9) BINARY.
       10 MQRC-CONNECTION-ERROR PIC S9(9) BINARY.
       10 MQRC-OPTION-ENVIRONMENT-ERROR PIC S9(9) BINARY.
       10 MQRC-CD-ERROR PIC S9(9) BINARY.
       10 MQRC-CLIENT-CONN-ERROR PIC S9(9) BINARY.
       10 MQRC-CHANNEL-STOPPED-BY-USER PIC S9(9) BINARY.
       10 MQRC-HCONFIG-ERROR PIC S9(9) BINARY.
       10 MQRC-FUNCTION-ERROR PIC S9(9) BINARY.
       10 MQRC-CHANNEL-STARTED PIC S9(9) BINARY.
       10 MQRC-CHANNEL-STOPPED PIC S9(9) BINARY.
       10 MQRC-CHANNEL-CONV-ERROR PIC S9(9) BINARY.
       10 MQRC-SERVICE-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-INITIALIZATION-FAILED PIC S9(9) BINARY.
       10 MQRC-TERMINATION-FAILED PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-Q-NAME PIC S9(9) BINARY.
       10 MQRC-SERVICE-ERROR PIC S9(9) BINARY.
       10 MQRC-Q-ALREADY-EXISTS PIC S9(9) BINARY.
       10 MQRC-USER-ID-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-ENTITY PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-AUTH-ENTITY PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-REF-OBJECT PIC S9(9) BINARY.
       10 MQRC-CHANNEL-ACTIVATED PIC S9(9) BINARY.
       10 MQRC-CHANNEL-NOT-ACTIVATED PIC S9(9) BINARY.
       10 MQRC-UOW-CANCELED PIC S9(9) BINARY.
       10 MQRC-FUNCTION-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-SELECTOR-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-COMMAND-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-MULTIPLE-INSTANCE-ERROR PIC S9(9) BINARY.
       10 MQRC-SYSTEM-ITEM-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-BAG-CONVERSION-ERROR PIC S9(9) BINARY.
       10 MQRC-SELECTOR-OUT-OF-RANGE PIC S9(9) BINARY.
       10 MQRC-SELECTOR-NOT-UNIQUE PIC S9(9) BINARY.
       10 MQRC-INDEX-NOT-PRESENT PIC S9(9) BINARY.
       10 MQRC-STRING-ERROR PIC S9(9) BINARY.
       10 MQRC-ENCODING-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-SELECTOR-NOT-PRESENT PIC S9(9) BINARY.
       10 MQRC-OUT-SELECTOR-ERROR PIC S9(9) BINARY.
       10 MQRC-STRING-TRUNCATED PIC S9(9) BINARY.
       10 MQRC-SELECTOR-WRONG-TYPE PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-ITEM-TYPE PIC S9(9) BINARY.
       10 MQRC-INDEX-ERROR PIC S9(9) BINARY.
       10 MQRC-SYSTEM-BAG-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-ITEM-COUNT-ERROR PIC S9(9) BINARY.
       10 MQRC-FORMAT-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-SELECTOR-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-ITEM-VALUE-ERROR PIC S9(9) BINARY.
       10 MQRC-HBAG-ERROR PIC S9(9) BINARY.
       10 MQRC-PARAMETER-MISSING PIC S9(9) BINARY.
       10 MQRC-CMD-SERVER-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-STRING-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-INQUIRY-COMMAND-ERROR PIC S9(9) BINARY.
       10 MQRC-NESTED-BAG-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-BAG-WRONG-TYPE PIC S9(9) BINARY.
       10 MQRC-ITEM-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-SYSTEM-BAG-NOT-DELETABLE PIC S9(9) BINARY.
       10 MQRC-SYSTEM-ITEM-NOT-DELETABLE PIC S9(9) BINARY.
       10 MQRC-CODED-CHAR-SET-ID-ERROR PIC S9(9) BINARY.
       10 MQRC-MSG-TOKEN-ERROR PIC S9(9) BINARY.
       10 MQRC-MISSING-WIH PIC S9(9) BINARY.
       10 MQRC-WIH-ERROR PIC S9(9) BINARY.
       10 MQRC-RFH-ERROR PIC S9(9) BINARY.
       10 MQRC-RFH-STRING-ERROR PIC S9(9) BINARY.
       10 MQRC-RFH-COMMAND-ERROR PIC S9(9) BINARY.
       10 MQRC-RFH-PARM-ERROR PIC S9(9) BINARY.
       10 MQRC-RFH-DUPLICATE-PARM PIC S9(9) BINARY.
       10 MQRC-RFH-PARM-MISSING PIC S9(9) BINARY.
       10 MQRC-CHAR-CONVERSION-ERROR PIC S9(9) BINARY.
       10 MQRC-UCS2-CONVERSION-ERROR PIC S9(9) BINARY.
       10 MQRC-DB2-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-OBJECT-NOT-UNIQUE PIC S9(9) BINARY.
       10 MQRC-CONN-TAG-NOT-RELEASED PIC S9(9) BINARY.
       10 MQRC-CF-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-CF-STRUC-IN-USE PIC S9(9) BINARY.
       10 MQRC-CF-STRUC-LIST-HDR-IN-USE PIC S9(9) BINARY.
       10 MQRC-CF-STRUC-AUTH-FAILED PIC S9(9) BINARY.
       10 MQRC-CF-STRUC-ERROR PIC S9(9) BINARY.
       10 MQRC-CONN-TAG-NOT-USABLE PIC S9(9) BINARY.
       10 MQRC-GLOBAL-UOW-CONFLICT PIC S9(9) BINARY.
       10 MQRC-LOCAL-UOW-CONFLICT PIC S9(9) BINARY.
       10 MQRC-HANDLE-IN-USE-FOR-UOW PIC S9(9) BINARY.
       10 MQRC-UOW-ENLISTMENT-ERROR PIC S9(9) BINARY.
       10 MQRC-UOW-MIX-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-WXP-ERROR PIC S9(9) BINARY.
       10 MQRC-CURRENT-RECORD-ERROR PIC S9(9) BINARY.
       10 MQRC-NEXT-OFFSET-ERROR PIC S9(9) BINARY.
       10 MQRC-NO-RECORD-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-OBJECT-LEVEL-INCOMPATIBLE PIC S9(9) BINARY.
       10 MQRC-NEXT-RECORD-ERROR PIC S9(9) BINARY.
       10 MQRC-BACKOUT-THRESHOLD-REACHED PIC S9(9) BINARY.
       10 MQRC-MSG-NOT-MATCHED PIC S9(9) BINARY.
       10 MQRC-JMS-FORMAT-ERROR PIC S9(9) BINARY.
       10 MQRC-SEGMENTS-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-WRONG-CF-LEVEL PIC S9(9) BINARY.
       10 MQRC-CONFIG-CREATE-OBJECT PIC S9(9) BINARY.
       10 MQRC-CONFIG-CHANGE-OBJECT PIC S9(9) BINARY.
       10 MQRC-CONFIG-DELETE-OBJECT PIC S9(9) BINARY.
       10 MQRC-CONFIG-REFRESH-OBJECT PIC S9(9) BINARY.
       10 MQRC-CHANNEL-SSL-ERROR PIC S9(9) BINARY.
       10 MQRC-PARTICIPANT-NOT-DEFINED PIC S9(9) BINARY.
       10 MQRC-CF-STRUC-FAILED PIC S9(9) BINARY.
       10 MQRC-API-EXIT-ERROR PIC S9(9) BINARY.
       10 MQRC-API-EXIT-INIT-ERROR PIC S9(9) BINARY.
       10 MQRC-API-EXIT-TERM-ERROR PIC S9(9) BINARY.
       10 MQRC-EXIT-REASON-ERROR PIC S9(9) BINARY.
       10 MQRC-RESERVED-VALUE-ERROR PIC S9(9) BINARY.
       10 MQRC-NO-DATA-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-SCO-ERROR PIC S9(9) BINARY.
       10 MQRC-KEY-REPOSITORY-ERROR PIC S9(9) BINARY.
       10 MQRC-CRYPTO-HARDWARE-ERROR PIC S9(9) BINARY.
       10 MQRC-AUTH-INFO-REC-COUNT-ERROR PIC S9(9) BINARY.
       10 MQRC-AUTH-INFO-REC-ERROR PIC S9(9) BINARY.
       10 MQRC-AIR-ERROR PIC S9(9) BINARY.
       10 MQRC-AUTH-INFO-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-AUTH-INFO-CONN-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-LDAP-USER-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-LDAP-USER-NAME-LENGTH-ERR PIC S9(9) BINARY.
       10 MQRC-LDAP-PASSWORD-ERROR PIC S9(9) BINARY.
       10 MQRC-SSL-ALREADY-INITIALIZED PIC S9(9) BINARY.
       10 MQRC-SSL-CONFIG-ERROR PIC S9(9) BINARY.
       10 MQRC-SSL-INITIALIZATION-ERROR PIC S9(9) BINARY.
       10 MQRC-Q-INDEX-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-CFBS-ERROR PIC S9(9) BINARY.
       10 MQRC-SSL-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-JSSE-ERROR PIC S9(9) BINARY.
       10 MQRC-SSL-PEER-NAME-MISMATCH PIC S9(9) BINARY.
       10 MQRC-SSL-PEER-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-UNSUPPORTED-CIPHER-SUITE PIC S9(9) BINARY.
       10 MQRC-SSL-CERTIFICATE-REVOKED PIC S9(9) BINARY.
       10 MQRC-SSL-CERT-STORE-ERROR PIC S9(9) BINARY.
       10 MQRC-CLIENT-EXIT-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-CLIENT-EXIT-ERROR PIC S9(9) BINARY.
       10 MQRC-UOW-COMMITTED PIC S9(9) BINARY.
       10 MQRC-SSL-KEY-RESET-ERROR PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-COMPONENT-NAME PIC S9(9) BINARY.
       10 MQRC-LOGGER-STATUS PIC S9(9) BINARY.
       10 MQRC-COMMAND-MQSC PIC S9(9) BINARY.
       10 MQRC-COMMAND-PCF PIC S9(9) BINARY.
       10 MQRC-CFIF-ERROR PIC S9(9) BINARY.
       10 MQRC-CFSF-ERROR PIC S9(9) BINARY.
       10 MQRC-CFGR-ERROR PIC S9(9) BINARY.
       10 MQRC-MSG-NOT-ALLOWED-IN-GROUP PIC S9(9) BINARY.
       10 MQRC-FILTER-OPERATOR-ERROR PIC S9(9) BINARY.
       10 MQRC-NESTED-SELECTOR-ERROR PIC S9(9) BINARY.
       10 MQRC-EPH-ERROR PIC S9(9) BINARY.
       10 MQRC-RFH-FORMAT-ERROR PIC S9(9) BINARY.
       10 MQRC-CFBF-ERROR PIC S9(9) BINARY.
       10 MQRC-CLIENT-CHANNEL-CONFLICT PIC S9(9) BINARY.
       10 MQRC-SD-ERROR PIC S9(9) BINARY.
       10 MQRC-TOPIC-STRING-ERROR PIC S9(9) BINARY.
       10 MQRC-STS-ERROR PIC S9(9) BINARY.
       10 MQRC-NO-SUBSCRIPTION PIC S9(9) BINARY.
       10 MQRC-SUBSCRIPTION-IN-USE PIC S9(9) BINARY.
       10 MQRC-STAT-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-SUB-USER-DATA-ERROR PIC S9(9) BINARY.
       10 MQRC-SUB-ALREADY-EXISTS PIC S9(9) BINARY.
       10 MQRC-IDENTITY-MISMATCH PIC S9(9) BINARY.
       10 MQRC-ALTER-SUB-ERROR PIC S9(9) BINARY.
       10 MQRC-DURABILITY-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-NO-RETAINED-MSG PIC S9(9) BINARY.
       10 MQRC-SRO-ERROR PIC S9(9) BINARY.
       10 MQRC-SUB-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-OBJECT-STRING-ERROR PIC S9(9) BINARY.
       10 MQRC-PROPERTY-NAME-ERROR PIC S9(9) BINARY.
       10 MQRC-SEGMENTATION-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-CBD-ERROR PIC S9(9) BINARY.
       10 MQRC-CTLO-ERROR PIC S9(9) BINARY.
       10 MQRC-NO-CALLBACKS-ACTIVE PIC S9(9) BINARY.
       10 MQRC-CALLBACK-NOT-REGISTERED PIC S9(9) BINARY.
       10 MQRC-OPTIONS-CHANGED PIC S9(9) BINARY.
       10 MQRC-READ-AHEAD-MSGS PIC S9(9) BINARY.
       10 MQRC-SELECTOR-SYNTAX-ERROR PIC S9(9) BINARY.
       10 MQRC-HMSG-ERROR PIC S9(9) BINARY.
       10 MQRC-CMHO-ERROR PIC S9(9) BINARY.
       10 MQRC-DMHO-ERROR PIC S9(9) BINARY.
       10 MQRC-SMPO-ERROR PIC S9(9) BINARY.
       10 MQRC-IMPO-ERROR PIC S9(9) BINARY.
       10 MQRC-PROPERTY-NAME-TOO-BIG PIC S9(9) BINARY.
       10 MQRC-PROP-VALUE-NOT-CONVERTED PIC S9(9) BINARY.
       10 MQRC-PROP-TYPE-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-PROPERTY-VALUE-TOO-BIG PIC S9(9) BINARY.
       10 MQRC-PROP-CONV-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-PROPERTY-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-PROP-NUMBER-FORMAT-ERROR PIC S9(9) BINARY.
       10 MQRC-PROPERTY-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-PROPERTIES-TOO-BIG PIC S9(9) BINARY.
       10 MQRC-PUT-NOT-RETAINED PIC S9(9) BINARY.
       10 MQRC-ALIAS-TARGTYPE-CHANGED PIC S9(9) BINARY.
       10 MQRC-DMPO-ERROR PIC S9(9) BINARY.
       10 MQRC-PD-ERROR PIC S9(9) BINARY.
       10 MQRC-CALLBACK-TYPE-ERROR PIC S9(9) BINARY.
       10 MQRC-CBD-OPTIONS-ERROR PIC S9(9) BINARY.
       10 MQRC-MAX-MSG-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-CALLBACK-ROUTINE-ERROR PIC S9(9) BINARY.
       10 MQRC-CALLBACK-LINK-ERROR PIC S9(9) BINARY.
       10 MQRC-OPERATION-ERROR PIC S9(9) BINARY.
       10 MQRC-BMHO-ERROR PIC S9(9) BINARY.
       10 MQRC-UNSUPPORTED-PROPERTY PIC S9(9) BINARY.
       10 MQRC-PROP-NAME-NOT-CONVERTED PIC S9(9) BINARY.
       10 MQRC-GET-ENABLED PIC S9(9) BINARY.
       10 MQRC-MODULE-NOT-FOUND PIC S9(9) BINARY.
       10 MQRC-MODULE-INVALID PIC S9(9) BINARY.
       10 MQRC-MODULE-ENTRY-NOT-FOUND PIC S9(9) BINARY.
       10 MQRC-MIXED-CONTENT-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-MSG-HANDLE-IN-USE PIC S9(9) BINARY.
       10 MQRC-HCONN-ASYNC-ACTIVE PIC S9(9) BINARY.
       10 MQRC-MHBO-ERROR PIC S9(9) BINARY.
       10 MQRC-PUBLICATION-FAILURE PIC S9(9) BINARY.
       10 MQRC-SUB-INHIBITED PIC S9(9) BINARY.
       10 MQRC-SELECTOR-ALWAYS-FALSE PIC S9(9) BINARY.
       10 MQRC-XEPO-ERROR PIC S9(9) BINARY.
       10 MQRC-DURABILITY-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-TOPIC-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-SUBLEVEL-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-PROPERTY-NAME-LENGTH-ERR PIC S9(9) BINARY.
       10 MQRC-DUPLICATE-GROUP-SUB PIC S9(9) BINARY.
       10 MQRC-GROUPING-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-SELECTOR-INVALID-FOR-TYPE PIC S9(9) BINARY.
       10 MQRC-HOBJ-QUIESCED PIC S9(9) BINARY.
       10 MQRC-HOBJ-QUIESCED-NO-MSGS PIC S9(9) BINARY.
       10 MQRC-SELECTION-STRING-ERROR PIC S9(9) BINARY.
       10 MQRC-RES-OBJECT-STRING-ERROR PIC S9(9) BINARY.
       10 MQRC-CONNECTION-SUSPENDED PIC S9(9) BINARY.
       10 MQRC-INVALID-DESTINATION PIC S9(9) BINARY.
       10 MQRC-INVALID-SUBSCRIPTION PIC S9(9) BINARY.
       10 MQRC-SELECTOR-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-RETAINED-MSG-Q-ERROR PIC S9(9) BINARY.
       10 MQRC-RETAINED-NOT-DELIVERED PIC S9(9) BINARY.
       10 MQRC-RFH-RESTRICTED-FORMAT-ERR PIC S9(9) BINARY.
       10 MQRC-CONNECTION-STOPPED PIC S9(9) BINARY.
       10 MQRC-ASYNC-UOW-CONFLICT PIC S9(9) BINARY.
       10 MQRC-ASYNC-XA-CONFLICT PIC S9(9) BINARY.
       10 MQRC-PUBSUB-INHIBITED PIC S9(9) BINARY.
       10 MQRC-MSG-HANDLE-COPY-FAILURE PIC S9(9) BINARY.
       10 MQRC-DEST-CLASS-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQRC-OPERATION-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-ACTION-ERROR PIC S9(9) BINARY.
       10 MQRC-CHANNEL-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-HOST-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-CHANNEL-CONFIG-ERROR PIC S9(9) BINARY.
       10 MQRC-UNKNOWN-CHANNEL-NAME PIC S9(9) BINARY.
       10 MQRC-LOOPING-PUBLICATION PIC S9(9) BINARY.
       10 MQRC-ALREADY-JOINED PIC S9(9) BINARY.
       10 MQRC-STANDBY-Q-MGR PIC S9(9) BINARY.
       10 MQRC-RECONNECTING PIC S9(9) BINARY.
       10 MQRC-RECONNECTED PIC S9(9) BINARY.
       10 MQRC-RECONNECT-QMID-MISMATCH PIC S9(9) BINARY.
       10 MQRC-RECONNECT-INCOMPATIBLE PIC S9(9) BINARY.
       10 MQRC-RECONNECT-FAILED PIC S9(9) BINARY.
       10 MQRC-CALL-INTERRUPTED PIC S9(9) BINARY.
       10 MQRC-NO-SUBS-MATCHED PIC S9(9) BINARY.
       10 MQRC-SELECTION-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-CHANNEL-SSL-WARNING PIC S9(9) BINARY.
       10 MQRC-OCSP-URL-ERROR PIC S9(9) BINARY.
       10 MQRC-CONTENT-ERROR PIC S9(9) BINARY.
       10 MQRC-RECONNECT-Q-MGR-REQD PIC S9(9) BINARY.
       10 MQRC-RECONNECT-TIMED-OUT PIC S9(9) BINARY.
       10 MQRC-PUBLISH-EXIT-ERROR PIC S9(9) BINARY.
       10 MQRC-COMMINFO-ERROR PIC S9(9) BINARY.
       10 MQRC-DEF-SYNCPOINT-INHIBITED PIC S9(9) BINARY.
       10 MQRC-MULTICAST-ONLY PIC S9(9) BINARY.
       10 MQRC-DATA-SET-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-GROUPING-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-GROUP-ADDRESS-ERROR PIC S9(9) BINARY.
       10 MQRC-MULTICAST-CONFIG-ERROR PIC S9(9) BINARY.
       10 MQRC-MULTICAST-INTERFACE-ERROR PIC S9(9) BINARY.
       10 MQRC-MULTICAST-SEND-ERROR PIC S9(9) BINARY.
       10 MQRC-MULTICAST-INTERNAL-ERROR PIC S9(9) BINARY.
       10 MQRC-CONNECTION-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-SYNCPOINT-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-SSL-ALT-PROVIDER-REQUIRED PIC S9(9) BINARY.
       10 MQRC-MCAST-PUB-STATUS PIC S9(9) BINARY.
       10 MQRC-MCAST-SUB-STATUS PIC S9(9) BINARY.
       10 MQRC-PRECONN-EXIT-LOAD-ERROR PIC S9(9) BINARY.
       10 MQRC-PRECONN-EXIT-NOT-FOUND PIC S9(9) BINARY.
       10 MQRC-PRECONN-EXIT-ERROR PIC S9(9) BINARY.
       10 MQRC-CD-ARRAY-ERROR PIC S9(9) BINARY.
       10 MQRC-CHANNEL-BLOCKED PIC S9(9) BINARY.
       10 MQRC-CHANNEL-BLOCKED-WARNING PIC S9(9) BINARY.
       10 MQRC-SUBSCRIPTION-CREATE PIC S9(9) BINARY.
       10 MQRC-SUBSCRIPTION-DELETE PIC S9(9) BINARY.
       10 MQRC-SUBSCRIPTION-CHANGE PIC S9(9) BINARY.
       10 MQRC-SUBSCRIPTION-REFRESH PIC S9(9) BINARY.
       10 MQRC-INSTALLATION-MISMATCH PIC S9(9) BINARY.
       10 MQRC-NOT-PRIVILEGED PIC S9(9) BINARY.
       10 MQRC-PROPERTIES-DISABLED PIC S9(9) BINARY.
       10 MQRC-HMSG-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-EXIT-PROPS-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQRC-INSTALLATION-MISSING PIC S9(9) BINARY.
       10 MQRC-FASTPATH-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-CIPHER-SPEC-NOT-SUITE-B PIC S9(9) BINARY.
       10 MQRC-SUITE-B-ERROR PIC S9(9) BINARY.
       10 MQRC-CERT-VAL-POLICY-ERROR PIC S9(9) BINARY.
       10 MQRC-PASSWORD-PROTECTION-ERROR PIC S9(9) BINARY.
       10 MQRC-CSP-ERROR PIC S9(9) BINARY.
       10 MQRC-CERT-LABEL-NOT-ALLOWED PIC S9(9) BINARY.
       10 MQRC-ADMIN-TOPIC-STRING-ERROR PIC S9(9) BINARY.
       10 MQRC-AMQP-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-CCDT-URL-ERROR PIC S9(9) BINARY.
       10 MQRC-Q-MGR-RECONNECT-REQUESTED PIC S9(9) BINARY.
       10 MQRC-BNO-ERROR PIC S9(9) BINARY.
       10 MQRC-OUTBOUND-SNI-NOT-VALID PIC S9(9) BINARY.
       10 MQRC-REOPEN-EXCL-INPUT-ERROR PIC S9(9) BINARY.
       10 MQRC-REOPEN-INQUIRE-ERROR PIC S9(9) BINARY.
       10 MQRC-REOPEN-SAVED-CONTEXT-ERR PIC S9(9) BINARY.
       10 MQRC-REOPEN-TEMPORARY-Q-ERROR PIC S9(9) BINARY.
       10 MQRC-ATTRIBUTE-LOCKED PIC S9(9) BINARY.
       10 MQRC-CURSOR-NOT-VALID PIC S9(9) BINARY.
       10 MQRC-ENCODING-ERROR PIC S9(9) BINARY.
       10 MQRC-STRUC-ID-ERROR PIC S9(9) BINARY.
       10 MQRC-NULL-POINTER PIC S9(9) BINARY.
       10 MQRC-NO-CONNECTION-REFERENCE PIC S9(9) BINARY.
       10 MQRC-NO-BUFFER PIC S9(9) BINARY.
       10 MQRC-BINARY-DATA-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-BUFFER-NOT-AUTOMATIC PIC S9(9) BINARY.
       10 MQRC-INSUFFICIENT-BUFFER PIC S9(9) BINARY.
       10 MQRC-INSUFFICIENT-DATA PIC S9(9) BINARY.
       10 MQRC-DATA-TRUNCATED PIC S9(9) BINARY.
       10 MQRC-ZERO-LENGTH PIC S9(9) BINARY.
       10 MQRC-NEGATIVE-LENGTH PIC S9(9) BINARY.
       10 MQRC-NEGATIVE-OFFSET PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-FORMAT PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-OBJECT-STATE PIC S9(9) BINARY.
       10 MQRC-CONTEXT-OBJECT-NOT-VALID PIC S9(9) BINARY.
       10 MQRC-CONTEXT-OPEN-ERROR PIC S9(9) BINARY.
       10 MQRC-STRUC-LENGTH-ERROR PIC S9(9) BINARY.
       10 MQRC-NOT-CONNECTED PIC S9(9) BINARY.
       10 MQRC-NOT-OPEN PIC S9(9) BINARY.
       10 MQRC-DISTRIBUTION-LIST-EMPTY PIC S9(9) BINARY.
       10 MQRC-INCONSISTENT-OPEN-OPTIONS PIC S9(9) BINARY.
       10 MQRC-WRONG-VERSION PIC S9(9) BINARY.
       10 MQRC-REFERENCE-ERROR PIC S9(9) BINARY.
       10 MQRC-XR-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQRC-SUB-JOIN-NOT-ALTERABLE PIC S9(9) BINARY.
       10 MQQT-LOCAL PIC S9(9) BINARY.
       10 MQQT-MODEL PIC S9(9) BINARY.
       10 MQQT-ALIAS PIC S9(9) BINARY.
       10 MQQT-REMOTE PIC S9(9) BINARY.
       10 MQQT-CLUSTER PIC S9(9) BINARY.
       10 MQCQT-LOCAL-Q PIC S9(9) BINARY.
       10 MQCQT-ALIAS-Q PIC S9(9) BINARY.
       10 MQCQT-REMOTE-Q PIC S9(9) BINARY.
       10 MQCQT-Q-MGR-ALIAS PIC S9(9) BINARY.
       10 MQQT-ALL PIC S9(9) BINARY.
       10 MQQDT-PREDEFINED PIC S9(9) BINARY.
       10 MQQDT-PERMANENT-DYNAMIC PIC S9(9) BINARY.
       10 MQQDT-TEMPORARY-DYNAMIC PIC S9(9) BINARY.
       10 MQQDT-SHARED-DYNAMIC PIC S9(9) BINARY.
       10 MQQA-GET-INHIBITED PIC S9(9) BINARY.
       10 MQQA-GET-ALLOWED PIC S9(9) BINARY.
       10 MQQA-PUT-INHIBITED PIC S9(9) BINARY.
       10 MQQA-PUT-ALLOWED PIC S9(9) BINARY.
       10 MQQA-SHAREABLE PIC S9(9) BINARY.
       10 MQQA-NOT-SHAREABLE PIC S9(9) BINARY.
       10 MQQA-BACKOUT-HARDENED PIC S9(9) BINARY.
       10 MQQA-BACKOUT-NOT-HARDENED PIC S9(9) BINARY.
       10 MQMDS-PRIORITY PIC S9(9) BINARY.
       10 MQMDS-FIFO PIC S9(9) BINARY.
       10 MQNPM-CLASS-NORMAL PIC S9(9) BINARY.
       10 MQNPM-CLASS-HIGH PIC S9(9) BINARY.
       10 MQTC-OFF PIC S9(9) BINARY.
       10 MQTC-ON PIC S9(9) BINARY.
       10 MQTT-NONE PIC S9(9) BINARY.
       10 MQTT-FIRST PIC S9(9) BINARY.
       10 MQTT-EVERY PIC S9(9) BINARY.
       10 MQTT-DEPTH PIC S9(9) BINARY.
       10 MQTRIGGER-RESTART-NO PIC S9(9) BINARY.
       10 MQTRIGGER-RESTART-YES PIC S9(9) BINARY.
       10 MQUS-NORMAL PIC S9(9) BINARY.
       10 MQUS-TRANSMISSION PIC S9(9) BINARY.
       10 MQDL-SUPPORTED PIC S9(9) BINARY.
       10 MQDL-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQIT-NONE PIC S9(9) BINARY.
       10 MQIT-MSG-ID PIC S9(9) BINARY.
       10 MQIT-CORREL-ID PIC S9(9) BINARY.
       10 MQIT-MSG-TOKEN PIC S9(9) BINARY.
       10 MQIT-GROUP-ID PIC S9(9) BINARY.
       10 MQBND-BIND-ON-OPEN PIC S9(9) BINARY.
       10 MQBND-BIND-NOT-FIXED PIC S9(9) BINARY.
       10 MQBND-BIND-ON-GROUP PIC S9(9) BINARY.
       10 MQQSGD-ALL PIC S9(9) BINARY.
       10 MQQSGD-Q-MGR PIC S9(9) BINARY.
       10 MQQSGD-COPY PIC S9(9) BINARY.
       10 MQQSGD-SHARED PIC S9(9) BINARY.
       10 MQQSGD-GROUP PIC S9(9) BINARY.
       10 MQQSGD-PRIVATE PIC S9(9) BINARY.
       10 MQQSGD-LIVE PIC S9(9) BINARY.
       10 MQREORG-DISABLED PIC S9(9) BINARY.
       10 MQREORG-ENABLED PIC S9(9) BINARY.
       10 MQQFS-DEFAULT PIC S9(9) BINARY.
       10 MQCEX-NOLIMIT PIC S9(9) BINARY.
       10 MQCEX-AS-PARENT PIC S9(9) BINARY.
       10 MQREADA-NO PIC S9(9) BINARY.
       10 MQREADA-YES PIC S9(9) BINARY.
       10 MQREADA-DISABLED PIC S9(9) BINARY.
       10 MQREADA-INHIBITED PIC S9(9) BINARY.
       10 MQREADA-BACKLOG PIC S9(9) BINARY.
       10 MQPROP-COMPATIBILITY PIC S9(9) BINARY.
       10 MQPROP-NONE PIC S9(9) BINARY.
       10 MQPROP-ALL PIC S9(9) BINARY.
       10 MQPROP-FORCE-MQRFH2 PIC S9(9) BINARY.
       10 MQPROP-V6COMPAT PIC S9(9) BINARY.
       10 MQST-BEST-EFFORT PIC S9(9) BINARY.
       10 MQST-MUST-DUP PIC S9(9) BINARY.
       10 MQNC-MAX-NAMELIST-NAME-COUNT PIC S9(9) BINARY.
       10 MQNT-NONE PIC S9(9) BINARY.
       10 MQNT-Q PIC S9(9) BINARY.
       10 MQNT-CLUSTER PIC S9(9) BINARY.
       10 MQNT-AUTH-INFO PIC S9(9) BINARY.
       10 MQNT-ALL PIC S9(9) BINARY.
       10 MQCFR-YES PIC S9(9) BINARY.
       10 MQCFR-NO PIC S9(9) BINARY.
       10 MQRECAUTO-NO PIC S9(9) BINARY.
       10 MQRECAUTO-YES PIC S9(9) BINARY.
       10 MQCFCONLOS-TERMINATE PIC S9(9) BINARY.
       10 MQCFCONLOS-TOLERATE PIC S9(9) BINARY.
       10 MQCFCONLOS-ASQMGR PIC S9(9) BINARY.
       10 MQSVC-TYPE-COMMAND PIC S9(9) BINARY.
       10 MQSVC-TYPE-SERVER PIC S9(9) BINARY.
       10 MQADOPT-CHECK-NONE PIC S9(9) BINARY.
       10 MQADOPT-CHECK-ALL PIC S9(9) BINARY.
       10 MQADOPT-CHECK-Q-MGR-NAME PIC S9(9) BINARY.
       10 MQADOPT-CHECK-NET-ADDR PIC S9(9) BINARY.
       10 MQADOPT-CHECK-CHANNEL-NAME PIC S9(9) BINARY.
       10 MQADOPT-TYPE-NO PIC S9(9) BINARY.
       10 MQADOPT-TYPE-ALL PIC S9(9) BINARY.
       10 MQADOPT-TYPE-SVR PIC S9(9) BINARY.
       10 MQADOPT-TYPE-SDR PIC S9(9) BINARY.
       10 MQADOPT-TYPE-RCVR PIC S9(9) BINARY.
       10 MQADOPT-TYPE-CLUSRCVR PIC S9(9) BINARY.
       10 MQAUTO-START-NO PIC S9(9) BINARY.
       10 MQAUTO-START-YES PIC S9(9) BINARY.
       10 MQCHAD-DISABLED PIC S9(9) BINARY.
       10 MQCHAD-ENABLED PIC S9(9) BINARY.
       10 MQCLWL-USEQ-LOCAL PIC S9(9) BINARY.
       10 MQCLWL-USEQ-ANY PIC S9(9) BINARY.
       10 MQCLWL-USEQ-AS-Q-MGR PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-1 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-101 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-110 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-114 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-120 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-200 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-201 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-210 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-211 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-220 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-221 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-230 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-320 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-420 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-500 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-510 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-520 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-530 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-531 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-600 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-700 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-701 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-710 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-711 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-750 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-800 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-801 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-802 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-900 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-901 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-902 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-903 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-904 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-905 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-910 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-911 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-912 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-913 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-914 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-915 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-920 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-921 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-922 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-923 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-924 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-925 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-930 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-931 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-932 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-933 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-934 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-935 PIC S9(9) BINARY.
       10 MQCMDL-LEVEL-940 PIC S9(9) BINARY.
       10 MQCMDL-CURRENT-LEVEL PIC S9(9) BINARY.
       10 MQCSRV-CONVERT-NO PIC S9(9) BINARY.
       10 MQCSRV-CONVERT-YES PIC S9(9) BINARY.
       10 MQCSRV-DLQ-NO PIC S9(9) BINARY.
       10 MQCSRV-DLQ-YES PIC S9(9) BINARY.
       10 MQDNSWLM-NO PIC S9(9) BINARY.
       10 MQDNSWLM-YES PIC S9(9) BINARY.
       10 MQEXPI-OFF PIC S9(9) BINARY.
       10 MQIGQ-DISABLED PIC S9(9) BINARY.
       10 MQIGQ-ENABLED PIC S9(9) BINARY.
       10 MQIGQPA-DEFAULT PIC S9(9) BINARY.
       10 MQIGQPA-CONTEXT PIC S9(9) BINARY.
       10 MQIGQPA-ONLY-IGQ PIC S9(9) BINARY.
       10 MQIGQPA-ALTERNATE-OR-IGQ PIC S9(9) BINARY.
       10 MQIPADDR-IPV4 PIC S9(9) BINARY.
       10 MQIPADDR-IPV6 PIC S9(9) BINARY.
       10 MQMMBI-UNLIMITED PIC S9(9) BINARY.
       10 MQMON-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQMON-NONE PIC S9(9) BINARY.
       10 MQMON-Q-MGR PIC S9(9) BINARY.
       10 MQMON-OFF PIC S9(9) BINARY.
       10 MQMON-ON PIC S9(9) BINARY.
       10 MQMON-DISABLED PIC S9(9) BINARY.
       10 MQMON-ENABLED PIC S9(9) BINARY.
       10 MQMON-LOW PIC S9(9) BINARY.
       10 MQMON-MEDIUM PIC S9(9) BINARY.
       10 MQMON-HIGH PIC S9(9) BINARY.
       10 MQFUN-TYPE-UNKNOWN PIC S9(9) BINARY.
       10 MQFUN-TYPE-JVM PIC S9(9) BINARY.
       10 MQFUN-TYPE-PROGRAM PIC S9(9) BINARY.
       10 MQFUN-TYPE-PROCEDURE PIC S9(9) BINARY.
       10 MQFUN-TYPE-USERDEF PIC S9(9) BINARY.
       10 MQFUN-TYPE-COMMAND PIC S9(9) BINARY.
       10 MQACTV-DETAIL-LOW PIC S9(9) BINARY.
       10 MQACTV-DETAIL-MEDIUM PIC S9(9) BINARY.
       10 MQACTV-DETAIL-HIGH PIC S9(9) BINARY.
       10 MQPL-MVS PIC S9(9) BINARY.
       10 MQPL-OS390 PIC S9(9) BINARY.
       10 MQPL-ZOS PIC S9(9) BINARY.
       10 MQPL-OS2 PIC S9(9) BINARY.
       10 MQPL-AIX PIC S9(9) BINARY.
       10 MQPL-UNIX PIC S9(9) BINARY.
       10 MQPL-OS400 PIC S9(9) BINARY.
       10 MQPL-WINDOWS PIC S9(9) BINARY.
       10 MQPL-WINDOWS-NT PIC S9(9) BINARY.
       10 MQPL-VMS PIC S9(9) BINARY.
       10 MQPL-NSK PIC S9(9) BINARY.
       10 MQPL-NSS PIC S9(9) BINARY.
       10 MQPL-OPEN-TP1 PIC S9(9) BINARY.
       10 MQPL-VM PIC S9(9) BINARY.
       10 MQPL-TPF PIC S9(9) BINARY.
       10 MQPL-VSE PIC S9(9) BINARY.
       10 MQPL-APPLIANCE PIC S9(9) BINARY.
       10 MQPROP-UNRESTRICTED-LENGTH PIC S9(9) BINARY.
       10 MQPSM-DISABLED PIC S9(9) BINARY.
       10 MQPSM-COMPAT PIC S9(9) BINARY.
       10 MQPSM-ENABLED PIC S9(9) BINARY.
       10 MQPSCLUS-DISABLED PIC S9(9) BINARY.
       10 MQPSCLUS-ENABLED PIC S9(9) BINARY.
       10 MQQMOPT-DISABLED PIC S9(9) BINARY.
       10 MQQMOPT-ENABLED PIC S9(9) BINARY.
       10 MQQMOPT-REPLY PIC S9(9) BINARY.
       10 MQRCVTIME-MULTIPLY PIC S9(9) BINARY.
       10 MQRCVTIME-ADD PIC S9(9) BINARY.
       10 MQRCVTIME-EQUAL PIC S9(9) BINARY.
       10 MQRECORDING-DISABLED PIC S9(9) BINARY.
       10 MQRECORDING-Q PIC S9(9) BINARY.
       10 MQRECORDING-MSG PIC S9(9) BINARY.
       10 MQSCYC-UPPER PIC S9(9) BINARY.
       10 MQSCYC-MIXED PIC S9(9) BINARY.
       10 MQSQQM-USE PIC S9(9) BINARY.
       10 MQSQQM-IGNORE PIC S9(9) BINARY.
       10 MQSSL-FIPS-NO PIC S9(9) BINARY.
       10 MQSSL-FIPS-YES PIC S9(9) BINARY.
       10 MQSP-AVAILABLE PIC S9(9) BINARY.
       10 MQSP-NOT-AVAILABLE PIC S9(9) BINARY.
       10 MQSVC-CONTROL-Q-MGR PIC S9(9) BINARY.
       10 MQSVC-CONTROL-Q-MGR-START PIC S9(9) BINARY.
       10 MQSVC-CONTROL-MANUAL PIC S9(9) BINARY.
       10 MQSVC-STATUS-STOPPED PIC S9(9) BINARY.
       10 MQSVC-STATUS-STARTING PIC S9(9) BINARY.
       10 MQSVC-STATUS-RUNNING PIC S9(9) BINARY.
       10 MQSVC-STATUS-STOPPING PIC S9(9) BINARY.
       10 MQSVC-STATUS-RETRYING PIC S9(9) BINARY.
       10 MQTCPKEEP-NO PIC S9(9) BINARY.
       10 MQTCPKEEP-YES PIC S9(9) BINARY.
       10 MQTCPSTACK-SINGLE PIC S9(9) BINARY.
       10 MQTCPSTACK-MULTIPLE PIC S9(9) BINARY.
       10 MQTRAXSTR-NO PIC S9(9) BINARY.
       10 MQTRAXSTR-YES PIC S9(9) BINARY.
       10 MQCAP-NOT-SUPPORTED PIC S9(9) BINARY.
       10 MQCAP-SUPPORTED PIC S9(9) BINARY.
       10 MQCAP-EXPIRED PIC S9(9) BINARY.
       10 MQMEDIMGSCHED-MANUAL PIC S9(9) BINARY.
       10 MQMEDIMGSCHED-AUTO PIC S9(9) BINARY.
       10 MQMEDIMGINTVL-OFF PIC S9(9) BINARY.
       10 MQMEDIMGLOGLN-OFF PIC S9(9) BINARY.
       10 MQIMGRCOV-NO PIC S9(9) BINARY.
       10 MQIMGRCOV-YES PIC S9(9) BINARY.
       10 MQIMGRCOV-AS-Q-MGR PIC S9(9) BINARY.
       10 MQDLV-AS-PARENT PIC S9(9) BINARY.
       10 MQDLV-ALL PIC S9(9) BINARY.
       10 MQDLV-ALL-DUR PIC S9(9) BINARY.
       10 MQDLV-ALL-AVAIL PIC S9(9) BINARY.
       10 MQMASTER-NO PIC S9(9) BINARY.
       10 MQMASTER-YES PIC S9(9) BINARY.
       10 MQSCOPE-ALL PIC S9(9) BINARY.
       10 MQSCOPE-AS-PARENT PIC S9(9) BINARY.
       10 MQSCOPE-QMGR PIC S9(9) BINARY.
       10 MQSUB-DURABLE-AS-PARENT PIC S9(9) BINARY.
       10 MQSUB-DURABLE-ALLOWED PIC S9(9) BINARY.
       10 MQSUB-DURABLE-INHIBITED PIC S9(9) BINARY.
       10 MQTA-BLOCK PIC S9(9) BINARY.
       10 MQTA-PASSTHRU PIC S9(9) BINARY.
       10 MQTA-SUB-AS-PARENT PIC S9(9) BINARY.
       10 MQTA-SUB-INHIBITED PIC S9(9) BINARY.
       10 MQTA-SUB-ALLOWED PIC S9(9) BINARY.
       10 MQTA-PROXY-SUB-FORCE PIC S9(9) BINARY.
       10 MQTA-PROXY-SUB-FIRSTUSE PIC S9(9) BINARY.
       10 MQTA-PUB-AS-PARENT PIC S9(9) BINARY.
       10 MQTA-PUB-INHIBITED PIC S9(9) BINARY.
       10 MQTA-PUB-ALLOWED PIC S9(9) BINARY.
       10 MQTOPT-LOCAL PIC S9(9) BINARY.
       10 MQTOPT-CLUSTER PIC S9(9) BINARY.
       10 MQTOPT-ALL PIC S9(9) BINARY.
       10 MQMC-AS-PARENT PIC S9(9) BINARY.
       10 MQMC-ENABLED PIC S9(9) BINARY.
       10 MQMC-DISABLED PIC S9(9) BINARY.
       10 MQMC-ONLY PIC S9(9) BINARY.
       10 MQCIT-MULTICAST PIC S9(9) BINARY.
       10 MQDC-MANAGED PIC S9(9) BINARY.
       10 MQDC-PROVIDED PIC S9(9) BINARY.
       10 MQPSPROP-NONE PIC S9(9) BINARY.
       10 MQPSPROP-COMPAT PIC S9(9) BINARY.
       10 MQPSPROP-RFH2 PIC S9(9) BINARY.
       10 MQPSPROP-MSGPROP PIC S9(9) BINARY.
       10 MQRU-PUBLISH-ON-REQUEST PIC S9(9) BINARY.
       10 MQRU-PUBLISH-ALL PIC S9(9) BINARY.
       10 MQSUB-DURABLE-ALL PIC S9(9) BINARY.
       10 MQSUB-DURABLE-YES PIC S9(9) BINARY.
       10 MQSUB-DURABLE-NO PIC S9(9) BINARY.
       10 MQTSCOPE-QMGR PIC S9(9) BINARY.
       10 MQTSCOPE-ALL PIC S9(9) BINARY.
       10 MQVU-FIXED-USER PIC S9(9) BINARY.
       10 MQVU-ANY-USER PIC S9(9) BINARY.
       10 MQWS-DEFAULT PIC S9(9) BINARY.
       10 MQWS-CHAR PIC S9(9) BINARY.
       10 MQWS-TOPIC PIC S9(9) BINARY.
       10 MQUSRC-MAP PIC S9(9) BINARY.
       10 MQUSRC-NOACCESS PIC S9(9) BINARY.
       10 MQUSRC-CHANNEL PIC S9(9) BINARY.
       10 MQWARN-YES PIC S9(9) BINARY.
       10 MQWARN-NO PIC S9(9) BINARY.
       10 MQDSB-DEFAULT PIC S9(9) BINARY.
       10 MQDSB-8K PIC S9(9) BINARY.
       10 MQDSB-16K PIC S9(9) BINARY.
       10 MQDSB-32K PIC S9(9) BINARY.
       10 MQDSB-64K PIC S9(9) BINARY.
       10 MQDSB-128K PIC S9(9) BINARY.
       10 MQDSB-256K PIC S9(9) BINARY.
       10 MQDSB-512K PIC S9(9) BINARY.
       10 MQDSB-1024K PIC S9(9) BINARY.
       10 MQDSB-1M PIC S9(9) BINARY.
       10 MQDSE-DEFAULT PIC S9(9) BINARY.
       10 MQDSE-YES PIC S9(9) BINARY.
       10 MQDSE-NO PIC S9(9) BINARY.
       10 MQCFOFFLD-NONE PIC S9(9) BINARY.
       10 MQCFOFFLD-SMDS PIC S9(9) BINARY.
       10 MQCFOFFLD-DB2 PIC S9(9) BINARY.
       10 MQCFOFFLD-BOTH PIC S9(9) BINARY.
       10 MQUSEDLQ-AS-PARENT PIC S9(9) BINARY.
       10 MQUSEDLQ-NO PIC S9(9) BINARY.
       10 MQUSEDLQ-YES PIC S9(9) BINARY.
       10 MQHO-UNUSABLE-HOBJ PIC S9(9) BINARY.
       10 MQHO-NONE PIC S9(9) BINARY.
       10 MQCO-IMMEDIATE PIC S9(9) BINARY.
       10 MQCO-NONE PIC S9(9) BINARY.
       10 MQCO-DELETE PIC S9(9) BINARY.
       10 MQCO-DELETE-PURGE PIC S9(9) BINARY.
       10 MQCO-KEEP-SUB PIC S9(9) BINARY.
       10 MQCO-REMOVE-SUB PIC S9(9) BINARY.
       10 MQCO-QUIESCE PIC S9(9) BINARY.
       10 MQOP-START PIC S9(9) BINARY.
       10 MQOP-START-WAIT PIC S9(9) BINARY.
       10 MQOP-STOP PIC S9(9) BINARY.
       10 MQOP-REGISTER PIC S9(9) BINARY.
       10 MQOP-DEREGISTER PIC S9(9) BINARY.
       10 MQOP-SUSPEND PIC S9(9) BINARY.
       10 MQOP-RESUME PIC S9(9) BINARY.
       10 MQHM-UNUSABLE-HMSG PIC S9(18) BINARY.
       10 MQHM-NONE PIC S9(18) BINARY.
       10 MQBA-FIRST PIC S9(9) BINARY.
       10 MQBA-LAST PIC S9(9) BINARY.
       10 MQCA-ADMIN-TOPIC-NAME PIC S9(9) BINARY.
       10 MQCA-ALTERATION-DATE PIC S9(9) BINARY.
       10 MQCA-ALTERATION-TIME PIC S9(9) BINARY.
       10 MQCA-AMQP-SSL-CIPHER-SUITES PIC S9(9) BINARY.
       10 MQCA-AMQP-VERSION PIC S9(9) BINARY.
       10 MQCA-APPL-ID PIC S9(9) BINARY.
       10 MQCA-AUTH-INFO-CONN-NAME PIC S9(9) BINARY.
       10 MQCA-AUTH-INFO-DESC PIC S9(9) BINARY.
       10 MQCA-AUTH-INFO-NAME PIC S9(9) BINARY.
       10 MQCA-AUTH-INFO-OCSP-URL PIC S9(9) BINARY.
       10 MQCA-AUTO-REORG-CATALOG PIC S9(9) BINARY.
       10 MQCA-AUTO-REORG-START-TIME PIC S9(9) BINARY.
       10 MQCA-BACKOUT-REQ-Q-NAME PIC S9(9) BINARY.
       10 MQCA-BASE-OBJECT-NAME PIC S9(9) BINARY.
       10 MQCA-BASE-Q-NAME PIC S9(9) BINARY.
       10 MQCA-BATCH-INTERFACE-ID PIC S9(9) BINARY.
       10 MQCA-CERT-LABEL PIC S9(9) BINARY.
       10 MQCA-CF-STRUC-DESC PIC S9(9) BINARY.
       10 MQCA-CF-STRUC-NAME PIC S9(9) BINARY.
       10 MQCA-CHANNEL-AUTO-DEF-EXIT PIC S9(9) BINARY.
       10 MQCA-CHILD PIC S9(9) BINARY.
       10 MQCA-CHINIT-SERVICE-PARM PIC S9(9) BINARY.
       10 MQCA-CHLAUTH-DESC PIC S9(9) BINARY.
       10 MQCA-CICS-FILE-NAME PIC S9(9) BINARY.
       10 MQCA-CLUSTER-DATE PIC S9(9) BINARY.
       10 MQCA-CLUSTER-NAME PIC S9(9) BINARY.
       10 MQCA-CLUSTER-NAMELIST PIC S9(9) BINARY.
       10 MQCA-CLUSTER-Q-MGR-NAME PIC S9(9) BINARY.
       10 MQCA-CLUSTER-TIME PIC S9(9) BINARY.
       10 MQCA-CLUSTER-WORKLOAD-DATA PIC S9(9) BINARY.
       10 MQCA-CLUSTER-WORKLOAD-EXIT PIC S9(9) BINARY.
       10 MQCA-CLUS-CHL-NAME PIC S9(9) BINARY.
       10 MQCA-COMMAND-INPUT-Q-NAME PIC S9(9) BINARY.
       10 MQCA-COMMAND-REPLY-Q-NAME PIC S9(9) BINARY.
       10 MQCA-COMM-INFO-DESC PIC S9(9) BINARY.
       10 MQCA-COMM-INFO-NAME PIC S9(9) BINARY.
       10 MQCA-CONN-AUTH PIC S9(9) BINARY.
       10 MQCA-CREATION-DATE PIC S9(9) BINARY.
       10 MQCA-CREATION-TIME PIC S9(9) BINARY.
       10 MQCA-CUSTOM PIC S9(9) BINARY.
       10 MQCA-DEAD-LETTER-Q-NAME PIC S9(9) BINARY.
       10 MQCA-DEF-XMIT-Q-NAME PIC S9(9) BINARY.
       10 MQCA-DNS-GROUP PIC S9(9) BINARY.
       10 MQCA-ENV-DATA PIC S9(9) BINARY.
       10 MQCA-FIRST PIC S9(9) BINARY.
       10 MQCA-IGQ-USER-ID PIC S9(9) BINARY.
       10 MQCA-INITIAL-KEY PIC S9(9) BINARY.
       10 MQCA-INITIATION-Q-NAME PIC S9(9) BINARY.
       10 MQCA-INSTALLATION-DESC PIC S9(9) BINARY.
       10 MQCA-INSTALLATION-NAME PIC S9(9) BINARY.
       10 MQCA-INSTALLATION-PATH PIC S9(9) BINARY.
       10 MQCA-LAST PIC S9(9) BINARY.
       10 MQCA-LAST-USED PIC S9(9) BINARY.
       10 MQCA-LDAP-BASE-DN-GROUPS PIC S9(9) BINARY.
       10 MQCA-LDAP-BASE-DN-USERS PIC S9(9) BINARY.
       10 MQCA-LDAP-FIND-GROUP-FIELD PIC S9(9) BINARY.
       10 MQCA-LDAP-GROUP-ATTR-FIELD PIC S9(9) BINARY.
       10 MQCA-LDAP-GROUP-OBJECT-CLASS PIC S9(9) BINARY.
       10 MQCA-LDAP-PASSWORD PIC S9(9) BINARY.
       10 MQCA-LDAP-SHORT-USER-FIELD PIC S9(9) BINARY.
       10 MQCA-LDAP-USER-ATTR-FIELD PIC S9(9) BINARY.
       10 MQCA-LDAP-USER-NAME PIC S9(9) BINARY.
       10 MQCA-LDAP-USER-OBJECT-CLASS PIC S9(9) BINARY.
       10 MQCA-LU62-ARM-SUFFIX PIC S9(9) BINARY.
       10 MQCA-LU-GROUP-NAME PIC S9(9) BINARY.
       10 MQCA-LU-NAME PIC S9(9) BINARY.
       10 MQCA-MODEL-DURABLE-Q PIC S9(9) BINARY.
       10 MQCA-MODEL-NON-DURABLE-Q PIC S9(9) BINARY.
       10 MQCA-MONITOR-Q-NAME PIC S9(9) BINARY.
       10 MQCA-NAMELIST-DESC PIC S9(9) BINARY.
       10 MQCA-NAMELIST-NAME PIC S9(9) BINARY.
       10 MQCA-NAMES PIC S9(9) BINARY.
       10 MQCA-PARENT PIC S9(9) BINARY.
       10 MQCA-PASS-TICKET-APPL PIC S9(9) BINARY.
       10 MQCA-POLICY-NAME PIC S9(9) BINARY.
       10 MQCA-PROCESS-DESC PIC S9(9) BINARY.
       10 MQCA-PROCESS-NAME PIC S9(9) BINARY.
       10 MQCA-QSG-CERT-LABEL PIC S9(9) BINARY.
       10 MQCA-QSG-NAME PIC S9(9) BINARY.
       10 MQCA-Q-DESC PIC S9(9) BINARY.
       10 MQCA-Q-MGR-DESC PIC S9(9) BINARY.
       10 MQCA-Q-MGR-IDENTIFIER PIC S9(9) BINARY.
       10 MQCA-Q-MGR-NAME PIC S9(9) BINARY.
       10 MQCA-Q-NAME PIC S9(9) BINARY.
       10 MQCA-RECIPIENT-DN PIC S9(9) BINARY.
       10 MQCA-REMOTE-Q-MGR-NAME PIC S9(9) BINARY.
       10 MQCA-REMOTE-Q-NAME PIC S9(9) BINARY.
       10 MQCA-REPOSITORY-NAME PIC S9(9) BINARY.
       10 MQCA-REPOSITORY-NAMELIST PIC S9(9) BINARY.
       10 MQCA-RESUME-DATE PIC S9(9) BINARY.
       10 MQCA-RESUME-TIME PIC S9(9) BINARY.
       10 MQCA-SERVICE-DESC PIC S9(9) BINARY.
       10 MQCA-SERVICE-NAME PIC S9(9) BINARY.
       10 MQCA-SERVICE-START-ARGS PIC S9(9) BINARY.
       10 MQCA-SERVICE-START-COMMAND PIC S9(9) BINARY.
       10 MQCA-SERVICE-STOP-ARGS PIC S9(9) BINARY.
       10 MQCA-SERVICE-STOP-COMMAND PIC S9(9) BINARY.
       10 MQCA-SIGNER-DN PIC S9(9) BINARY.
       10 MQCA-SSL-CERT-ISSUER-NAME PIC S9(9) BINARY.
       10 MQCA-SSL-CRL-NAMELIST PIC S9(9) BINARY.
       10 MQCA-SSL-CRYPTO-HARDWARE PIC S9(9) BINARY.
       10 MQCA-SSL-KEY-LIBRARY PIC S9(9) BINARY.
       10 MQCA-SSL-KEY-MEMBER PIC S9(9) BINARY.
       10 MQCA-SSL-KEY-REPOSITORY PIC S9(9) BINARY.
       10 MQCA-SSL-KEY-REPO-PASSWORD PIC S9(9) BINARY.
       10 MQCA-STDERR-DESTINATION PIC S9(9) BINARY.
       10 MQCA-STDOUT-DESTINATION PIC S9(9) BINARY.
       10 MQCA-STORAGE-CLASS PIC S9(9) BINARY.
       10 MQCA-STORAGE-CLASS-DESC PIC S9(9) BINARY.
       10 MQCA-STREAM-QUEUE-NAME PIC S9(9) BINARY.
       10 MQCA-SYSTEM-LOG-Q-NAME PIC S9(9) BINARY.
       10 MQCA-TCP-NAME PIC S9(9) BINARY.
       10 MQCA-TOPIC-DESC PIC S9(9) BINARY.
       10 MQCA-TOPIC-NAME PIC S9(9) BINARY.
       10 MQCA-TOPIC-STRING PIC S9(9) BINARY.
       10 MQCA-TOPIC-STRING-FILTER PIC S9(9) BINARY.
       10 MQCA-TPIPE-NAME PIC S9(9) BINARY.
       10 MQCA-TRIGGER-CHANNEL-NAME PIC S9(9) BINARY.
       10 MQCA-TRIGGER-DATA PIC S9(9) BINARY.
       10 MQCA-TRIGGER-PROGRAM-NAME PIC S9(9) BINARY.
       10 MQCA-TRIGGER-TERM-ID PIC S9(9) BINARY.
       10 MQCA-TRIGGER-TRANS-ID PIC S9(9) BINARY.
       10 MQCA-USER-DATA PIC S9(9) BINARY.
       10 MQCA-USER-LIST PIC S9(9) BINARY.
       10 MQCA-VERSION PIC S9(9) BINARY.
       10 MQCA-XCF-GROUP-NAME PIC S9(9) BINARY.
       10 MQCA-XCF-MEMBER-NAME PIC S9(9) BINARY.
       10 MQCA-XMIT-Q-NAME PIC S9(9) BINARY.
       10 MQCA-XR-SSL-CIPHER-SUITES PIC S9(9) BINARY.
       10 MQCA-XR-VERSION PIC S9(9) BINARY.
       10 MQIA-ACCOUNTING-CONN-OVERRIDE PIC S9(9) BINARY.
       10 MQIA-ACCOUNTING-INTERVAL PIC S9(9) BINARY.
       10 MQIA-ACCOUNTING-MQI PIC S9(9) BINARY.
       10 MQIA-ACCOUNTING-Q PIC S9(9) BINARY.
       10 MQIA-ACTIVE-CHANNELS PIC S9(9) BINARY.
       10 MQIA-ACTIVITY-CONN-OVERRIDE PIC S9(9) BINARY.
       10 MQIA-ACTIVITY-RECORDING PIC S9(9) BINARY.
       10 MQIA-ACTIVITY-TRACE PIC S9(9) BINARY.
       10 MQIA-ADOPTNEWMCA-CHECK PIC S9(9) BINARY.
       10 MQIA-ADOPTNEWMCA-INTERVAL PIC S9(9) BINARY.
       10 MQIA-ADOPTNEWMCA-TYPE PIC S9(9) BINARY.
       10 MQIA-ADOPT-CONTEXT PIC S9(9) BINARY.
       10 MQIA-ADVANCED-CAPABILITY PIC S9(9) BINARY.
       10 MQIA-AMQP-CAPABILITY PIC S9(9) BINARY.
       10 MQIA-APPL-TYPE PIC S9(9) BINARY.
       10 MQIA-ARCHIVE PIC S9(9) BINARY.
       10 MQIA-AUTHENTICATION-FAIL-DELAY PIC S9(9) BINARY.
       10 MQIA-AUTHENTICATION-METHOD PIC S9(9) BINARY.
       10 MQIA-AUTHORITY-EVENT PIC S9(9) BINARY.
       10 MQIA-AUTH-INFO-TYPE PIC S9(9) BINARY.
       10 MQIA-AUTO-REORGANIZATION PIC S9(9) BINARY.
       10 MQIA-AUTO-REORG-INTERVAL PIC S9(9) BINARY.
       10 MQIA-BACKOUT-THRESHOLD PIC S9(9) BINARY.
       10 MQIA-BASE-TYPE PIC S9(9) BINARY.
       10 MQIA-BATCH-INTERFACE-AUTO PIC S9(9) BINARY.
       10 MQIA-BRIDGE-EVENT PIC S9(9) BINARY.
       10 MQIA-CAP-EXPIRY PIC S9(9) BINARY.
       10 MQIA-CERT-VAL-POLICY PIC S9(9) BINARY.
       10 MQIA-CF-CFCONLOS PIC S9(9) BINARY.
       10 MQIA-CF-LEVEL PIC S9(9) BINARY.
       10 MQIA-CF-OFFLDUSE PIC S9(9) BINARY.
       10 MQIA-CF-OFFLOAD PIC S9(9) BINARY.
       10 MQIA-CF-OFFLOAD-THRESHOLD1 PIC S9(9) BINARY.
       10 MQIA-CF-OFFLOAD-THRESHOLD2 PIC S9(9) BINARY.
       10 MQIA-CF-OFFLOAD-THRESHOLD3 PIC S9(9) BINARY.
       10 MQIA-CF-RECAUTO PIC S9(9) BINARY.
       10 MQIA-CF-RECOVER PIC S9(9) BINARY.
       10 MQIA-CF-SMDS-BUFFERS PIC S9(9) BINARY.
       10 MQIA-CHANNEL-AUTO-DEF PIC S9(9) BINARY.
       10 MQIA-CHANNEL-AUTO-DEF-EVENT PIC S9(9) BINARY.
       10 MQIA-CHANNEL-EVENT PIC S9(9) BINARY.
       10 MQIA-CHECK-CLIENT-BINDING PIC S9(9) BINARY.
       10 MQIA-CHECK-LOCAL-BINDING PIC S9(9) BINARY.
       10 MQIA-CHINIT-ADAPTERS PIC S9(9) BINARY.
       10 MQIA-CHINIT-CONTROL PIC S9(9) BINARY.
       10 MQIA-CHINIT-DISPATCHERS PIC S9(9) BINARY.
       10 MQIA-CHINIT-TRACE-AUTO-START PIC S9(9) BINARY.
       10 MQIA-CHINIT-TRACE-TABLE-SIZE PIC S9(9) BINARY.
       10 MQIA-CHLAUTH-RECORDS PIC S9(9) BINARY.
       10 MQIA-CLUSTER-OBJECT-STATE PIC S9(9) BINARY.
       10 MQIA-CLUSTER-PUB-ROUTE PIC S9(9) BINARY.
       10 MQIA-CLUSTER-Q-TYPE PIC S9(9) BINARY.
       10 MQIA-CLUSTER-WORKLOAD-LENGTH PIC S9(9) BINARY.
       10 MQIA-CLWL-MRU-CHANNELS PIC S9(9) BINARY.
       10 MQIA-CLWL-Q-PRIORITY PIC S9(9) BINARY.
       10 MQIA-CLWL-Q-RANK PIC S9(9) BINARY.
       10 MQIA-CLWL-USEQ PIC S9(9) BINARY.
       10 MQIA-CMD-SERVER-AUTO PIC S9(9) BINARY.
       10 MQIA-CMD-SERVER-CONTROL PIC S9(9) BINARY.
       10 MQIA-CMD-SERVER-CONVERT-MSG PIC S9(9) BINARY.
       10 MQIA-CMD-SERVER-DLQ-MSG PIC S9(9) BINARY.
       10 MQIA-CODED-CHAR-SET-ID PIC S9(9) BINARY.
       10 MQIA-COMMAND-EVENT PIC S9(9) BINARY.
       10 MQIA-COMMAND-LEVEL PIC S9(9) BINARY.
       10 MQIA-COMM-EVENT PIC S9(9) BINARY.
       10 MQIA-COMM-INFO-TYPE PIC S9(9) BINARY.
       10 MQIA-CONFIGURATION-EVENT PIC S9(9) BINARY.
       10 MQIA-CPI-LEVEL PIC S9(9) BINARY.
       10 MQIA-CURRENT-Q-DEPTH PIC S9(9) BINARY.
       10 MQIA-DEFINITION-TYPE PIC S9(9) BINARY.
       10 MQIA-DEF-BIND PIC S9(9) BINARY.
       10 MQIA-DEF-CLUSTER-XMIT-Q-TYPE PIC S9(9) BINARY.
       10 MQIA-DEF-INPUT-OPEN-OPTION PIC S9(9) BINARY.
       10 MQIA-DEF-PERSISTENCE PIC S9(9) BINARY.
       10 MQIA-DEF-PRIORITY PIC S9(9) BINARY.
       10 MQIA-DEF-PUT-RESPONSE-TYPE PIC S9(9) BINARY.
       10 MQIA-DEF-READ-AHEAD PIC S9(9) BINARY.
       10 MQIA-DISPLAY-TYPE PIC S9(9) BINARY.
       10 MQIA-DIST-LISTS PIC S9(9) BINARY.
       10 MQIA-DNS-WLM PIC S9(9) BINARY.
       10 MQIA-DURABLE-SUB PIC S9(9) BINARY.
       10 MQIA-ENCRYPTION-ALGORITHM PIC S9(9) BINARY.
       10 MQIA-EXPIRY-INTERVAL PIC S9(9) BINARY.
       10 MQIA-FIRST PIC S9(9) BINARY.
       10 MQIA-GROUP-UR PIC S9(9) BINARY.
       10 MQIA-HARDEN-GET-BACKOUT PIC S9(9) BINARY.
       10 MQIA-HIGH-Q-DEPTH PIC S9(9) BINARY.
       10 MQIA-IGQ-PUT-AUTHORITY PIC S9(9) BINARY.
       10 MQIA-INDEX-TYPE PIC S9(9) BINARY.
       10 MQIA-INHIBIT-EVENT PIC S9(9) BINARY.
       10 MQIA-INHIBIT-GET PIC S9(9) BINARY.
       10 MQIA-INHIBIT-PUB PIC S9(9) BINARY.
       10 MQIA-INHIBIT-PUT PIC S9(9) BINARY.
       10 MQIA-INHIBIT-SUB PIC S9(9) BINARY.
       10 MQIA-INTRA-GROUP-QUEUING PIC S9(9) BINARY.
       10 MQIA-IP-ADDRESS-VERSION PIC S9(9) BINARY.
       10 MQIA-KEY-REUSE-COUNT PIC S9(9) BINARY.
       10 MQIA-LAST PIC S9(9) BINARY.
       10 MQIA-LAST-USED PIC S9(9) BINARY.
       10 MQIA-LDAP-AUTHORMD PIC S9(9) BINARY.
       10 MQIA-LDAP-NESTGRP PIC S9(9) BINARY.
       10 MQIA-LDAP-SECURE-COMM PIC S9(9) BINARY.
       10 MQIA-LISTENER-PORT-NUMBER PIC S9(9) BINARY.
       10 MQIA-LISTENER-TIMER PIC S9(9) BINARY.
       10 MQIA-LOCAL-EVENT PIC S9(9) BINARY.
       10 MQIA-LOGGER-EVENT PIC S9(9) BINARY.
       10 MQIA-LU62-CHANNELS PIC S9(9) BINARY.
       10 MQIA-MASTER-ADMIN PIC S9(9) BINARY.
       10 MQIA-MAX-CHANNELS PIC S9(9) BINARY.
       10 MQIA-MAX-CLIENTS PIC S9(9) BINARY.
       10 MQIA-MAX-GLOBAL-LOCKS PIC S9(9) BINARY.
       10 MQIA-MAX-HANDLES PIC S9(9) BINARY.
       10 MQIA-MAX-LOCAL-LOCKS PIC S9(9) BINARY.
       10 MQIA-MAX-MSG-LENGTH PIC S9(9) BINARY.
       10 MQIA-MAX-OPEN-Q PIC S9(9) BINARY.
       10 MQIA-MAX-PRIORITY PIC S9(9) BINARY.
       10 MQIA-MAX-PROPERTIES-LENGTH PIC S9(9) BINARY.
       10 MQIA-MAX-Q-DEPTH PIC S9(9) BINARY.
       10 MQIA-MAX-Q-FILE-SIZE PIC S9(9) BINARY.
       10 MQIA-MAX-Q-TRIGGERS PIC S9(9) BINARY.
       10 MQIA-MAX-RECOVERY-TASKS PIC S9(9) BINARY.
       10 MQIA-MAX-RESPONSES PIC S9(9) BINARY.
       10 MQIA-MAX-UNCOMMITTED-MSGS PIC S9(9) BINARY.
       10 MQIA-MCAST-BRIDGE PIC S9(9) BINARY.
       10 MQIA-MEDIA-IMAGE-INTERVAL PIC S9(9) BINARY.
       10 MQIA-MEDIA-IMAGE-LOG-LENGTH PIC S9(9) BINARY.
       10 MQIA-MEDIA-IMAGE-RECOVER-OBJ PIC S9(9) BINARY.
       10 MQIA-MEDIA-IMAGE-RECOVER-Q PIC S9(9) BINARY.
       10 MQIA-MEDIA-IMAGE-SCHEDULING PIC S9(9) BINARY.
       10 MQIA-MONITORING-AUTO-CLUSSDR PIC S9(9) BINARY.
       10 MQIA-MONITORING-CHANNEL PIC S9(9) BINARY.
       10 MQIA-MONITORING-Q PIC S9(9) BINARY.
       10 MQIA-MONITOR-INTERVAL PIC S9(9) BINARY.
       10 MQIA-MSG-DELIVERY-SEQUENCE PIC S9(9) BINARY.
       10 MQIA-MSG-DEQ-COUNT PIC S9(9) BINARY.
       10 MQIA-MSG-ENQ-COUNT PIC S9(9) BINARY.
       10 MQIA-MSG-MARK-BROWSE-INTERVAL PIC S9(9) BINARY.
       10 MQIA-MULTICAST PIC S9(9) BINARY.
       10 MQIA-NAMELIST-TYPE PIC S9(9) BINARY.
       10 MQIA-NAME-COUNT PIC S9(9) BINARY.
       10 MQIA-NPM-CLASS PIC S9(9) BINARY.
       10 MQIA-NPM-DELIVERY PIC S9(9) BINARY.
       10 MQIA-OPEN-INPUT-COUNT PIC S9(9) BINARY.
       10 MQIA-OPEN-OUTPUT-COUNT PIC S9(9) BINARY.
       10 MQIA-OUTBOUND-PORT-MAX PIC S9(9) BINARY.
       10 MQIA-OUTBOUND-PORT-MIN PIC S9(9) BINARY.
       10 MQIA-PAGESET-ID PIC S9(9) BINARY.
       10 MQIA-PERFORMANCE-EVENT PIC S9(9) BINARY.
       10 MQIA-PLATFORM PIC S9(9) BINARY.
       10 MQIA-PM-DELIVERY PIC S9(9) BINARY.
       10 MQIA-POLICY-VERSION PIC S9(9) BINARY.
       10 MQIA-PROPERTY-CONTROL PIC S9(9) BINARY.
       10 MQIA-PROT-POLICY-CAPABILITY PIC S9(9) BINARY.
       10 MQIA-PROXY-SUB PIC S9(9) BINARY.
       10 MQIA-PUBSUB-CLUSTER PIC S9(9) BINARY.
       10 MQIA-PUBSUB-MAXMSG-RETRY-COUNT PIC S9(9) BINARY.
       10 MQIA-PUBSUB-MODE PIC S9(9) BINARY.
       10 MQIA-PUBSUB-NP-MSG PIC S9(9) BINARY.
       10 MQIA-PUBSUB-NP-RESP PIC S9(9) BINARY.
       10 MQIA-PUBSUB-SYNC-PT PIC S9(9) BINARY.
       10 MQIA-PUB-COUNT PIC S9(9) BINARY.
       10 MQIA-PUB-SCOPE PIC S9(9) BINARY.
       10 MQIA-QMGR-CFCONLOS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CONS-COMMS-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CONS-CRITICAL-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CONS-ERROR-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CONS-INFO-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CONS-REORG-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CONS-SYSTEM-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CONS-WARNING-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-CSMT-ON-ERROR PIC S9(9) BINARY.
       10 MQIA-QMOPT-INTERNAL-DUMP PIC S9(9) BINARY.
       10 MQIA-QMOPT-LOG-COMMS-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-LOG-CRITICAL-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-LOG-ERROR-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-LOG-INFO-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-LOG-REORG-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-LOG-SYSTEM-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-LOG-WARNING-MSGS PIC S9(9) BINARY.
       10 MQIA-QMOPT-TRACE-COMMS PIC S9(9) BINARY.
       10 MQIA-QMOPT-TRACE-CONVERSION PIC S9(9) BINARY.
       10 MQIA-QMOPT-TRACE-MQI-CALLS PIC S9(9) BINARY.
       10 MQIA-QMOPT-TRACE-REORG PIC S9(9) BINARY.
       10 MQIA-QMOPT-TRACE-SYSTEM PIC S9(9) BINARY.
       10 MQIA-QSG-DISP PIC S9(9) BINARY.
       10 MQIA-Q-DEPTH-HIGH-EVENT PIC S9(9) BINARY.
       10 MQIA-Q-DEPTH-HIGH-LIMIT PIC S9(9) BINARY.
       10 MQIA-Q-DEPTH-LOW-EVENT PIC S9(9) BINARY.
       10 MQIA-Q-DEPTH-LOW-LIMIT PIC S9(9) BINARY.
       10 MQIA-Q-DEPTH-MAX-EVENT PIC S9(9) BINARY.
       10 MQIA-Q-SERVICE-INTERVAL PIC S9(9) BINARY.
       10 MQIA-Q-SERVICE-INTERVAL-EVENT PIC S9(9) BINARY.
       10 MQIA-Q-TYPE PIC S9(9) BINARY.
       10 MQIA-Q-USERS PIC S9(9) BINARY.
       10 MQIA-READ-AHEAD PIC S9(9) BINARY.
       10 MQIA-RECEIVE-TIMEOUT PIC S9(9) BINARY.
       10 MQIA-RECEIVE-TIMEOUT-MIN PIC S9(9) BINARY.
       10 MQIA-RECEIVE-TIMEOUT-TYPE PIC S9(9) BINARY.
       10 MQIA-REMOTE-EVENT PIC S9(9) BINARY.
       10 MQIA-RESPONSE-RESTART-POINT PIC S9(9) BINARY.
       10 MQIA-RETENTION-INTERVAL PIC S9(9) BINARY.
       10 MQIA-REVERSE-DNS-LOOKUP PIC S9(9) BINARY.
       10 MQIA-SCOPE PIC S9(9) BINARY.
       10 MQIA-SECURITY-CASE PIC S9(9) BINARY.
       10 MQIA-SERVICE-CONTROL PIC S9(9) BINARY.
       10 MQIA-SERVICE-TYPE PIC S9(9) BINARY.
       10 MQIA-SHAREABILITY PIC S9(9) BINARY.
       10 MQIA-SHARED-Q-Q-MGR-NAME PIC S9(9) BINARY.
       10 MQIA-SIGNATURE-ALGORITHM PIC S9(9) BINARY.
       10 MQIA-SSL-EVENT PIC S9(9) BINARY.
       10 MQIA-SSL-FIPS-REQUIRED PIC S9(9) BINARY.
       10 MQIA-SSL-RESET-COUNT PIC S9(9) BINARY.
       10 MQIA-SSL-TASKS PIC S9(9) BINARY.
       10 MQIA-START-STOP-EVENT PIC S9(9) BINARY.
       10 MQIA-STATISTICS-AUTO-CLUSSDR PIC S9(9) BINARY.
       10 MQIA-STATISTICS-CHANNEL PIC S9(9) BINARY.
       10 MQIA-STATISTICS-INTERVAL PIC S9(9) BINARY.
       10 MQIA-STATISTICS-MQI PIC S9(9) BINARY.
       10 MQIA-STATISTICS-Q PIC S9(9) BINARY.
       10 MQIA-STREAM-QUEUE-QOS PIC S9(9) BINARY.
       10 MQIA-SUB-CONFIGURATION-EVENT PIC S9(9) BINARY.
       10 MQIA-SUB-COUNT PIC S9(9) BINARY.
       10 MQIA-SUB-SCOPE PIC S9(9) BINARY.
       10 MQIA-SUITE-B-STRENGTH PIC S9(9) BINARY.
       10 MQIA-SYNCPOINT PIC S9(9) BINARY.
       10 MQIA-TCP-CHANNELS PIC S9(9) BINARY.
       10 MQIA-TCP-KEEP-ALIVE PIC S9(9) BINARY.
       10 MQIA-TCP-STACK-TYPE PIC S9(9) BINARY.
       10 MQIA-TIME-SINCE-RESET PIC S9(9) BINARY.
       10 MQIA-TOLERATE-UNPROTECTED PIC S9(9) BINARY.
       10 MQIA-TOPIC-DEF-PERSISTENCE PIC S9(9) BINARY.
       10 MQIA-TOPIC-NODE-COUNT PIC S9(9) BINARY.
       10 MQIA-TOPIC-TYPE PIC S9(9) BINARY.
       10 MQIA-TRACE-ROUTE-RECORDING PIC S9(9) BINARY.
       10 MQIA-TREE-LIFE-TIME PIC S9(9) BINARY.
       10 MQIA-TRIGGER-CONTROL PIC S9(9) BINARY.
       10 MQIA-TRIGGER-DEPTH PIC S9(9) BINARY.
       10 MQIA-TRIGGER-INTERVAL PIC S9(9) BINARY.
       10 MQIA-TRIGGER-MSG-PRIORITY PIC S9(9) BINARY.
       10 MQIA-TRIGGER-RESTART PIC S9(9) BINARY.
       10 MQIA-TRIGGER-TYPE PIC S9(9) BINARY.
       10 MQIA-UR-DISP PIC S9(9) BINARY.
       10 MQIA-USAGE PIC S9(9) BINARY.
       10 MQIA-USER-LIST PIC S9(9) BINARY.
       10 MQIA-USE-DEAD-LETTER-Q PIC S9(9) BINARY.
       10 MQIA-WILDCARD-OPERATION PIC S9(9) BINARY.
       10 MQIA-XR-CAPABILITY PIC S9(9) BINARY.
       10 MQIAV-NOT-APPLICABLE PIC S9(9) BINARY.
       10 MQIAV-UNDEFINED PIC S9(9) BINARY.
       10 MQMCB-DISABLED PIC S9(9) BINARY.
       10 MQMCB-ENABLED PIC S9(9) BINARY.
       10 MQKEY-REUSE-DISABLED PIC S9(9) BINARY.
       10 MQKEY-REUSE-UNLIMITED PIC S9(9) BINARY.
       10 MQGA-FIRST PIC S9(9) BINARY.
       10 MQGA-LAST PIC S9(9) BINARY.
       10 MQOO-BIND-AS-Q-DEF PIC S9(9) BINARY.
       10 MQOO-READ-AHEAD-AS-Q-DEF PIC S9(9) BINARY.
       10 MQOO-INPUT-AS-Q-DEF PIC S9(9) BINARY.
       10 MQOO-INPUT-SHARED PIC S9(9) BINARY.
       10 MQOO-INPUT-EXCLUSIVE PIC S9(9) BINARY.
       10 MQOO-BROWSE PIC S9(9) BINARY.
       10 MQOO-OUTPUT PIC S9(9) BINARY.
       10 MQOO-INQUIRE PIC S9(9) BINARY.
       10 MQOO-SET PIC S9(9) BINARY.
       10 MQOO-SAVE-ALL-CONTEXT PIC S9(9) BINARY.
       10 MQOO-PASS-IDENTITY-CONTEXT PIC S9(9) BINARY.
       10 MQOO-PASS-ALL-CONTEXT PIC S9(9) BINARY.
       10 MQOO-SET-IDENTITY-CONTEXT PIC S9(9) BINARY.
       10 MQOO-SET-ALL-CONTEXT PIC S9(9) BINARY.
       10 MQOO-ALTERNATE-USER-AUTHORITY PIC S9(9) BINARY.
       10 MQOO-FAIL-IF-QUIESCING PIC S9(9) BINARY.
       10 MQOO-BIND-ON-OPEN PIC S9(9) BINARY.
       10 MQOO-BIND-ON-GROUP PIC S9(9) BINARY.
       10 MQOO-BIND-NOT-FIXED PIC S9(9) BINARY.
       10 MQOO-CO-OP PIC S9(9) BINARY.
       10 MQOO-NO-READ-AHEAD PIC S9(9) BINARY.
       10 MQOO-READ-AHEAD PIC S9(9) BINARY.
       10 MQOO-NO-MULTICAST PIC S9(9) BINARY.
       10 MQOO-RESOLVE-LOCAL-Q PIC S9(9) BINARY.
       10 MQOO-RESOLVE-LOCAL-TOPIC PIC S9(9) BINARY.
       10 MQOO-RESOLVE-NAMES PIC S9(9) BINARY.
       10 MQTYPE-AS-SET PIC S9(9) BINARY.
       10 MQTYPE-NULL PIC S9(9) BINARY.
       10 MQTYPE-BOOLEAN PIC S9(9) BINARY.
       10 MQTYPE-BYTE-STRING PIC S9(9) BINARY.
       10 MQTYPE-INT8 PIC S9(9) BINARY.
       10 MQTYPE-INT16 PIC S9(9) BINARY.
       10 MQTYPE-INT32 PIC S9(9) BINARY.
       10 MQTYPE-LONG PIC S9(9) BINARY.
       10 MQTYPE-INT64 PIC S9(9) BINARY.
       10 MQTYPE-FLOAT32 PIC S9(9) BINARY.
       10 MQTYPE-FLOAT64 PIC S9(9) BINARY.
       10 MQTYPE-STRING PIC S9(9) BINARY.
       10 MQVL-NULL-TERMINATED PIC S9(9) BINARY.
       10 MQVL-EMPTY-STRING PIC S9(9) BINARY.
       10 MQSTAT-TYPE-ASYNC-ERROR PIC S9(9) BINARY.
       10 MQSTAT-TYPE-RECONNECTION PIC S9(9) BINARY.
       10 MQSTAT-TYPE-RECONNECTION-ERROR PIC S9(9) BINARY.
       10 MQSO-NONE PIC S9(9) BINARY.
       10 MQSO-NON-DURABLE PIC S9(9) BINARY.
       10 MQSO-READ-AHEAD-AS-Q-DEF PIC S9(9) BINARY.
       10 MQSO-ALTER PIC S9(9) BINARY.
       10 MQSO-CREATE PIC S9(9) BINARY.
       10 MQSO-RESUME PIC S9(9) BINARY.
       10 MQSO-DURABLE PIC S9(9) BINARY.
       10 MQSO-GROUP-SUB PIC S9(9) BINARY.
       10 MQSO-MANAGED PIC S9(9) BINARY.
       10 MQSO-SET-IDENTITY-CONTEXT PIC S9(9) BINARY.
       10 MQSO-NO-MULTICAST PIC S9(9) BINARY.
       10 MQSO-FIXED-USERID PIC S9(9) BINARY.
       10 MQSO-ANY-USERID PIC S9(9) BINARY.
       10 MQSO-PUBLICATIONS-ON-REQUEST PIC S9(9) BINARY.
       10 MQSO-NEW-PUBLICATIONS-ONLY PIC S9(9) BINARY.
       10 MQSO-FAIL-IF-QUIESCING PIC S9(9) BINARY.
       10 MQSO-ALTERNATE-USER-AUTHORITY PIC S9(9) BINARY.
       10 MQSO-WILDCARD-CHAR PIC S9(9) BINARY.
       10 MQSO-WILDCARD-TOPIC PIC S9(9) BINARY.
       10 MQSO-SET-CORREL-ID PIC S9(9) BINARY.
       10 MQSO-SCOPE-QMGR PIC S9(9) BINARY.
       10 MQSO-NO-READ-AHEAD PIC S9(9) BINARY.
       10 MQSO-READ-AHEAD PIC S9(9) BINARY.
       10 MQSR-ACTION-PUBLICATION PIC S9(9) BINARY.
       10 MQ-MQTT-MAX-KEEP-ALIVE PIC S9(9) BINARY.
       10 MQ-SSL-KEY-PASSPHRASE-LENGTH PIC S9(9) BINARY.
