       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-INVALID-RENAMES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REC-A.
       05 PART-A PIC X(4).
       05 PART-B PIC X(4).
       66 RANGE-A RENAMES PART-B THRU PART-A.
       01 WS-PGM PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE RANGE-A TO WS-PGM.
       CALL WS-PGM.
       GOBACK.
