       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-OVERLAY-BRANCH.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       01 VIEW-A REDEFINES WS-PGM.
       05 ALIAS-A PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       IF FLAG = 'A'
       MOVE 'PROGA' TO ALIAS-A
       ELSE
       MOVE 'PROGB' TO ALIAS-A
       END-IF.
       CALL WS-PGM.
       GOBACK.
