       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-OVERLAY-REVERSE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       01 VIEW-A REDEFINES WS-PGM.
       05 ALIAS-A PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE 'PROGB' TO ALIAS-A.
       CALL WS-PGM.
       GOBACK.
