       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-OVERLAY-FORWARD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RAW-A PIC X(8).
       01 VIEW-A REDEFINES RAW-A.
       05 WS-PGM PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE 'PROGA' TO RAW-A.
       CALL WS-PGM.
       GOBACK.
