       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-OVERLAY-OPEN-ROOT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(12).
       01 VIEW-A REDEFINES WS-PGM.
       05 PREFIX-A PIC X(4).
       05 PGM-A PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE 'PROGA' TO PGM-A.
       CALL WS-PGM.
       GOBACK.
