       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-PADDING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SRC-REC.
       05 SRC-A PIC X(5).
       01 DST-REC.
       05 WS-PGM PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE 'PROGA' TO SRC-REC.
       MOVE SRC-REC TO DST-REC.
       CALL WS-PGM.
       GOBACK.
