       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-RENAMES-FILLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REC-A.
       05 PART-A PIC X(2).
       05 FILLER PIC X(2).
       05 PART-B PIC X(4).
       66 RANGE-A RENAMES PART-A THRU PART-B.
       01 WS-PGM PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE 'PROGA001' TO REC-A.
       MOVE RANGE-A TO WS-PGM.
       CALL WS-PGM.
       GOBACK.
