       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-UNSUPPORTED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REC-A.
       05 WS-PGM PIC X(8).
       05 CODE-A PIC 9(4) COMP.
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE 'PROGA   1234' TO REC-A.
       CALL WS-PGM.
       GOBACK.
