       IDENTIFICATION DIVISION.
       PROGRAM-ID. W2-W1-A.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DADOS.
       05 WS-PGM PIC X(8).
       05 WS-COD PIC X(4).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE 'PROGA   1234' TO WS-DADOS.
       CALL WS-PGM.
       GOBACK.
