       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 1000 TIMES.
       01 ALIAS-DATA REDEFINES TABLE-DATA.
       05 OTHER-DEST PIC X(8) OCCURS 1000 TIMES.
       01 IDX PIC 9(4).
       PROCEDURE DIVISION.
       MOVE 'FIRST' TO DEST(1).
       MOVE 'OTHER' TO DEST(2).
       MOVE 'NEW' TO OTHER-DEST(IDX).
       CALL DEST(1).
       GOBACK.
