       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 2 TIMES VALUE 'OLD'.
       01 IDX PIC 9.
       PROCEDURE DIVISION.
       MOVE 'FIRST' TO DEST(1).
       MOVE 'SECOND' TO DEST(2).
       CALL DEST(IDX).
       GOBACK.
