       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 1000 TIMES.
       01 IDX PIC 9(4).
       PROCEDURE DIVISION.
       MOVE 2 TO IDX.
       MOVE 'OTHER' TO DEST(1).
       MOVE 'GOOD' TO DEST(500 * IDX).
       CALL DEST(500 * IDX).
       GOBACK.
