       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 2 TIMES.
       PROCEDURE DIVISION.
       MOVE 'FIRST   SECOND  ' TO TABLE-DATA.
       CALL DEST(2).
       GOBACK.
