       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 1000 TIMES.
       01 IDX PIC 9(4).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 1000 TO IDX.
       MOVE 'OTHER' TO DEST(1).
       PERFORM STORE-X.
       PERFORM READ-X.
       GOBACK.
       STORE-X.
       MOVE 'GOOD' TO DEST(IDX).
       READ-X.
       CALL DEST(IDX).
