       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 1000 TIMES.
       PROCEDURE DIVISION.
       MOVE 'OLD' TO DEST(1).
       INITIALIZE TABLE-DATA.
       CALL DEST(1).
       GOBACK.
