       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 50000 TIMES.
       01 IDX PIC 9(6).
       PROCEDURE DIVISION.
       PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 50000
       CALL 'GOOD' USING DEST(IDX)
       END-PERFORM.
       GOBACK.
