       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 ROW-X OCCURS 50 TIMES.
       10 DEST PIC X(8) OCCURS 50 TIMES.
       PROCEDURE DIVISION.
       MOVE 'OTHER' TO DEST(50, 50).
       MOVE 'GOOD' TO DEST(1, 2).
       CALL DEST(1, 2).
       GOBACK.
