       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 100 TIMES.
       PROCEDURE DIVISION.
       MOVE 'OLD' TO DEST(1).
       MOVE 'OTHER' TO DEST(100).
       MOVE 'GOOD' TO DEST(1).
       CALL DEST(1).
       GOBACK.
