       IDENTIFICATION DIVISION.
       PROGRAM-ID. SPARSE-TABLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-DATA.
       05 DEST PIC X(8) OCCURS 1000 TIMES.
       01 INPUT-X PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'OLD' TO DEST(3).
       MOVE INPUT-X TO DEST(3).
       CALL DEST(3).
       GOBACK.
